{
    "https://www.glassdoor.com/job-listing/engineer-i-software-general-dynamics-electric-boat-JV_KO0,19_KE20,50.htm?jl=1008903556940": {
        "Data": [
            "Overview:  General Dynamics is the world's foremost designer and builder of nuclear submarines. We are a team of like-minded people pushing the boundaries of state of the art applications for submarine design, manufacturing and construction. The IT Supply Chain Oracle development group has openings for highly motivated software engineers to support Electric Boat’s customization of our mainframe application suite. These applications span both our financial and design and build capabilities which will support our goal of reducing program cost and prepare the company to face the challenges and opportunities of a modernized digital enterprise. Our team members must have strong verbal and written communication skills with technical and non-technical audiences. You will grow your skills, work with the cutting edge technologies and introduce new tools and techniques to the team. There are plenty of opportunities for leadership growth as well. Responsibilities include: Primarily responsible for developing customizations for EB’s mainframe applications that support Finance applications as well as applications that support the design and building capabilities Maintenance of software applications throughout the lifecycle of the product Works closely with end users and other development teams to translate functional and design specifications into technical solutions. Excellent communication skills preferred to define, plan and configure complex software application solutions Build and maintain technical specifications to reflect as-built state Qualifications:  Required: Bachelor of Science Degree in Computer Science, Computer Engineering, Software Engineering or Bachelor of Science equivalent technical degree. Internal candidates must come from outside Operations (Casciano/Gabriel) Preferred: At least 2 years of related experience in developing software applications Willingness to learn new programming languages and environments Strong verbal and communication skills Must have an understanding of the agile principles and scrum methodology Must have an enthusiasm for working in high performing team environment and collaborating with customers and end-users to define scope and design Excellent problem solving skills Ability to multitask and still stay focused on release priorities Desire to mentor team members Skills:  Desired Skills: Knowledge of the COBOL programming language Mainframe navigation, editing and scanning Transactional processing Batch Programming and Processing SAS and TELON Programming and processing Knowledge of advanced debugging tools. Languages: Mainframe COBOL, JCL Databases: IMS Technologies: MQ SeriesShow more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Software Suite",
            "COBOL (Programming Language)",
            "Design Specifications",
            "CA-Telon",
            "Software Engineering",
            "Finance",
            "Batch Files",
            "Scrum (Software Development)",
            "IBM WebSphere MQ",
            "Job Control Language (JCL)",
            "Computer Engineering",
            "Oracle Development",
            "Computer Science",
            "Agile Methodology",
            "SAS (Software)"
        ],
        "Soft Skills": [
            "Enthusiasm",
            "Self-Motivation",
            "Multitasking",
            "Writing",
            "Willingness To Learn",
            "Problem Solving",
            "Communications",
            "Leadership",
            "Operations",
            "Editing"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-onsite-collins-aerospace-JV_KO0,31_KE32,49.htm?jl=1008911629019": {
        "Data": [
            "Date Posted: 2023-09-28 Country: United States of America Location: 01: Building 01 Windsor Locks One Hamilton Road, Windsor Locks, CT, 06096 USA Position Role Type: Onsite Are you looking to Do Something Cool on your software journey? How about developing world-class computing platforms that are critical to aircraft performance and passenger comfort? As a senior software engineer, you will contribute to a collaborate team that will create high quality products that meet rigid safety and airworthiness standards. As a member of our team, you will be involved in the design, development, verification, and integration of our environmental and airframe control systems. This role will be a part of a collaborate onsite team based in Windsor Locks, CT. What YOU will do: You will be involved with requirements generation- Authoring and decomposing High- and Low-Level Requirements You will Design and Code Software Modules (C, Ada, Python) You will demonstrate technical expertise in processing platforms and the associated technologies You will work within a small team environment where their designs and efforts contribute to a greater collective product. You will be involved with Software Verification – Test Case, Procedure, and plan execution. You will model Systems and Controls – Designing and updating Control Models You will identify and advocate improvement to processes and technical solutions which affect the team and/or product. You will effectively communication with internal teams, customers, and leadership What YOU will learn: You will learn to deliver new complex software features to customers in alignment with product road maps. You will grow your professional skills by being trained on modern technology stacks and become more knowledgeable in the aerospace industry. Education & Experience: Typically requires a degree in Science, Technology, Engineering or Mathematics (STEM) unless prohibited by local laws/regulations and minimum 5 years prior relevant experience or an Advanced Degree in a related field and minimum 3 years of experience or in absence of a degree, 9 years of relevant experience U.S. Person (U.S. citizen, permanent resident, refugee or asylee) or eligible to obtain necessary export authorizations required https://www.ecfr.gov/current/title-22/chapter-I/subchapter-M/part-120/subpart-C/section-120.62 Skills you must have: Software & System Engineering experience Skills we value: An aptitude for debugging and troubleshooting Software defects. Matlab, Ada, C, Python, Linux, MS Office experience Experience coding in C++ and Python Collins Aerospace, an RTX company, is a leader in technologically advanced and intelligent solutions for the global aerospace and defense industry. Collins Aerospace has the capabilities, comprehensive portfolio, and expertise to solve customers’ toughest challenges and to meet the demands of a rapidly evolving global market. We make modern flight possible for millions of travelers and our military every second. Our major product lines are on-board virtually every aircraft flying. Be it keeping passengers safe with our emergency power generation systems or creating a positive in flight experience through reliable cabin pressure controls and quieter engines, Power & Controls focuses on delivering a best-in-class experience to our customers. We hire the top people in the industry. Their ideas drive our performance, and their integrity keeps our customers happy. Join us as we take flight! Collins Aerospace makes modern flight possible. Of course, that wouldn’t be possible without the capabilities and technologies of our organization, as well as our engineers – a highly skilled, accomplished network that spans more than 180 sites, 24 countries and 6 Strategic Business Units (SBUs). Our industry-leading experts are setting the standards for the aerospace industry and paving the way for the future. But as new challenges present themselves, we need fresh, creative and motivated minds to overcome these hurdles, help us break barriers and achieve new levels of innovation. Do you have what it takes to join a global, diverse organization that doesn’t shy away from big opportunities? If so, we invite you to join our ranks and create the next generation of aerospace technologies. Together, we will nurture an engineering culture that values intellectual curiosity, risk takers and integrity. A place where we will challenge ourselves, our teams, and the status quo and where we will work to find a way – the right way – to achieve what others can only dream of. Collins Aerospace Diversity & Inclusion Statement: Diversity drives innovation; inclusion drives success. We believe a multitude of approaches and ideas enable us to deliver the best results for our workforce, workplace, and customers. We are committed to fostering a culture where all employees can share their passions and ideas so we can tackle the toughest challenges in our industry and pave new paths to limitless possibility. WE ARE REDEFINING AEROSPACE. Please ensure the role type (defined below) is appropriate for your needs before applying to this role. Onsite: Employees who are working in Onsite roles will work primarily onsite. This includes all production and maintenance employees, as they are essential to the development of our products. Regardless of your role type, collaboration and innovation are critical to our business and all employees will have access to digital tools so they can work with colleagues around the world – and access to Collins sites when their work requires in-person meetings. Some of our competitive benefits package includes: Medical, dental, and vision insurance Three weeks of vacation for newly hired employees Generous 401(k) plan that includes employer matching funds and separate employer retirement contribution, including a Lifetime Income Strategy option Tuition reimbursement program Student Loan Repayment Program Life insurance and disability coverage Optional coverages you can buy: pet insurance, home and auto insurance, additional life and accident insurance, critical illness insurance, group legal, ID theft protection Birth, adoption, parental leave benefits Ovia Health, fertility, and family planning Adoption Assistance Autism Benefit Employee Assistance Plan, including up to 10 free counseling sessions Healthy You Incentives, wellness rewards program Doctor on Demand, virtual doctor visits Bright Horizons, child and elder care services Teladoc Medical Experts, second opinion program  And more! At Collins, the paths we pave together lead to limitless possibility. And the bonds we form – with our customers and with each other - propel us all higher, again and again. Apply now and be part of the team that’s redefining aerospace, every day. RTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class. Privacy Policy and Terms: Click on this link to read the Policy and TermsShow more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Software Modules",
            "C++ (Programming Language)",
            "Cabin Pressurization",
            "Systems Engineering",
            "Linux",
            "Aerospace Industry",
            "Aerospace Technology",
            "Python (Programming Language)",
            "Test Case",
            "Product Roadmaps",
            "Software Features",
            "International Finance",
            "MATLAB",
            "Paving",
            "Airworthiness",
            "Computing Platforms",
            "Pet Insurance Claims",
            "Business Strategies",
            "C (Programming Language)",
            "Loyalty Programs",
            "Critical Illness Insurance",
            "Software Development",
            "Autism Spectrum Disorders"
        ],
        "Soft Skills": [
            "Intellectual Curiosity",
            "Communications",
            "Advocacy",
            "Mathematics",
            "Plan Execution",
            "Leadership",
            "Innovation",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/vp-software-engineering-personal-insurance-the-travelers-companies-inc-JV_KO0,42_KE43,70.htm?jl=1008887733983": {
        "Data": [
            "Who Are We? Taking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it. Job Category Technology Compensation Overview The annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards. Salary Range $195,900.00 - $313,600.00 Target Openings 1 What Is the Opportunity? Travelers is seeking a VP, SW Engineering to join our organization as we grow and transform our Technology landscape. Individual will define the technical vision and strategy that guides engineers across departments, remove widely-felt barriers to productivity, find ways to make the entire software engineering organization more effective at delivering products and infrastructure and manage and lead the development and work products of software engineers. What Will You Do? Lead multiple teams of Software Engineers within PI Technology while role modeling Travelers' leadership behaviors. Serve as both an internally and externally recognized thought leader and expert. Create and maintain best practices, guardrails and standards across the Travelers' Software Engineering discipline. Identify and build support for technical initiatives that address Travelers' most important needs. Create significant and lasting impacts on Travelers' business and engineering goals while enabling others to reach their goals. Lead efforts to utilize technology to develop and redesign organizational processes. Foster a culture of innovation and ensure the best use of resources by aligning and building strategic and collaborative relationships with key leaders across the organization. Provide technical leadership, foster a team environment, and provide mentorship and feedback to technical resources. Develop robust talent pipeline. Provide unique opportunities and challenges to each team member to enrich development. Ensure the strength of Travelers' engineering brand while attracting talent. Seek opportunities to expand technical knowledge and capabilities. Perform other duties as assigned What Will Our Ideal Candidate Have? Nine years of programming/development experience preferred, in addition to managing large teams of engineers preferred. Delivery - Excellent delivery skills including the ability to create or identify tools to help engineers deliver, design, test and monitor software that can be used across the industry as well as the ability to design systems that can be maintained without the originators continued involvement. Domain Expertise - Demonstrated track record of domain expertise including the ability to contribute to the advancement of the wider industry and the ability to leverage expertise to derive solutions to long-standing or seemingly intractable problems. Problem Solving - Exceptional problem solver with the ability to create architecture that receives near-unanimous acceptance and adoption and provides continual benefit with little overhead and the ability to create new technologies that solve industry-wide problems. Communication - Excellent communicator who can effectively translate technology concepts into business language and adjust as needed to target audience as well as create spaces and channels that improve cross-team and inter-departmental communication. Leadership - Excellent leadership skills including the ability to effectively influence across multiple teams, organizations and across the enterprise. What is a Must Have? Bachelor's degree in Computer Science or a related field or its equivalent in work experience. Seven years of programming/development experience. Three years of technical leadership experience. What Is in It for You? Health Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment. Retirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers. Paid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays. Wellness Program: The Travelers wellness program is comprised of tools and resources that empower you to achieve your wellness goals. In addition, our Life Balance program provides access to professional counseling services, life coaching and other resources to support your daily life needs. Through Life Balance, you’re eligible for five free counseling sessions with a licensed therapist. Volunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice. Employment Practices Travelers is an equal opportunity employer. We believe that we can deliver the very best products and services when our workforce reflects the diverse customers and communities we serve. We are committed to recruiting, retaining and developing the diverse talent of all of our employees and fostering an inclusive workplace, where we celebrate differences, promote belonging, and work together to deliver extraordinary results. If you are a candidate and have specific questions regarding the physical requirements of this role, please send us an email so we may assist you. Travelers reserves the right to fill this position at a level above or below the level included in this posting. To learn more about our comprehensive benefit programs please visit http://careers.travelers.com/life-at-travelers/benefits/.Show more Report"
        ],
        "Hard Skills": [
            "Target Audience",
            "Talent Pipelining",
            "Software Engineering",
            "Thought Leadership",
            "Technical Leadership",
            "Computer Science",
            "Loans"
        ],
        "Soft Skills": [
            "Influencing Skills",
            "Communications",
            "Leadership",
            "Collaboration",
            "Problem Solving",
            "Innovation",
            "Mentorship"
        ]
    },
    "https://www.glassdoor.com/job-listing/automation-engineer-cvs-health-JV_KO0,19_KE20,30.htm?jl=1008920913546": {
        "Data": [
            "Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand — with heart at its center — our purpose sends a personal message that how we deliver our services is just as important as what we deliver.  Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable. Position Summary Come join a dedicated team of DevOps Engineers committed to excellence! Be part of a fast-paced, innovative, and collaborative environment with a focus on driving enterprise automation in support of top priorities across the organization. As part of a cross-functional Agile team, you will collaborate with product, technology, and engineering teams to create exciting new products that will span various teams within Automation & Platforms Services. These technologies include Middleware, Web, Integration, Database, ETL, Data Analytics, Messaging, Business Intelligence Tooling. The person in this role must have a growth mindset, have an appetite for continuous learning and a curiosity for new and emerging tools, technology, patterns, methodologies, and market offerings. This candidate must be detail-oriented, possess excellent customer service & communications skills. Required Qualifications 5+ years’ experience as a DevOps Engineer 5+ years of experience working in a paired programming collaborative environment, contributing to agile ceremonies 5+ years of experience using and administering build automation, continuous integration, and source code management CI/CD tools (e.g., Git, Jenkins). 5+ years of experience with Jenkins as a RESTful endpoint service and job creation using Groovy. 5+ years of experience in authoring Unit & Contract tests using frameworks such as Ansible Molecule and Chef Test Kitchen or similar testing framework 5+ years of experience participating and/or leading system demonstrations for program stakeholders. A good understanding and working knowledge of the Agile software development process. 2+ years of experience in Agile Program management tools (e.g. Rally, JIRA, Miro) 2+ years of experience with API development or similar API management platforms is a plus. 2+ years of experience in Ansible custom module creation using Python and PowerShell is a plus. Preferred Qualifications Cloud development experience PaaS, SaaS development experience Excellent written and verbal communication skills Education Bachelor's degree in Computer Science, Engineering or similar field preferred Minimum of a High School Diploma/GED with 2 years of related work experience Pay Range The typical pay range for this role is: $94,500.00 - $196,000.00 This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.  In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company’s 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (“PTO”) or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated. You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work. CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.Show more Report"
        ],
        "Hard Skills": [
            "API Management",
            "Agile Methodology",
            "Agile Software Development",
            "Chef (Configuration Management Tool)",
            "TeleCommunications Relay Services",
            "Git (Version Control System)",
            "Python (Programming Language)",
            "Miro",
            "Continuous Integration",
            "Build Automation",
            "Application Programming Interface (API)",
            "Test Kitchen",
            "JIRA",
            "Ansible",
            "RESTful API",
            "Jenkins",
            "Cloud Development",
            "DevOps",
            "Extract Transform Load (ETL)",
            "Middleware",
            "CI/CD",
            "Windows PowerShell",
            "Computer Science",
            "Version Control",
            "Software As A Service (SaaS)",
            "Platform As A Service (PaaS)",
            "Data Analysis",
            "Business Intelligence",
            "Automation",
            "Demonstration Skills"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Curiosity",
            "Verbal Communication Skills",
            "Growth Mindedness",
            "Program Management",
            "Communications",
            "Customer Service",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/director-software-engineering-interlink-ft-remote-webster-bank-JV_KO0,49_KE50,62.htm?jl=1008919004190": {
        "Data": [
            "If you’re looking for a meaningful career, you’ll find it here at Webster. Founded in 1935, our focus has always been to put people first--doing whatever we can to help individuals, families, businesses and our colleagues achieve their financial goals. As a leading commercial bank, we remain passionate about serving our clients and supporting our communities. Integrity, Collaboration, Accountability, Agility, Respect, Excellence are Webster’s values, these set us apart as a bank and as an employer.  Come join our team where you can expand your career potential, benefit from our robust development opportunities, and enjoy meaningful work!  The Lead Software Engineer - Shared Platform Services role provides subject matter expertise for multiple shared platforms used in IT solutions across the enterprise. Responsibilities include administration, support, and enhancement through configuration and customization of these platforms. These platforms may be internal or third-party cloud services that are integrated with Webster Bank applications and services as part of our business processes. Integrations with these shared platforms will be via API and/or file exchange and may be bi-directional.  This role will work as a member of a team of technical software engineers researching and building subject matter expertise in platforms to be used across the enterprise. This subject matter expertise includes understanding the capabilities and benefits of the shared platform, configuration and/or customization of the platform, and any related coding and testing.  This is a lead engineer role that focuses on architecture and strategy. The Lead Software Engineer will work closely with the business, peers, and other IT teams to understand the business/technical requirements, which they use in conjunction with Solution Architects to design the overall technical solution. Specifically, they will focus on how our shared services can provide a solution to the requirements and the integration strategy for how other systems will interact with the shared platforms. Ultimately, this engineer will implement solutions to business requirements using our shared platforms.  From a leadership perspective, the Lead Software Engineer will set standards and guide the efforts of contractors and other software engineers in designing/implementing solutions leveraging their respective shared platform. Additionally, they will educate and document how the platform should be used by users.  Strategically, the Lead Software Engineer will conduct research and implement POC’s for designs and shared platform capabilities including defining the standards for how the share platforms are to be used. This role will disseminate designs and learnings to other Software Engineers and users and will define the vision for how the platforms evolve over time, and how new features and capabilities can be used for the benefit of the bank.  As an individual who loves technology, 10+ years designing and implementing enterprise applications with a strong background in .NET and web based technologies. Provide practical and expert knowledge of technical design alternatives and their associated implications. Identify data needs, including access, security, quality, and maintenance requirements. Recommend design alternatives to users, considering benefits of and limitations, based on in-depth understanding of business needs and technical expertise. Monitor and alert regarding the availability and performance of our shared platforms. Continually look for opportunities to do things better/more efficiently and works with teams to drive these process improvements. Participate in design sessions with Enterprise Architecture teams to design solutions leveraging shared platforms. Participate in daily scrum meetings, during which you will report out on progress of tasks assigned. As a Senior Software Engineer, set standards and practices to be followed by team members. Bachelor's degree in Computer Science, Computer Engineering, or Information Technology 5+ years of relevant experience as a software developer, architect, or platform owner 5+ years of relevant industry experience in working with database technologies. 5+ years of relevant industry experience in the use of data integration tools and technologies. Strong leadership skills with proven success record of delivering business critical projects/solutions. Ability to collaborate effectively and work as part of a team. Enthusiastic learner and devoted to customer service and quality. Demonstrates a positive attitude and an inclusive team player.  Skills include  REST API frameworks: Express Js ASP.Net Web API Single-page applications frameworks Angular JS Ember JS SOA & SaaS Architecture, .NET 2.0-4.0 (C#, VB, ASP.NET, WCF, WWF), RDB Design & Development, Web Services, Web Security, DevOps Tools, AWS/Cloud technology, SQL Server and API experience  The estimated salary range for this position is $135,000.00 to $155,000.00. Actual salary may vary up or down depending on job-related factors which may include knowledge, skills, experience, and location. In addition, this position is eligible for incentive compensation.  #LI-FO1 #LI-Remote #ZR  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.Show more Report"
        ],
        "Hard Skills": [
            "Visual Basic (Programming Language)",
            ".NET Framework",
            "Process Improvement",
            "Cloud Services",
            "Software Engineering",
            "Technical Design",
            "Business Process",
            "RESTful API",
            "Scrum (Software Development)",
            "Windows Communication Foundation",
            "Data Integration",
            "ASP.NET",
            "Application Programming Interface (API)",
            "Angular (Web Framework)",
            "Enterprise Architecture",
            "Ember.js (Javascript Library)",
            "Business Requirements",
            "Web Services",
            "C# (Programming Language)",
            "Amazon Web Services",
            "ASP.NET Web API",
            "Express.js (Javascript Library)",
            "SQL (Programming Language)",
            "DevOps",
            "Solution Architecture",
            "Computer Engineering",
            "Commercial Banking",
            "Computer Science",
            "Software As A Service (SaaS)",
            "Cloud Computing",
            "JavaScript (Programming Language)",
            "Software Development",
            "Business Intelligence",
            "Service-Oriented Architecture",
            "Microsoft Access",
            "Web Applications"
        ],
        "Soft Skills": [
            "Enthusiasm",
            "Leadership",
            "Positivity",
            "Accountability",
            "Collaboration",
            "Information Technology",
            "Research",
            "Customer Service"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-i-or-ii-qualtech-systems-inc-JV_KO0,25_KE26,46.htm?jl=1008456260182": {
        "Data": [
            "Qualtech Systems Inc. (QSI) is looking to hire a US Citizen as a Software Engineer I or II – a position that requires excellent technical background in the area of engineering software design and development using C/C++/C# and Java Description Position: Software Engineer I or II Function: Engineering Location: Rocky Hill, CT, USA Type: Full Time Citizenship: US Persons only (US citizen or Permanent Resident) Start Date: Immediate Location: Qualtech Systems, Inc., 100 Corporate Place, Rocky Hill, CT 06067 Please send resume & cover letter to: jobs@teamqsi.com No phone calls or agencies please Job Summary Qualtech Systems Inc. (QSI) is looking to hire a US Citizen as a Software Engineer I or II – a position that requires excellent technical background in the area of engineering software design and development. Primarily, the candidate shall have demonstrable strong software programming skills using C/C++/C# and Java as well as web software development. Successful applicants will be good team players and participate in our Agile software development process. Familiarity with Git/GitHub and other VCS and VS Code tools desired. Fresh STEM graduates with relevant experience will be considered for Software Engineer I position. Job Responsibilities  Implement and transition QSI’s advanced diagnostic and prognostic methods and algorithms into QSI’s TEAMS® engineering software products Work with QSI project team members through development, testing, and delivery of the product or service Qualifications  Demonstrable track record in designing and developing software applications. Bachelor’s degree in Engineering/Technology/Mathematics/Science from an accredited US university Cross-platform software development experience (Linux, Windows, VxWorks) is desirable Working knowledge of desktop application development, web application development, database programming, software development methodologies are considered a plus. Salary $55,000 - $90,000 per yearShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Design",
            "Agile Software Development",
            "Github",
            "Application Development",
            "Git (Version Control System)",
            "Linux",
            "Development Testing",
            "Algorithms",
            "Web Application Development",
            "Database Programming",
            "Java (Programming Language)",
            "C# (Programming Language)",
            "VxWorks",
            "Software Engineering",
            "Software Development Methodologies",
            "Software Development"
        ],
        "Soft Skills": [
            "Mathematics"
        ]
    },
    "https://www.glassdoor.com/job-listing/automation-engineer-i-the-travelers-companies-inc-JV_KO0,21_KE22,49.htm?jl=1008887734884": {
        "Data": [
            "Who Are We? Taking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it. Job Category Technology Compensation Overview The annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards. Salary Range $91,100.00 - $150,300.00 Target Openings 1 What Is the Opportunity? Software Quality Engineers work with teams and the Engineering community to evolve our approach to test automation and the tooling used to ensure software is of high quality. With a strong understanding of the desired approach to ensuring quality, they partner side by side with Software and Data Engineers to analyze complex software systems, current quality practices, frameworks, and tools to identify opportunities for improvement in software quality. They work in partnership with engineers to implement those improvements. What Will You Do? Develop and expand our test automation framework and test coverage. Develop working knowledge of the entire application stack including tests at all levels. (Unit, Integration, and End-to-end). Groom and prune tests at all levels to ensure optimal coverage and effective deduplication. Collaborate with Product Managers, Software Engineers, Data Engineers, and with the wider product and development team to understand how new features should be tested and to contribute to automated tests for these new features. Collaborate with engineers to define and implement mechanisms to inject testing earlier into the software development process. Identify, share, and nurture the adoption of best practices in code health, testing, testability, and maintainability. You should champion clean code and the concept of the test pyramid. Analyze complex software systems and collaborate with others to improve the overall design, testability, and quality. Strive for the fastest feedback possible. Test parallelization should be a top priority. You see distributed systems as a core challenge of good test automation infrastructure. Configure automated tests to execute reliably and efficiently in CI/CD environments. Track and communicate test results in a timely, effective, and automated manner. Work within guidelines set by team to independently tackle well-scoped problems. Seek opportunities to expand technical knowledge and capabilities. Experience with Javascript, C#, SQL, Python and or Playwright or Taiko is desirable. Perform other duties as assigned. What Will Our Ideal Candidate Have? Three years of programming/development experience preferred. What is a Must Have? Bachelor’s degree or its equivalent in work experience. One year of programming/development experience. What Is in It for You? Health Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment. Retirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers. Paid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays. Wellness Program: The Travelers wellness program is comprised of tools and resources that empower you to achieve your wellness goals. In addition, our Life Balance program provides access to professional counseling services, life coaching and other resources to support your daily life needs. Through Life Balance, you’re eligible for five free counseling sessions with a licensed therapist. Volunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice. Employment Practices Travelers is an equal opportunity employer. We believe that we can deliver the very best products and services when our workforce reflects the diverse customers and communities we serve. We are committed to recruiting, retaining and developing the diverse talent of all of our employees and fostering an inclusive workplace, where we celebrate differences, promote belonging, and work together to deliver extraordinary results. If you are a candidate and have specific questions regarding the physical requirements of this role, please send us an email so we may assist you. Travelers reserves the right to fill this position at a level above or below the level included in this posting. To learn more about our comprehensive benefit programs please visit http://careers.travelers.com/life-at-travelers/benefits/.Show more Report"
        ],
        "Hard Skills": [
            "Software Systems",
            "Software Quality (SQA/SQC)",
            "Testability",
            "Code Coverage",
            "Software Engineering",
            "Test Automation",
            "Python (Programming Language)",
            "SQL (Programming Language)",
            "C# (Programming Language)",
            "CI/CD",
            "JavaScript (Programming Language)",
            "Playwright (Software Testing)",
            "Automation",
            "Maintainability",
            "Loans"
        ],
        "Soft Skills": [
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-intone-networks-JV_KO0,24_KE25,40.htm?jl=1008762526175": {
        "Data": [
            "Master’s Degree University/College Attended: Year of Graduation: What is your degree in: Bachelor’s Degree University/College Attended: Year of Graduation: What is your degree in:Show more Report"
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/full-stack-software-engineer-react-node-and-aws-the-travelers-companies-inc-JV_KO0,47_KE48,75.htm?jl=1008903270167": {
        "Data": [
            "Who Are We? Taking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it. Job Category Technology Compensation Overview The annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards. Salary Range $91,100.00 - $150,300.00 Target Openings 1 What Is the Opportunity? Travelers is seeking a Software Engineer I to join our organization as we grow and transform our Technology landscape. Individual will complete intermediate end to end engineering tasks for specific system assignments including developing, analyzing, configuring, testing, debugging, troubleshooting, documenting, health monitoring/alerting, and implementing based on user or system design specifications, as well as participating in troubleshooting, conducting impact analysis and escalating appropriately. What Will You Do? Support the OmniAct application which provides self-servicing of key functions for Digital Enablement Engineers, Business Operations and Work Force Managers to safely make changes to regularly altered configurations of digital channels (Voice, Chat, SMS, Intelligent Workload Distribution) empowering our business operations teams while creating efficiencies across the enterprise. Perform analysis, design, development, and configuration functions as well as define technical requirements for assignments of intermediate complexity. Participate with team to perform analysis, assessment and resolution for defects and incidents of intermediate complexity and escalate appropriately. Work within guidelines set by team to independently tackle well-scoped problems. Seek opportunities to expand technical knowledge and capabilities. Perform other duties as assigned. What Will Our Ideal Candidate Have? Three years of programming/development experience preferred. Familiarity with React, Node, and Mongo Atlas AWS knowledge including terraform, lambdas, S3, etc Contact Center knowledge Experience with Github, Visual Code, Jenkins, Rally, and agile practices Delivery - Intermediate delivery skills including the ability to deliver work at a steady, predictable pace to achieve commitments, decompose work assignments into small batch releases and contribute to tradeoff and negotiation discussions. Domain Expertise - Demonstrated track record of domain expertise including the ability to understand technical concepts necessary to do the job effectively, demonstrate willingness, cooperation, and concern for business issues and possess in-depth knowledge of immediate systems worked on. Problem Solving - Proven problem solving skills including debugging skills, allowing you to determine source of issues in unfamiliar code or systems and the ability to recognize and solve repetitive problems rather than working around them, recognize mistakes using them as learning opportunities and break down large problems into smaller, more manageable ones. Communication - Strong communication skills with the ability to clearly and concisely interact with team members, document work in a clear, easy to follow manner, collaborate well with team members, take in well- scoped requirements and ask the right questions to ensure clarification, seek out and receive constructive criticism well and listen when others are speaking. Leadership - Intermediate leadership skills with a proven track record of self-motivation in identifying personal growth opportunities. What is a Must Have? Bachelor’s degree or its equivalent in work experience. One year of programming/development experience. What Is in It for You? Health Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment. Retirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers. Paid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays. Wellness Program: The Travelers wellness program is comprised of tools and resources that empower you to achieve your wellness goals. In addition, our Life Balance program provides access to professional counseling services, life coaching and other resources to support your daily life needs. Through Life Balance, you’re eligible for five free counseling sessions with a licensed therapist. Volunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice. Employment Practices Travelers is an equal opportunity employer. We believe that we can deliver the very best products and services when our workforce reflects the diverse customers and communities we serve. We are committed to recruiting, retaining and developing the diverse talent of all of our employees and fostering an inclusive workplace, where we celebrate differences, promote belonging, and work together to deliver extraordinary results. If you are a candidate and have specific questions regarding the physical requirements of this role, please send us an email so we may assist you. Travelers reserves the right to fill this position at a level above or below the level included in this posting. To learn more about our comprehensive benefit programs please visit http://careers.travelers.com/life-at-travelers/benefits/.Show more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Voice Chat",
            "MongoDB",
            "Github",
            "React.js (Javascript Library)",
            "Terraform",
            "Business Operations",
            "Jenkins",
            "Systems Design",
            "Software Engineering",
            "Amazon S3",
            "Node.js (Javascript Library)",
            "Amazon Web Services",
            "Loans",
            "Agile Methodology"
        ],
        "Soft Skills": [
            "Communications",
            "Leadership",
            "Cooperation",
            "Innovation",
            "Negotiation",
            "Problem Solving"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-i-automation-anywhere-the-travelers-companies-inc-JV_KO0,39_KE40,67.htm?jl=1008841441901": {
        "Data": [
            "Who Are We? Taking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it. Job Category Technology Compensation Overview The annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards. Salary Range $91,100.00 - $150,300.00 Target Openings 1 What Is the Opportunity? Travelers is seeking a Software Engineer I to join our organization as we grow and transform our Technology landscape. Individual will complete intermediate end to end engineering tasks for specific system assignments including developing, analyzing, configuring, testing, debugging, troubleshooting, documenting, health monitoring/alerting, and implementing based on user or system design specifications, as well as participating in troubleshooting, conducting impact analysis and escalating appropriately. What Will You Do? Perform analysis, design, development, and configuration functions using Automation Anywhere software development tool. Participate with team to perform analysis, assessment and resolution for defects and incidents of intermediate complexity and escalate appropriately. Work within guidelines set by team to independently tackle well-scoped problems. Seek opportunities to expand technical knowledge and capabilities. Perform other duties as assigned. What Will Our Ideal Candidate Have? Looking for someone who has experience with Robotic Process Automation (RPA). Looking for someone who has experience with Automation Anywhere. Looking for someone who has experience with GitHub, CI/CD, etc. Looking for someone who has experience with C# and .NET. Delivery - Intermediate delivery skills including the ability to deliver work at a steady, predictable pace to achieve commitments, decompose work assignments into small batch releases and contribute to tradeoff and negotiation discussions. Domain Expertise - Demonstrated track record of domain expertise including the ability to understand technical concepts necessary to do the job effectively, demonstrate willingness, cooperation, and concern for business issues and possess in-depth knowledge of immediate systems worked on. Problem Solving - Proven problem solving skills including debugging skills, allowing you to determine source of issues in unfamiliar code or systems and the ability to recognize and solve repetitive problems rather than working around them, recognize mistakes using them as learning opportunities and break down large problems into smaller, more manageable ones. Communication - Strong communication skills with the ability to clearly and concisely interact with team members, document work in a clear, easy to follow manner, collaborate well with team members, take in well- scoped requirements and ask the right questions to ensure clarification, seek out and receive constructive criticism well and listen when others are speaking. Leadership - Intermediate leadership skills with a proven track record of self-motivation in identifying personal growth opportunities. What is a Must Have? Bachelor’s degree or its equivalent in work experience. One year of programming/development experience. What Is in It for You? Health Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment. Retirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers. Paid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays. Wellness Program: The Travelers wellness program is comprised of tools and resources that empower you to achieve your wellness goals. In addition, our Life Balance program provides access to professional counseling services, life coaching and other resources to support your daily life needs. Through Life Balance, you’re eligible for five free counseling sessions with a licensed therapist. Volunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice. Employment Practices Travelers is an equal opportunity employer. We believe that we can deliver the very best products and services when our workforce reflects the diverse customers and communities we serve. We are committed to recruiting, retaining and developing the diverse talent of all of our employees and fostering an inclusive workplace, where we celebrate differences, promote belonging, and work together to deliver extraordinary results. If you are a candidate and have specific questions regarding the physical requirements of this role, please send us an email so we may assist you. Travelers reserves the right to fill this position at a level above or below the level included in this posting. To learn more about our comprehensive benefit programs please visit http://careers.travelers.com/life-at-travelers/benefits/.Show more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Robotic Process Automation",
            ".NET Framework",
            "Github",
            "Automation Anywhere (RPA Software)",
            "C# (Programming Language)",
            "Systems Design",
            "CI/CD",
            "Software Engineering",
            "Software Development",
            "Loans"
        ],
        "Soft Skills": [
            "Communications",
            "Leadership",
            "Cooperation",
            "Innovation",
            "Negotiation",
            "Problem Solving"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-ecommerce-ui-dick-s-sporting-goods-JV_KO0,37_KE38,59.htm?jl=1008909297280": {
        "Data": [
            "At DICK’S Sporting Goods, we believe in how positively sports can change lives. On our team, everyone plays a critical role in creating confidence and excitement by personally equipping all athletes to achieve their dreams. We are committed to creating an inclusive and diverse workforce, reflecting the communities we serve.  If you are ready to make a difference as part of the world’s greatest sports team, apply to join our team today! OVERVIEW: Everything we do at DICK’S Sporting Goods centers around our customers, or as we call them, our athletes. From online to in-store, we’re disrupting retail through technology. Our Software Engineering team are key disruptors. As a Senior Software Engineer, you are an expert of your craft. You are a natural leader. The idea of disrupting an industry with technologies you help create is invigorating. We empower our engineers to tear down the silos and work collaboratively with their product team to deliver solutions. We work in nimble product teams composed of engineers, designers, and product managers that aren’t bogged down by project plans and politics, but are empowered to continuously create, test and execute. One of the best parts is after the work is done, you get to see the results of your work in our stores, online and throughout our business. You get to make a difference. QUALIFICATIONS: First, let’s talk Tech.  Here is a list of our platforms. Don’t worry, you don’t have to be a master at them all.  Extensive experience in web development technologies using JSON, HTML, and CSS preprocessors  Extensive experience in JavaScript/Typescript and asynchronous call structures  Extensive experience with Angular, Typescript, RxJs, and other web technologies  Extensive experience with Unit Testing and Test Coverage technologies  Demonstrated experience in using NRWL/NX Mono-repo or similar mono-repo architecture  Experience using Agile development methodologies  Familiarity with git-based source control  Interest in researching and understanding alternative web technologies  Knowledge of Cloud architecture  Experience with Docker, Kubernetes, or other Container technologies  As a Senior Software Engineer at DICK’S you will:  Bring at least 5-7 years of UI/Angular experience to the table.  Collaborate seamlessly with designers, product managers, and engineers to achieve shared goals.  Act as a mentor and guide to fellow team members, effectively communicating technical standards and insights.  Design, code, and seamlessly integrate with frameworks and APIs to tackle complex business challenges.  Utilize the Angular Framework to develop and deliver high-quality code at an accelerated pace.  Work alongside service providers to collaborate on data models and use cases.  Consistently deliver enterprise features and capabilities with an unwavering focus on customer satisfaction.  Establish clear engineering requirements and timelines to ensure smooth and efficient project delivery.  Utilize open-source tools to create new technologies that drive business success.  Have opportunities for career development as we continue to invest in our talent.  Be a part of a dynamic and collaborative culture that is constantly innovating and overcoming new challenges in our quest to scale our business and create exceptional experiences for our athletes.  Thrive in a remote work environment while still benefiting from the numerous amenities available at our Pittsburgh campus, such as a world-class health club, hoteling space, collaboration rooms, and cutting-edge technology for hybrid meetings.  Collaborate across multiple teams in the eCommerce and marketing departments to achieve the company's goals and objectives.  We believe that there is always a better way. So, we will expect you to:  Continuously learn modern software design and development core practices, utilizing articles, MeetUps, conferences, tech talks, etc.  Deliver complex tasks to production, working independently when required.  Use best practices in high quality code and continue to push and share your knowledge.  Review and discuss code with engineering peers and leaders to understand best practices and optimal design patterns  Take the initiative to drive new ideas and projects  Understand the business context of the larger domain and potentially other domain areas  Be able to advocate and evangelize specific technologies within and outside the wider organization  Be able to support and mentor seasoned technologists in a structured manner and ad-hoc  A willingness to continuously learn, experiment, and innovate. Innovation is a critical part of our culture and an expectation for all teammates. If you like brainstorming with your peers on how to disrupt your product domain – or retail as a whole – you’ve come to the right place!  Lastly, here’s some stuff that won’t be part of your day-to-day. At DICK’S you won’t:  Work in a silo  Be limited by project plans  Find yourself stuck in a boring cube  Be pigeonholed into proprietary and stagnant codebases  If you’re excited about joining the DSG team, we’d love to meet you. Apply today!  Targeted Pay Range: $83,000 – $138,200. This is part of a competitive total rewards package that could include other components such as: incentive, equity and benefits. Individual pay is determined by a number of factors including experience, location, internal pay equity, and other relevant business considerations. We review all teammate pay regularly to ensure competitive and equitable pay.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "TypeScript",
            "Data Modeling",
            "Application Programming Interface (API)",
            "Hotelling",
            "Cloud Computing Architecture",
            "Code Coverage",
            "Agile Methodology",
            "Docker (Software)",
            "Git (Version Control System)",
            "Kubernetes",
            "RxJS",
            "Angular (Web Framework)",
            "Optimal Design",
            "Marketing",
            "Software Engineering",
            "Technical Standard",
            "Mono",
            "HyperText Markup Language (HTML)",
            "Internal Pay Equity",
            "Unit Testing",
            "Version Control",
            "JSON",
            "JavaScript (Programming Language)",
            "Cascading Style Sheets (CSS)",
            "Equities",
            "E-Commerce",
            "Repurchase Agreements",
            "User Interface (UI)",
            "Web Development",
            "Software Development"
        ],
        "Soft Skills": [
            "Customer Service",
            "Advocacy",
            "Communications",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineering-co-op-fall-2024-danbury-mission-technologies-JV_KO0,36_KE37,65.htm?jl=1008920301966": {
        "Data": [
            "Danbury Mission Technologies is part of the ARKA Group, L.P. ARKA stands for more than creating better technology. We believe in building a better world. Built on a diversity of people, ideas and thoughts, we develop the technologies and projects that have a meaningful impact for a more certain, sustainable world of opportunity for everyone.   Position Overview:  As a Software Engineering Co-op, you will provide prototyping, coding, testing, scripting and document generation in support of software development activities. You will perform data analysis using proprietary software systems in support of on-going contracts, and develop automation software for program-specific data flows on those contracts. You will also develop breadboard implementations of algorithms in MatLab or Mathematica environments based upon mathematical descriptions of algorithm approaches in order to come up with creative solutions to problems. You will benefit from working side by side with a talented and experienced group of professionals eager to mentor.  Responsibilities: In this position, you will be responsible for:  Algorithm prototyping Code development in C# and Python Software test development Requirements, test plan, and release documentation generation and updates Data processing   Education Requirements: Completion of at least one year towards a Bachelor’s degree in Computer Science, Computer Engineering, Mathematics, Physics or related field   Experience Required: Development of moderate-sized desktop applications in a Windows environment using a C-based language (C++, C#, Java) MatLab, Mathematica, Python or equivalent mathematical modeling tools Strong mathematics background including completion of calculus and linear algebra courses   Collaborating with world class experts, you will have the opportunity to develop innovative solutions in fulfillment of our customers’ requirements. We believe in our mission, and we believe in supporting our employees. We offer policies and programs that provide opportunities for continual learning, career growth and work/life balance along with a full suite of health and welfare benefits.   This position requires the incumbent to access export-controlled information. If you are not a US Person, any offer is contingent upon the Company's ability to obtain a special license granting you access. This could take several months. You will not be able to begin employment until such license is obtained.  No visa sponsorship is available for this position.   Danbury Mission Technologies is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class. Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)Show more Report"
        ],
        "Hard Skills": [
            "Proprietary Software",
            "C++ (Programming Language)",
            "Algorithms",
            "Data Processing",
            "C (Programming Language)",
            "Python (Programming Language)",
            "Software Testing",
            "Export Control",
            "Java (Programming Language)",
            "Software Engineering",
            "C# (Programming Language)",
            "Scripting",
            "Calculus",
            "MATLAB",
            "Documentation Generation",
            "Computer Engineering",
            "Mathematical Modeling",
            "Computer Science",
            "Physics",
            "Linear Algebra",
            "Software Development",
            "Code Of Federal Regulations",
            "Data Analysis",
            "Wolfram Mathematica",
            "Test Planning",
            "Prototyping"
        ],
        "Soft Skills": [
            "Mathematics",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-ii-nodejs-golang-the-travelers-companies-inc-JV_KO0,34_KE35,62.htm?jl=1008920873760": {
        "Data": [
            "Who Are We? Taking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it. Job Category Technology Compensation Overview The annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards. Salary Range $110,500.00 - $182,300.00 Target Openings 1 What Is the Opportunity? Travelers is seeking a Software Engineer II to join our organization as we grow and transform our Technology landscape. Individual will complete advanced end to end engineering tasks for specific system assignments including designing, developing, analyzing, configuring, testing, debugging, troubleshooting, documenting, health monitoring/alerting, and implementing based on user or system specifications, consulting with users to determine hardware, software or system functional specifications, managing interaction between the systems and other technical support areas and defining technical requirements and coordinating team resources to solve problems. What Will You Do? Perform analysis, design, development, and configuration functions (includes defining technical requirements) with a high degree of accuracy and speed, operating as an individual contributor to team goals. Perform analysis, assessment and resolution for defects and incidents of advanced complexity and escalate appropriately. Work independently to tackle well-scoped and loosely scoped problems. Seek opportunities to expand technical knowledge and capabilities. Provide technical guidance and mentorship to less experienced employees. Perform other duties as assigned. What Will Our Ideal Candidate Have? Four years of programming/development experience preferred. Looking for someone who has experience with NodeJS and Golang. Looking for someone who has experience with more than 2 programming languages. Looking for someone who has experience working in a collaborative team environment. Looking for someone who has experience with front-end frameworks (React, preferred). Looking for someone who has experience with cloud environments (AWS, Azure, GCP). Looking for someone who has experience with unit and integration testing application code. Delivery - Intermediate delivery skills including the ability to estimate accurate timelines for tasks and deliver work at a steady, predictable pace to achieve commitments, contribute to the software design strategy and methodologies used to best meet the system requirements, consider and build for many different use cases, avoid over engineering, and ensure automation, deliver complete solutions but release them in small batches, and identify important tradeoffs and negotiate them. Domain Expertise - Demonstrated track record of domain expertise including understanding technical concepts necessary to do the job effectively and aware of industry trends, demonstrate willingness, cooperation, and concern for business issues and priorities, and possess in depth knowledge of immediate systems worked on and some knowledge of adjacent systems. Problem Solving - Strong problem solver who ensures solutions are built for the long term, is able to resolve new issues, recognizes mistakes using them as learning and teaching opportunities and consistently breaks down large problems into smaller, more manageable ones. Communication - Strong communicator who possesses the ability to articulate information clearly and concisely with the business, document work in a clear, easy to follow manner, collaborate well with team members as both a mentor and mentee, take in vague requirements and ask the right questions to ensure clarification, offer feedback appropriately and effectively, seek out and receives constructive criticism well, listen when others are speaking and make space for colleagues to share their thoughts. Leadership - Intermediate leadership skills with the ability to help create a safe environment for others to learn and grow as engineers and a proven track record of self-motivation in identifying opportunities and tracking team efforts. What is a Must Have? Bachelor’s degree or its equivalent in work experience. Two years of programming/development experience. What Is in It for You? Health Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment. Retirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers. Paid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays. Wellness Program: The Travelers wellness program is comprised of tools and resources that empower you to achieve your wellness goals. In addition, our Life Balance program provides access to professional counseling services, life coaching and other resources to support your daily life needs. Through Life Balance, you’re eligible for five free counseling sessions with a licensed therapist. Volunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice. Employment Practices Travelers is an equal opportunity employer. We believe that we can deliver the very best products and services when our workforce reflects the diverse customers and communities we serve. We are committed to recruiting, retaining and developing the diverse talent of all of our employees and fostering an inclusive workplace, where we celebrate differences, promote belonging, and work together to deliver extraordinary results. If you are a candidate and have specific questions regarding the physical requirements of this role, please send us an email so we may assist you. Travelers reserves the right to fill this position at a level above or below the level included in this posting. To learn more about our comprehensive benefit programs please visit http://careers.travelers.com/life-at-travelers/benefits/.Show more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Software Design",
            "Microsoft Azure",
            "React.js (Javascript Library)",
            "Functional Specification",
            "Integration Testing",
            "Node.js (Javascript Library)",
            "Go (Programming Language)",
            "Software Engineering",
            "Amazon Web Services",
            "System Requirements",
            "Automation",
            "Technical Support",
            "Loans",
            "Front End (Software Engineering)"
        ],
        "Soft Skills": [
            "Communications",
            "Leadership",
            "Consulting",
            "Problem Solving",
            "Cooperation",
            "Innovation",
            "Coordinating",
            "Teaching",
            "Timelines",
            "Mentorship"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-test-automation-engineer-urbane-systems-llc-JV_KO0,31_KE32,50.htm?jl=1008910690717": {
        "Data": [
            "Requirements: -Expertise in Ubuntu 18 and aboveTest Automation Framework Design and Development for Embedded Devices (Fire Panel Displays)Experience on Selenium, Appium, GherkinKnowledge of DevOps tools – Bamboo, Jira, bitbucket, SonarQube etc.Expertise in Python 3.2 and aboveResponsibilitiesDevelop, test, and maintain scalable, reusable codeIdentify and troubleshoot performance and scalability issuesDocuments software designs and user interface.Participate in design and code reviewJob Type: ContractPay: $60.00 per hourSchedule:8 hour shiftWork Location: On the roadShow more Report"
        ],
        "Hard Skills": [
            "Framework Design",
            "Python (Programming Language)",
            "Selenium (Software)",
            "Appium",
            "Bitbucket",
            "SonarQube",
            "Scalability",
            "Ubuntu (Operating System)",
            "DevOps",
            "Atlassian Bamboo",
            "JIRA",
            "Embedded Systems",
            "Automation"
        ],
        "Soft Skills": [
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-dev-op-engineer-the-cooper-companies-JV_KO0,24_KE25,45.htm?jl=1008916354262": {
        "Data": [
            "We are seeking for a DevOps engineer to join our growing software and embedded systems group at CooperSurgical. You will work in cross functional team environments and provide solutions and technical support for new product development efforts. This position will report directly to the Software Engineer Technical lead. We are seeking a DevOps Engineer to implement and maintain our new CI/CD infrastructure to support our software development teams in the development of Fertility and Medical device solutions. Two years of engineering experience Bachelor's degree in engineering REST or RPC, microservices-based architectures Hands-on public cloud experience - AWS, Google Cloud, and/or Azure (multi-cloud preferred). Strong working knowledge of CI/CD Pipelines in a globally distributed environment. Must have GitLab experience. Current hands-on development experience in one or more modern languages and frameworks: Next.JS, Python, JS/NodeJS. Knowledge of application, data and infrastructure architecture disciplines Knowledge of Monitoring and Observability Tools: Grafana. Knowledge of Redis or another replication tool.  As an employee of CooperSurgical, you'll receive an outstanding total compensation plan. As we believe your compensation goes beyond your paycheck, we offer a great compensation package, medical coverage, 401(k), parental leave, fertility benefits, paid time off for vacation, personal, sick and holidays, and multiple other perks and benefits. Please visit us at www.coopersurgical.com to learn more about CooperSurgical and the benefits of becoming a member of our team. To all agencies: Please, no phone calls or emails to any employee of CooperSurgical about this opening. All resumes submitted by search firms/employment agencies to any employee at CooperSurgical via-email, the internet or in any form and/or method will be deemed the sole property of CooperSurgical, unless such search firms/employment agencies were engaged by CooperSurgical for this position and a valid agreement with CooperSurgical is in place. In the event a candidate who was submitted outside of the CooperSurgical agency engagement process is hired, no fee or payment of any kind will be paid. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace. Develops and maintains CI/CD workflows to support Agile software development. Participates in architecture and software development activities. Translates loosely defined requirements into solutions. Uses open-source technologies and tools to accomplish specific use cases encountered within the project. Uses coding languages or scripting methodologies to solve a problem with a custom workflow. Collaborates with others on the project to brainstorm about the best way to tackle a complex technological infrastructure, security, or development problem. PeShow more Report"
        ],
        "Hard Skills": [
            "Infrastructure Architecture",
            "Infrastructure Security",
            "Multi-Cloud",
            "Microsoft Azure",
            "Agile Software Development",
            "Microservices",
            "Next.js (Javascript Library)",
            "Python (Programming Language)",
            "Medical Devices",
            "Redis",
            "Observability",
            "Node.js (Javascript Library)",
            "Scripting",
            "DevOps",
            "Embedded Systems",
            "Public Cloud",
            "CI/CD",
            "Software Engineering",
            "Gitlab",
            "Grafana",
            "Google Cloud Platform (GCP)",
            "Amazon Web Services",
            "New Product Development",
            "JavaScript (Programming Language)",
            "Software Development",
            "Application Data",
            "Technical Support",
            "Open Source Technology"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-citadel-enterprise-americas-JV_KO0,17_KE18,45.htm?jl=1007801802838": {
        "Data": [
            "Job Description At Citadel, Software Engineers are responsible for building the systems that power every aspect of our investment process, from research and analysis to trading, risk management, funding and settlement. Working side by side with investors and quantitative researchers, we use our technical skills to drive critical commercial outcomes. If you’re interested in financial markets and excited by the prospect of having real impact in a fast-paced environment where everyone is inspired to be their best, we’re excited to meet you. Our most successful engineers are critical thinkers who know how to dissect the problem as proficiently as they know how to build the solution. While we look for technical acumen, commercial acumen is just as important. That includes the ability to flex, change course, and iterate without always having pre-defined specs. YOUR OPPORTUNITY: From system engineers who create next-gen platforms to desk-aligned developers who partner with investment teams to increase efficiency and maximize returns, our engineering opportunities are as varied as they are challenging. If you are selected for an interview, one of our recruiters will be in touch to review the specific roles, teams and regions that best align with your skills, seniority, and experience. YOUR SKILLS & TALENTS: 6+ years of professional software engineering experience  Solid computer science fundamentals  Expert level programing skills in at least one of the following: Java, C++, Python Proven track record in software design and development Excellent analysis / problem solving skills Strong communication and teamwork skills Ability to manage multiple tasks in a demanding and dynamic environment Minimum of a Bachelor’s degree in Computer Science or a related STEM discipline  In accordance with New York City’s Pay Transparency Law, the base salary range for this role is $150,000 to $300,000. Base salary does not include other forms of compensation or benefits. About Citadel  Citadel is one of the world’s leading alternative investment managers. We manage capital on behalf of many of the world’s preeminent private, public and nonprofit institutions. We seek the highest and best use of investor capital in order to deliver market leading results and contribute to broader economic growth. For over 30 years, Citadel has cultivated a culture of learning and collaboration among some of the most talented and accomplished investment professionals, researchers and engineers in the world. Our colleagues are empowered to test their ideas and develop commercial solutions that accelerate their growth and drive real impact.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "C++ (Programming Language)",
            "Alternative Investments",
            "Software Engineering",
            "Financial Market",
            "Python (Programming Language)",
            "Economic Growth",
            "Market Risk",
            "Sales Prospecting",
            "Java (Programming Language)",
            "Computer Science",
            "Settlement",
            "Investments"
        ],
        "Soft Skills": [
            "Technical Acumen",
            "Communications",
            "Teamwork",
            "Management",
            "Problem Solving",
            "Research"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-hybrid-the-hartford-JV_KO0,24_KE25,37.htm?jl=1008880175183": {
        "Data": [
            "You are a driven and motivated problem solver ready to pursue meaningful work. You strive to make an impact every day & not only at work, but in your personal life and community too. If that sounds like you, then you've landed in the right place. The Hartford’s Corporate IT organization is seeking a highly motivated, detail-oriented, and results-driven Software Engineer to work on an Agile team to build and support various invest & maintenance assignments for Law, Compliance and Government Affairs. The team is passionate about technology and has built new, well-architected tools and innovative web applications for our business partners using technologies such as C# .NET and JavaScript. They have adopted core DevOps engineering practices such as continuous integration, continuous deployment (CI/CD) and are one of the first teams at The Hartford to deliver applications to the AWS (Amazon Web Services) cloud. Successful candidates will be expected to demonstrate strong technical leadership skills, excellent partnership with stakeholders and partner teams, willingness to understand/adhere to existing processes and standards, solid technical acumen, experience in delivering quality technical solutions while ensuring systems are stable, performant, and secure. Responsibilities: Responsible for End-to-End solution (designing, building and maintenance) involving multiple platforms and business solutions using C# .NET and JavaScript. Possess emerging AWS Cloud skills to build new applications and maintain existing applications on the Cloud. Leverage architectural standards and safeguard the integrity of the application environment, in alliance with architects and other tech leads. Function as the go-to technical subject matter expert for the software applications supported, requiring depth and breadth of knowledge in technologies, applications, integration, interfaces, and business domain. Share knowledge with team members (including Sourcing Partners) regarding development guidelines and best practices. Attention to detail and ability to manage multiple priorities in a fast-paced environment. Demonstrate a high-level of independence but is also a team player. Ability to provide concise, transparent communications about potential risks, mitigations, and business impacts quickly. Build and implement capabilities for continuous integration and continuous delivery aligned with Enterprise DevOps practices. Ability to understand technology trade off risks and rewards for the best customer value delivery. Takes ownership to drive innovation for effectively leveraging technology to solve the customer problem.  Qualifications: 1+ years of hands-on experience in application software solution development and execution skills using C# .NET and Javascript. Experience with general purpose programming languages such as Python is beneficial. Experience with one or more relational database technologies such as SQL Server Database. Knowledge of open-source database technologies is beneficial. Experience in deploying the application with Application Servers and Web Servers. Demonstrate technical, analytical and logic-based problem-solving skills and the ability to quickly learn new technologies. Awareness of full software development life cycle practices and the ability to follow source code management, code quality and testing practices. Experience with continuous integration and DevOps methodologies, preferred tools such as GitHub, Jenkins, Rally, SonarQube etc. Familiar with Agile methodology. Ability to work independently and to collaborate with others within a team environment. Demonstrates self-motivation, good judgment and active listening skills. Possess analytical, problem solving and communication skills. Technologies: C# .NET, Javascript, Jquery, Nhibernate, Kendo, ASP.NET MVC, SQL, CSS (Cascading Style Sheets), Bootstrap, RESTful APIs (Application Programming Interface) Familiarity with CI/CD Pipeline tools and AWS Additional Details: Must be authorized to work in the US without company sponsorship. The Hartford is proud to offer a hybrid work location model that is designed to support flexibility. This partial remote position requires in office presence Tuesday/Wednesday with remote work flexibility Monday, Thursday, and Friday. Office Locations include NC: Charlotte; CT: Hartford Compensation The listed annualized base pay range is primarily based on analysis of similar positions in the external market. Actual base pay could vary and may be above or below the listed range based on factors including but not limited to performance, proficiency and demonstration of competencies required for the role. The base pay is just one component of The Hartford’s total compensation package for employees. Other rewards may include short-term or annual bonuses, long-term incentives, and on-the-spot recognition. The annualized base pay range for this role is: $83,440 - $125,160 Equal Opportunity Employer/Females/Minorities/Veterans/Disability/Sexual Orientation/Gender Identity or Expression/Religion/AgeShow more Report"
        ],
        "Hard Skills": [
            "Application Servers",
            "Bootstrap (Front-End Framework)",
            "Application Programming Interface (API)",
            "Agile Methodology",
            ".NET Framework",
            "Github",
            "Cascading Style Sheets (CSS)",
            "Application Environments",
            "Software Development Life Cycle",
            "Python (Programming Language)",
            "ASP.NET MVC Framework",
            "Technical Leadership",
            "Continuous Integration",
            "Continuous Delivery",
            "Relational Databases",
            "SonarQube",
            "Software Quality (SQA/SQC)",
            "NHibernate",
            "RESTful API",
            "Kendo UI (User Interface Framework)",
            "Web Servers",
            "SQL (Programming Language)",
            "C# (Programming Language)",
            "Jenkins",
            "Amazon Web Services",
            "DevOps",
            "JQuery",
            "Continuous Deployment",
            "CI/CD",
            "Software Engineering",
            "JavaScript (Programming Language)",
            "Version Control",
            "Web Applications",
            "Open Source Technology"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Technical Acumen",
            "Self-Motivation",
            "Active Listening",
            "Quick Learning",
            "Innovation",
            "Problem Solving",
            "Communications"
        ]
    }
}