{
    "https://www.glassdoor.com/job-listing/software-quality-assurance-engineer-a-i-solutions-inc-JV_KO0,35_KE36,53.htm?jl=1008880030728": {
        "Location": "Alabama",
        "Data": [
            "MAKE A MOVE, MAKE AN IMPACT.  a.i. solutions was founded over 25 years ago with a mission to MAKE AN IMPACT by exceeding expectations. A move to our team means using your passion and ingenuity to MAKE AN IMPACT through innovations, defending national security, and enabling access to space. MAKE A MOVE, to join a team driven by a shared ambition, and rewarded for individual contributions.  BENEFITS THAT MAKE AN IMPACT:  Zero $$ Group Health Plans Zero $$ Mental Health Therapy Paid Parental leave for Mom & Dad Paid Time Off w/Flex scheduling - create the work/life balance that works for you 401k Safe Harbor Plan, we contribute on Day #1 Wellness plans that rewards wellbeing & work life harmony Career development and growth, and endless learning opportunities Engaged and supportive leadership that cares   Essential Roles & Responsibilities:  Provide technical expertise in software quality assurance to the government for the assigned programs. Participate in cross-functional teams conducting software quality evaluations, audits and assessments, for existing and developmental missile defense programs. Activities include providing on-site verification and auditing at Developer facilities to ensure that robust controls are in place for quality assurance practices. Participate and provide input for Software Review Boards, failure investigations and failure review boards. Activities include determining root cause of failures of MDA hardware and software. Participate in assessments, tests, or technical interchange meetings to assess processes and practices for compliance with software quality assurance strategies, policies, and standards. Report results. Activities include providing on-site verification and auditing at Developer facilities to ensure that robust controls are in place for quality assurance practices. Participate in technical meetings and independent software code reviews for software (including but not limited to agile/iterative) development efforts to assess compliance with industry-wide and MDA software quality assurance standards and best practices. Report results. Assess software (including but not limited to agile/iterative software development model) quality assurance to include requirements, design, development, testing, and deployment activities. Demonstrated experience in the following: Leading and executing extensive software quality engineering support efforts for complex weapon systems, system elements, interfacing systems, components, devices and/or processes for missile defense programs. Software quality processes and products from requirements phase through testing and fielding Leading the implementation of software quality engineering. Travel periodically (approximately three times per year for 2-4 days per trip) Position is located at MDA facility on Redstone Arsenal with expectation to work onsite 4 days per month. Otherwise telework from home is authorized when not required to be onsite   Minimum Qualifications:  Bachelor’s Degree in Professional engineering from a school of engineering Accreditation Board of Engineering and Technology, Inc. in software engineering with a minimum of 10 years of experience in software engineering field. Acceptable substitute to ABET requirement: is a Degree and 12 years of experience in a software field. Current Secret Security Clearance or the ability to obtain prior to start required  Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)Show more Report"
        ],
        "Hard Skills": [
            "Code Review",
            "Software Quality (SQA/SQC)",
            "Software Technical Review",
            "Secret Clearance",
            "Development Testing",
            "Software Engineering",
            "Iterative And Incremental Development",
            "Engineering Support",
            "Auditing",
            "Software Development",
            "Code Of Federal Regulations",
            "Agile Methodology",
            "Disabilities",
            "Mental Health"
        ],
        "Soft Skills": [
            "Ingenuity",
            "Scheduling",
            "Quality Assurance",
            "Investigation",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-test-engineer-integration-innovation-inc-JV_KO0,22_KE23,49.htm?jl=1008941958348": {
        "Location": "Alabama",
        "Data": [
            "Overview:  i3 is seeking a Platform Test Engineer to provide test support to support the JBC-P (Joint Battle Command Platform) project aboard Redstone Arsenal. The Test Engineer will support testing of software and systems developed at S3I and by third party vendors. The Test Engineer will develop test procedures, test plans, and test reports. In addition, Test Engineer may be asked to travel to customer specified sites for operational testing, demonstrations and field support. This position is located in Huntsville, AL. Responsibilities:  Preferred candidates will have strong knowledge of TCP/IP networks and tools such as Wireshark to help debug issue. Additionally, they will have strong intuition for intuitive testing and troubleshooting. Often times the Test Engineer will be the first one seeing the software, so they must be able to learn new things with little to no direction or documentations. They should be able to read and interpret software and system requirements. Qualifications:  Required: Bachelor's degree required. Additional experience may substitute for degree. Current State Driver’s License and US Passport. Be willing to periodically travel within the US. Candidate must be able to obtain and maintain a DoD secret clearance for this position. U.S. Citizenship is required. Preferred: Three (3) years of relevant experience. Two (2) years of experience in software test. Two (2) years of experience in C4ISR Army systems. Experience with Agile development methodology. Experience with VMF Messaging Standards Experience with Tactical Radio Networks Experience with Blue Force Tracker Experience with Mounted Mission Command platform and NOC systems. Experience with fielding Joint Battle Command-Platform systems. Network+ and/or Security+ Certification. Software Testing Certification such as ASTQB CTFL. Active secret clearance. About i3:  Headquartered in Huntsville, AL, i3 is a national leader in providing innovative technical and engineering solutions to a broad customer base across the U.S. DoD. Specializing in missile and aviation engineering and logistic services, electronic warfare and electromagnetic affects analysis, UAS system integration and flight operations, full lifecycle C5ISR engineering services, engineering analysis, cybersecurity and IT/IA innovative solutions and virtual training, simulation & serious game development and implementation. We were founded in 2007 with the intent to do business differently. Our focus is to leave our team members and customers better than we found them. Our ultimate goal is to strengthen our Nation and our warfighter. Perks and Benefits at i3: 100% team member owned Outstanding insurance coverage 401(k) match Health and wellness incentives Tuition and certification reimbursement Generous PTO Fun culture with company activities Countless opportunities to give back to the community through our charitable organization, i3 Cares We work hard. We compete hard. We play hard. Apply now to join us!Show more Report"
        ],
        "Hard Skills": [
            "CompTIA Security+",
            "Debugging",
            "Video Game Development",
            "CompTIA Network+",
            "Agile Methodology",
            "Software Testing",
            "Secret Clearance",
            "Certified Tester Foundation Level (CTFL)",
            "Valid Driver's License",
            "Electronic Warfare",
            "Battle Management Technology",
            "Cyber Security",
            "Virtual Training",
            "Wireshark",
            "TCP/IP",
            "Engineering Analysis",
            "Systems Integration",
            "Test Planning",
            "Unmanned Aerial Systems (UAS)",
            "System Requirements",
            "Demonstration Skills",
            "Test Engineering"
        ],
        "Soft Skills": [
            "Operations",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-data-regions-JV_KO0,22_KE23,30.htm?jl=1008933302710": {
        "Location": "Alabama",
        "Data": [
            "Thank you for your interest in a career at Regions. At Regions, we believe associates deserve more than just a job. We believe in offering performance-driven individuals a place where they can build a career --- a place to expect more opportunities. If you are focused on results, dedicated to quality, strength and integrity, and possess the drive to succeed, then we are your employer of choice.  Regions is dedicated to taking appropriate steps to safeguard and protect private and personally identifiable information you submit. The information that you submit will be collected and reviewed by associates, consultants, and vendors of Regions in order to evaluate your qualifications and experience for job opportunities and will not be used for marketing purposes, sold, or shared outside of Regions unless required by law. Such information will be stored in accordance with regulatory requirements and in conjunction with Regions’ Retention Schedule for a minimum of three years. You may review, modify, or update your information by visiting and logging into the careers section of the system.  Job Description: At Regions, the Software Engineer oversees application development, modification, and maintenance of applications. This position monitors system applications, ensures systems run smoothly, and creates reports and other documentation outlining findings/solutions. This position sits within Regions' Technology department.  Primary Responsibilities Provides advice and recommendations to management on processes and techniques required for improved work operations Installs and configures systems and other software Tests installed software for malfunction detection Identifies and resolves business systems issues Designs and deploys new applications and enhancements to existing applications, software, and operation systems Measures effectiveness and efficiency of existing systems Develops and implements strategies to improve systems Monitors and tests system performance Oversees the training of junior engineers to improve job skills and work efficiency Typically has full ownership of a process May act as a procedural expert  This position is exempt from timekeeping requirements under the Fair Labor Standards Act and is not eligible for overtime pay.  Requirements Bachelor's degree in Computer Science, Computer Engineering or a related field Seven (7) years of experience  Skills and Competencies Ability to collaborate with programmers, developers, and other technology professionals to achieve a common objective Ability to conduct system analysis to detect issues with performance Ability to develop and implement technology solutions to resolve technical challenges Ability to manage multiple projects simultaneously Knowledge of software testing techniques, code optimization and software debugging Strong communication, analytical and problem solving skills Strong executional capabilities Thorough understanding of software structures, hardware, computing systems and how to integrate them  Additional Requirements Work with Developers / Other teams to help with data-related technical issues and ensure the successful designing and delivering data driven solutions. Expertise in ETL and writing stored procedures Experience in data migration· Experience in creating / modifying SSIS / SSRS packages Should have extensive hands-on various data preparation techniques and with multi-technology database architecture Strong analytical and problem-solving abilities Ongoing support, maintenance, and enhancements of solutions including monitoring, performance optimization, and troubleshooting database jobs and processes. Prefer experience in Banking domain Excellent written and verbal communication, team building, and relationship building skills Ability to work in a global collaborative team environment Monitor and perform tuning on complex SQL / ETL jobs  Position Type Full time  Compensation Details Pay ranges are job specific and are provided as a point-of-market reference for compensation decisions. Other factors which directly impact pay for individual associates include: experience, skills, knowledge, contribution, job location and, most importantly, performance in the job role. As these factors vary by individuals, pay will also vary among individual associates within the same job.  The target information listed below is based on the national range and level of the position.  Job Range Target: Minimum: $101,804.50 USD Median: $143,900.00 USD Incentive Pay Plans: Opportunity to participate in the Long Term Incentive Plan.  Benefits Information Regions offers a benefits package that is flexible, comprehensive and recognizes that \"one size does not fit all\" for benefits-eligible associates. Listed below is a synopsis of the benefits offered by Regions for informational purposes, which is not intended to be a complete summary of plan terms and conditions. Paid Vacation/Sick Time 401K with Company Match Medical, Dental and Vision Benefits Disability Benefits Health Savings Account Flexible Spending Account Life Insurance Parental Leave Employee Assistance Program Associate Volunteer Program  Please note, benefits and plans may be changed, amended, or terminated with respect to all or any class of associate at any time. To learn more about Regions’ benefits, please click or copy the link below to your browser.  https://www.regions.com/welcometour/benefits.rf  Location Details Riverchase Operations Center Location: Hoover, Alabama  Bring Your Whole Self to Work  We have a passion for creating an inclusive environment that promotes and values diversity of race, color, national origin, religion, age, sexual orientation, gender identity, disability, veteran status, genetic information, sex, pregnancy, and many other primary and secondary dimensions that make each of us unique as individuals and provide valuable perspective that makes us a better company and employer. More importantly, we recognize that creating a workplace where everyone, regardless of background, can do their best work is the right thing to do.  OFCCP Disclosure: Equal Opportunity Employer/Disabled/VeteransShow more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "SQL Server Integration Services (SSIS)",
            "Business Systems",
            "Systems Analysis",
            "Program Optimization",
            "Database Architecture",
            "Application Development",
            "Software Testing",
            "Stored Procedure",
            "Marketing",
            "Banking",
            "SQL (Programming Language)",
            "Technology Solutions",
            "SQL Server Reporting Services",
            "Extract Transform Load (ETL)",
            "Computer Engineering",
            "Software Engineering",
            "Computer Science",
            "Employee Assistance Programs"
        ],
        "Soft Skills": [
            "Relationship Building",
            "Communications",
            "Verbal Communication Skills",
            "Collaboration",
            "Team Building",
            "Problem Solving",
            "Management",
            "Operations",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/junior-software-test-engineer-penta-research-JV_KO0,29_KE30,44.htm?jl=1008890082529": {
        "Location": "Alabama",
        "Data": [
            "Junior Software Test Engineer Security Clearance Secret clearance required Work Environment Hybrid – Huntsville, AL Job description Seeking a junior-level software test engineer to join a team of software, test, and systems engineers who develop, test, and maintain the Joint Network Design Aid (JNDA) software. JNDA is a Windows-based desktop application used to design Link-16 networks and generate output files. Candidate would work on an Agile Scrum team in a largely self-directed but collaborative environment. Responsibilities Write automated test scripts in SmartBear TestComplete Develop test criteria and test steps to ensure software is functioning properly Coordinate with developers to report bugs and provide feedback Execute regression tests regularly and report issues promptly Investigate test failures and document clear steps to reproduce them Participate in Scrum events: sprint planning, sprint review/demonstration, daily tag ups Required qualifications Programming experience with language(s) such as Python, Java, C++ Ability to think critically and logically Excellent oral and written communication skills Detail-oriented and organized Comfortable with a fast-paced, collaborative work environment Desired qualifications Bachelor’s degree in computer science, software engineering, computer engineering, or similar Software testing experience Experience with automated testing and/or continuous integration Experience with Agile Scrum and/or DevSecOps Experience with Subversion and/or Git Link-16 knowledge Travel requirement Position location: Huntsville, AL. Occasional travel may be required for this position. Keyword Search Software Test Engineer, Agile, Windows, Software Development, Python, Automated TestingShow more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "DevSecOps",
            "Systems Engineering",
            "Security Clearance",
            "Network Planning And Design",
            "Software Testing",
            "Link 16",
            "Git (Version Control System)",
            "Secret Clearance",
            "Scrum (Software Development)",
            "Test Automation",
            "Python (Programming Language)",
            "Continuous Integration",
            "Apache Subversion",
            "Testcomplete",
            "Regression Testing",
            "Java (Programming Language)",
            "Software Engineering",
            "Sprint Planning",
            "Computer Engineering",
            "Windows Software Development",
            "Computer Science",
            "Agile Methodology",
            "Automation"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Critical Thinking",
            "Writing",
            "Self-Discipline"
        ]
    },
    "https://www.glassdoor.com/job-listing/entry-level-software-engineer-torch-technologies-inc-JV_KO0,29_KE30,52.htm?jl=1008906887889": {
        "Location": "Alabama",
        "Data": [
            "Job Description: The Innovation through Integration (I2) Business Unit (BU) at Torch Technologies, Inc. focuses on integrating technologies to provide innovative solutions to customers. I2 is growing to meet the demands of our customers, and we want creative and imaginative teammates like you! In our services, we strive to provide visual solutions that are backed by real data. As a team member you’ll work with a team to build a back-end data pipeline that powers compelling visual interfaces. Torch Technologies is seeking Entry-Level Software Engineers to support the Integration (I2) Business Unit (BU). The candidate will be expected to work closely with other developers and customers to develop quality software products. Candidate will be working with multiple applications that support a multiple projects. Project applications integrate with an internal backend toolset and present simulation data in an appealing manner so soldiers can make better tactical decisions. Candidate should be dependable and self-motivated, eager to overcome challenges and solve problems.  Growth Vector (30 days/90 days/1 year) As an I2 developer, you will be provided with the flexibility and support needed to grow into a valued teammate. Below is an estimated timeline of what you can expect within the first year of employment. 30 days Meet the team Understand the goal of each project the team supports Start diving into a part of the code base Ship a small change Apply for security clearance  90 days Feel comfortable in a part of the code base Integrate with people across multiple projects Develop a significant feature Demo a feature to internal technical leadership  1 year Attain active security clearance Be comfortable in a specific feature set in each code base Architect and present a feature set to the development team  Benefits Launch a software engineering career with no prior experience Learn to code on the job in a relaxing environment Paid time off and paid holidays Education assistance program 401k with matching Wellness programs Employee stock ownership plan (ESOP) Health, vision, and dental insurance plans Interest-free computer loans  Interview Process The I2 interview process typically involves a phone call to establish interest and fit. The next phase could be a follow-up phone call or virtual meeting with the hiring manager which will cover more technical topics. Finally, you’ll be invited for an interview with I2 technical leadership. If all goes well, you will be extended an offer to become a member of the I2 Team!   Job Requirements: What We Are Looking For: Bachelor’s Degree or higher in software engineering, computer science, or other science, technology, engineering, and math (STEM) discipline Must be able to attain a security clearance. Strong desire to learn to code and some exposure to programming languages - No prior professional experience required. A natural problem solver. Challenge seekers looking to develop tech skills. Able to contribute to multiple code bases simultaneously. Able to effectively communicate in verbal and written form.  Technical Stack Below is a list of technologies the candidate will learn and work with: C# / C++ Java Python CMake Visual Studio Modeling and Simulation Tools (AFSIM, OneSAF) Unreal Engine 4 / 5 Git / Git LFS  U.S. Citizenship Required for this Position: Yes Job Type: Regular Full-time Security Clearance: Secret Schedule: M-F; 8-5 Work Location: Torch site Travel: Yes, 0-10% Benefits: Torch Technologies is proud to offer a stable and professional work environment, a competitive salary, and an excellent, comprehensive benefit package including: ESOP participation, 401(k) match and safe-harbor contribution, medical, dental, vision, life insurance, short-term disability, long-term disability, flexible spending accounts, Health Saving Accounts and Health Reimbursement Accounts, EAP, education assistance, paid time off, and holidays. Applying to Torch Technologies: Only those candidates invited for an interview will be contacted. Employment at Torch Technologies is contingent upon the successful completion of a comprehensive background check. Torch Technologies is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Employment Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class.Show more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "Data Pipelines",
            "Microsoft Visual Studio",
            "Security Clearance",
            "Software Engineering",
            "Git (Version Control System)",
            "Unreal Engine",
            "Python (Programming Language)",
            "Technical Leadership",
            "CMake",
            "Writing Systems",
            "Java (Programming Language)",
            "C# (Programming Language)",
            "Computer Science",
            "Torch (Machine Learning)",
            "Loans",
            "Extensible Authentication Protocol",
            "Excel Solver"
        ],
        "Soft Skills": [
            "Mathematics",
            "Self-Motivation",
            "Willingness To Learn",
            "Innovation",
            "Imagination"
        ]
    },
    "https://www.glassdoor.com/job-listing/electronics-engineer-hardware-and-software-early-to-mid-career-lockheed-martin-corporation-JV_KO0,62_KE63,90.htm?jl=1008915471045": {
        "Location": "Alabama",
        "Data": [
            "JOB ID: 653656BR Date posted: Sep. 28, 2023 Program: THAAD  Description:Take your career to a new level and work at an extraordinary company in Huntsville AL. (opens in new window) The coolest jobs on this planet… or any other… are with Lockheed Martin Space! (opens in new window) Lockheed Martin. You know about us already. We've been around for over 100 years and plan to be here for at least 100 more! We solve complex challenges, advance scientific discovery and deliver innovative solutions that help our customers keep people safe. We employ 116,000 employees worldwide, 20% of whom are veterans!  We know that our strong company culture and core values help us perform better in the long run. We believe in work-life balance which results in increased productivity and a happier, less-stressed workforce.  Our 3 core values are the foundation of our culture: 1. Do the right thing 2. Perform with excellence 3. Treat others with respect  What does this role look like?  As an experienced member of our Electronic Engineering team, you will help provide solutions to a variety of technical problems by applying extensive technical expertise to develop solutions to complex problems which require the regular use of ingenuity and creativity.   In this important role you will collaborate with a diverse team of technical professionals and interact with senior external personnel on significant technical matters. You should be flexible, motivated, dedicated, detail-focused, team-oriented, and capable of multi-tasking.     Key activities you will accomplish in this role:  Implementation of design requirements, the assignment, coordination and execution of hardware designs, development and integration of hardware custom and procured electronic assemblies in accordance with process specifications.Requirements analysis, object oriented analysis & design, code & unit test, integration, and support to formal test/delivery. Develop software using languages such as C, C++.Manage risk and identify mitigation plans to meet productivity, quality, cost, schedule, and mission success objectives.  Typical mins for this role:  5 - 9 years of professional experience.Must have at least a DoD Interim Secret or higher clearance. Thus you must be a US Citizen.  BENEFITS OF EMPLOYMENT:  (opens in new window) .   We are an equal opportunity employer and value diversity at Lockheed Martin. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation. Basic Qualifications: Bachelor's degree or higher from an accredited college in Electrical Engineering or related discipline, or equivalent experience/combined education. Experience with design of digital and analog circuits. Proficient in programming in C/C++. Experience with production, manufacturing, and integration support. Desired Skills: Familiarity with processes on failure investigation (root cause analysis, failure review boards, etc.).Experience with microcontroller and FPGAsAbility to use standard lab test equipment Experience working with subcontractors and DoD personnel Project Leadership experience throughout the engineering life cycle.Proficient in programming in either Verilog, VHDL or equivalent programming language 9 or more years of professional experience for this role. Security Clearance Statement:This position requires a government security clearance, you must be a US Citizen for consideration. Clearance Level:Secret Other Important Information You Should Know Expression of Interest:By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings. Ability to Work Remotely:Onsite Full-time: The work associated with this position will be performed onsite at a designated Lockheed Martin facility. Work Schedules:Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits. Schedule for this Position:4x10 hour day, 3 days off per week Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.  As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories. Experience Level:Experienced Professional Business Unit:SPACE Relocation Available:Possible Career Area:Electrical Engineering Type:Full-Time Shift:First At Lockheed Martin, we apply our passion for purposeful innovation to keep people safe and solve the world's most complex challenges. Mission-Focused Innovation: From aerospace to outer space to cyber space, you can solve the world's most complex challenges for our customers. Foundational Values: Our culture of performance excellence, ethics, teamwork and inclusion is embedded in everything we do. Diverse Career Opportunities with Meaningful Work: Grow your career and skills for life. Our technology-driven learning platforms and programs enable your development and agility. Your Health, Your Wealth, Your Life: Our flexible schedules, competitive pay and comprehensive benefits enable you to live a healthy, fulfilling life at and outside of work. Empowered to Be Your Best: Use your strengths to make a difference in the lives of one another, our customers, our communities and our planet. Commitment to Sustainability: We foster innovation, integrity and security to preserve the environment, strengthen diverse communities and propel growth. Here, the possibilities are endless because we offer: Flexible Schedules, dependent on role Levels: Student, Entry, Mid, Senior, Management Locations: Nationwide & OCONUS PositionsShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Object-Oriented Programming (OOP)",
            "Security Clearance",
            "Unit Testing",
            "Learning Platforms",
            "Root Cause Analysis",
            "Laboratory Testing",
            "Microcontrollers",
            "Electronic Engineering",
            "Analog Electronics",
            "VHSIC Hardware Description Language (VHDL)",
            "Electrical Engineering",
            "Verilog",
            "Subcontracting"
        ],
        "Soft Skills": [
            "Ingenuity",
            "Ethical Standards And Conduct",
            "Multitasking",
            "Detail Oriented",
            "Team Oriented",
            "Teamwork",
            "Creativity",
            "Innovation",
            "Leadership",
            "Management",
            "Coordinating",
            "Investigation"
        ]
    },
    "https://www.glassdoor.com/job-listing/frontend-software-engineer-modern-technology-solutions-inc-JV_KO0,26_KE27,58.htm?jl=1008942204761": {
        "Location": "Alabama",
        "Data": [
            "Own Your Future. Modern Technology Solutions, Inc. (MTSI), is seeking a Frontend Engineer in Huntsville, AL. Why is MTSI known as a Great Place to Work? Interesting Work: Our co-workers support some of the most important and critical programs to our national defense and security. Values: Our first core value is that employees come first. We challenge our co-workers to provide the highest level of support and service, and reward them with some of the best benefits in the industry. 100% Employee Ownership: we have a stake in each other's success, and the success of our customers. It's also nice to know what's going on across the company; we have company wide town-hall meetings three times a year. Great Benefits - Most Full-Time Staff Are Eligible for: Starting PTO accrual of 20 days PTO/year + 10 holidays/year Flexible schedules 6% 401k match with immediate vesting Semi-annual bonus eligibility (July and December) Company funded Employee Stock Ownership Plan (ESOP) - a separate qualified retirement account Up to $10,000 in annual tuition reimbursement Other company funded benefits, like life and disability insurance Optional zero deductible Blue Cross/Blue Shield health insurance plan Track Record of Success: We have grown every year since our founding in 1993 Modern Technology Solutions, Inc. (MTSI) is a 100% employee-owned engineering services and solutions company that provides high-demand technical expertise in Digital Transformation, Modeling and Simulation, Rapid Capability Development, Test and Evaluation, Artificial Intelligence, Autonomy, Cybersecurity and Mission Assurance. MTSI delivers capabilities to solve problems of global importance. Founded in 1993, MTSI today has employees at over 20 offices and field sites worldwide. For more information about MTSI, please visit www.mtsi-va.com. Responsibilities: The Network, System Integration and Test Environment (NSITE) is a Government owned, managed, and developed software suite. NSITE is used by the Missile Defense Agency (MDA), Joint Services, and numerous labs in support of continued testing of systems employed for defense of the United States and our Allies. The NSITE software provides data collection, situational awareness, and analysis capabilities to a wide range of users who benefit from NSITE’s ability to act as an independent third-party truth teller. The NSITE team has in-depth experience in Tactical Data Links (TDL), Ballistic Missile Defense System (BMDS) Test, Enterprise Information Technology, Software and Systems Engineering and Information Assurance. Job Responsibilities: Responsible for designing, developing, deploying, and maintaining the NSITE software application. Work on a small agile development team where success is defined by the ability to understand your path forward, effectively communicate that path, and complete the task inherent to that path in a timely matter. Research advancements in computer science and related fields to help steer the product toward long term success. Communicate with leadership and the customer to ensure a common understanding of requirements. Document your work for the benefit of your teammates, the user, leadership, and posterity. Identify and solve challenging problems by writing performant, clean, and practical code. Qualifications: Active Secret Clearance Bachelor’s degree in Software Engineering, Computer Science, Computer Engineering, or equivalent 5 years experience working with Software Design and Development Proficient in C#, and in Microsoft .NET Proficient in WPF with MVVM patterns Ability to build an intuitive User Interface (UI) Knowledge of modern software engineering practices, including Agile methodologies Ability to analyze a requirement, generate a design, and produce efficient, robust, and testable software Ability to understand, and evaluate C# code and develop corresponding unit test(s) Mastery of computer science fundamentals, independent of a specific language Preferred Qualifications: Familiarity with WPF based control sets such as DevExpress, Telerik, or Infragistics Past experience of building applications with .NET using ASP.NET or Windows Forms. Familiarity with Extensible Application Markup Language (XAML). Understanding of and experience with secure programming techniques. Knowledge of tactical and simulation data links (specifically Link 16, JREAP, DIS, VMF, CMF and XML). Experience working with Microsoft Visual Studio Experience with using Git version control, JIRA, and Gitlab as software management tools. Experience with InstallAware. Currently have an Information Assurance Technical certification (CompTia A+, Net+, or Sec+) or the ability to obtain one Travel Required: Less than 10% annually. Please Note: U.S. Citizenship is required for most MTSI positions. #LI-AS1 #mtsi #SMD22Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Extensible Application Markup Language",
            "Information Assurance",
            "Digital Transformation",
            "Software Suite",
            ".NET Framework",
            "Extensible Markup Language (XML)",
            "Agile Methodology",
            "Link 16",
            "Git (Version Control System)",
            "Secret Clearance",
            "Secure Programming",
            "Capability Development",
            "CompTIA A+",
            "Microsoft Visual Studio",
            "ASP.NET",
            "Unit Testing",
            "JIRA",
            "Infragistics",
            "Software Engineering",
            "DevExpress",
            "Tactical Data Link",
            "Cyber Security",
            "Technology Solutions",
            "Telerik",
            "Front End Design",
            "C# (Programming Language)",
            "Model View ViewModel",
            "Testability",
            "CompTIA Security+",
            "CompTIA Network+",
            "Artificial Intelligence",
            "Software Project Management",
            "Windows Forms",
            "Computer Engineering",
            "Windows Presentation Foundation",
            "Systems Engineering",
            "Computer Science",
            "Gitlab",
            "Version Control",
            "User Interface (UI)",
            "Systems Integration",
            "Data Collection"
        ],
        "Soft Skills": [
            "Information Technology",
            "Research",
            "Leadership",
            "Writing"
        ]
    },
    "https://www.glassdoor.com/job-listing/space-exploration-software-developer-100-remote-performance-JV_KO0,47_KE48,59.htm?jl=1008947988231": {
        "Location": "Alabama",
        "Data": [
            "Job Description: Performance Software is a midsize company with a great work-life balance, providing innovative software and hardware to our client companies. We are looking for passionate Software Engineers to design and develop software solutions for state-of-the-art safety-critical systems in the areas of Avionics and Space Exploration to join our team. Positions are either full-time or hourly and you can work from your home.   Job Requirements:  Bachelors or advanced degree in Computer Science, Computer Engineering, Electrical Engineering, Computer Systems Engineering, Mathematics, or equivalent development experience Software development experience involving two or more of the following: C++/Python, LINUX, AZURE OS, DOORS, Matlab, Simulink, Vector Cast, Test Automation Highly motivated with a self-starting attitude  About Performance: Performance Software is engaged in the design of Real-time Embedded Software and Hardware. This includes Avionics and Space Exploration applications such as Synthetic Vision Cockpit Displays, Flight Management System Guidance and Navigation, Platforms, Submarine Control Panels and Datalink Applications. Our customers are both Commercial and Defense-related avionics and rocketry suppliers/manufacturers. Performance Software has been in business since 1998; we were awarded INC Magazine 5000 Fastest Growing Companies and Best Places to Work for multiple years. Why Performance? Our foundation was built by implementing the characteristics from large companies that we liked and eliminating the characteristics that we did not. Without the archaic practices from larger organizations, we fully embrace the culture of clear accountability, a positive attitude, transparency between every department, and productivity over the clock. This builds trust between management and employee’s, which provides us with our greatest strengths as an organization, flexibility, and work life balance. To learn more about Performance Software: https://www.psware.com/careers/  Performance Software is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information. We are committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. If you need reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please discuss this with your recruiter if you are selected for an interview.Show more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "Microsoft Azure",
            "Embedded Software",
            "Software Engineering",
            "Linux",
            "Computer Engineering",
            "Python (Programming Language)",
            "Control Panels",
            "Test Automation",
            "MATLAB",
            "Space Exploration",
            "Computer Science",
            "Electrical Engineering",
            "Simulink",
            "Operating Systems",
            "Software Development"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Mathematics",
            "Positivity",
            "Accountability",
            "Relationship Building",
            "Management",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/uas-software-systems-engineer-c2e-peopletec-inc-JV_KO0,33_KE34,47.htm?jl=1008933685829": {
        "Location": "Alabama",
        "Data": [
            "Responsibilities: PeopleTec seeks a UAS Software Systems Engineer to assist the Program Management Office (PMO) Uncrewed Aircraft Systems (UAS) Command Control and Effects (C2E) Product Office (PO) by providing software system subject matter expertise to C2E on the Launched Effects (LEs) and supporting program planning and development activities. The SSE will provide the following duties: Collect information on systems-level project specifications, performance requirements, and known capabilities and limitations as they relate to the LE system. Review contractor developed systems software to improve performance, correct errors, and conform with compatibility requirements of available hardware. Determines feasibility of proposed system modifications or design, ensuring the needs and requirements of the user will be met within time and cost requirements Designs systems software to meet project requirements, collaborating with systems analysts, engineers, programmers, and other developers as needed. Develops and leads software system testing and validation procedures; compiles relevant documentation. Uses mathematical models and scientific analysis to predict and measure consequences and other outcomes of software system design. Coordinates and schedules installation of software system.  Qualifications:  Knowledgeable of DO 178C and Design Assurance Levels (DAL) Ability to review and analyze computer programs for various purposes. Ability to analyze and address needs of users based on User Requirements and CONOPS. Thorough understanding of computer engineering principles and procedures. Ability to manage time and prioritize tasks. Knowledge of Modular Open System Approach (MOSA) and Agile design and development principles Excellent verbal and written communication skills. Communication skills to interface with government and contractors to represent technical and programmatic positions  Overview:  People First. Technology Always. PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce. Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields. Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people. Come Experience It. #cjpost #dpost EEO Statement PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, applicationhelp@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Software Systems",
            "Design Assurance",
            "System Testing",
            "User Requirements Documents",
            "Scientific Methods",
            "Command Controls",
            "Customer Support",
            "Mathematical Modeling",
            "Concept Of Operations",
            "DO-178B/C (Software Considerations in Airborne Systems and Equipment Certification)",
            "Project Management Office (PMO)",
            "Systems Design",
            "Computer Engineering",
            "Unmanned Aerial Systems (UAS)",
            "Agile Methodology"
        ],
        "Soft Skills": [
            "Planning",
            "Time Management",
            "Information Gathering",
            "Writing",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/junior-systems-software-engineer-ironmountain-solutions-inc-JV_KO0,32_KE33,59.htm?jl=1008937504583": {
        "Location": "Alabama",
        "Data": [
            "501231 Junior Systems/Software Engineer in Huntsville, AL  Work Location: Huntsville, AL  Schedule: Full Time  Relocation: Negotiable  IronMountain Solutions is seeking a Junior Systems/Software Engineer in Huntsville, AL. This is a hybrid position and will require working onsite in Huntsville one to two days a week. This position also requires a Secret Clearance or the ability to obtain a Secret Clearance. Must have three to five years work experience.  Job Responsibilities:  Support Aviation Mission Planning and Airspace Control / Management Systems in a team-focused, dynamic, collaborative, and mentoring environment on Redstone Arsenal.  Required Education, Knowledge, and Experience: A bachelor's degree, or higher, in system or software engineering plus 3-5 years relevant experience. Complex problem-solving skills Excellent communication skills Develop and maintain requirements traceability matrices  Desired Skills:  Exposure to aviation mission planning or tactical airspace control or management Development and maintenance of an Integrated Master Schedule (IMS) Develop, write, and staff briefings to diverse groups Experience in work statement preparation (e.g., Statement of work [SOW], Performance Work Statements [PWS], Technical Directives or Task Description [TD])  Clearance Requirements: Must possess or have the ability to obtain an active SECRET security clearance.  Required Travel: 10%  IronMountain Solutions is an Equal Opportunity Employer/SDVOSBShow more Report"
        ],
        "Hard Skills": [
            "Requirements Traceability",
            "Airspace",
            "Secret Clearance",
            "Mission Planning",
            "Software Engineering",
            "Integrated Master Plan (IMP)",
            "Management Training And Development"
        ],
        "Soft Skills": [
            "Complex Problem Solving",
            "Mentorship",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/degraded-visual-environment-dve-software-engineer-torch-technologies-inc-JV_KO0,49_KE50,72.htm?jl=1008936544675": {
        "Location": "Alabama",
        "Data": [
            "Job Description: Job Description: Torch Technologies is seeking a Systems / Software Engineer to bridge the requirements management gap between software applications, DVE hardware, integration, and test activities to meet development and fielding requirements.  Key Responsibilities: Software Engineering in all phases of the software development life cycle, including requirements management and traceability, design, coding, integration, testing, and maintenance. Collaborate with the engineering team to design and architect software systems, making well-informed decisions on technology stack, architecture, and best practices. Develop software and hardware requirements for inclusion in statements of work and/or technical instructions. Identify and address technical challenges, troubleshoot, and debug issues, and find creative solutions to complex problems. Participate in documentation reviews, provide constructive feedback, and help maintain documentation quality and standards.   Job Requirements: Qualifications: Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field. Minimum 5-10 years of work in a technical field related to system/software design. Proven experience in software development and engineering. Familiarity with Agile Development methodologies. Understanding of Army software practices and impacts as they apply to system requirements documentation and integration onto hardware. Strong communication skills are required to effectively communicate at all levels, to include platform and requirements representatives, Industry, and Other Government Agencies. Excellent problem-solving and analytical skills.  Desired Skills: Knowledge of Model Based System Engineering (MBSE) and SysML/UML. Knowledge of Modular Open Systems Approach (MOSA). Experience with the design, verification, and qualification of Army aviation systems.  U.S. Citizenship Required for this Position: Yes Job Type: Regular Full-time, hybrid work environment with a minimum two workdays in-office Security Clearance: secret Schedule: M-F; 8-5 Work Location: customer site Travel: yes, up to 20%  Benefits: Torch Technologies is proud to offer a stable and professional work environment, a competitive salary, and an excellent, comprehensive benefit package including: ESOP participation, 401(k) match and safe-harbor contribution, medical, dental, vision, life insurance, short-term disability, long-term disability, flexible spending accounts, Health Saving Accounts and Health Reimbursement Accounts, EAP, education assistance, paid time off, and holidays.  Applying to Torch Technologies: Only those candidates invited for an interview will be contacted. Employment at Torch Technologies is contingent upon the successful completion of a comprehensive background check.  Torch Technologies is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Employment Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class.Show more Report"
        ],
        "Hard Skills": [
            "Unified Modeling Language",
            "Software Systems",
            "System Software",
            "Debugging",
            "Security Clearance",
            "Agile Methodology",
            "Systems Engineering",
            "Software Development Life Cycle",
            "Requirements Management",
            "Model Based Systems Engineering",
            "Integration Testing",
            "Software Engineering",
            "Design Verification",
            "Computer Science",
            "Software Development",
            "Systems Modeling Language",
            "Employee Assistance Programs",
            "System Requirements"
        ],
        "Soft Skills": [
            "Analytical Skills",
            "Systems Thinking",
            "Constructive Feedback",
            "Troubleshooting (Problem Solving)",
            "Communications",
            "Problem Solving"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-lockheed-martin-corporation-JV_KO0,17_KE18,45.htm?jl=1008915469826": {
        "Location": "Alabama",
        "Data": [
            "JOB ID: 652390BR Date posted: Sep. 18, 2023 Program: LRHW  Description:Do you have a commitment to success, proven interpersonal skills, a positive outlook? Are you a creative thinker and problem solver? Are you looking for a meaningful career?  If so, then we would love to speak with you! The Engineering & Technology organization is a highly dynamic and growing organization that plays a vital role in providing mission-critical solutions to our customers.  Come be a part of the development of the new Long Range Hypersonic Weapon (LRHW). Join the Lockheed Martin team and be a part of the company that has developed and flown more hypersonic vehicles than any other U.S. Company and has decades of hypersonic development and flight test experience from government contracts as well as internal investments in research and development projects. This position is for a software engineer to support the LRHW software organization. You will help code, develop, and innovate technical solutions for soldier utilized ground systems.  This position requires strong communication skills, and the ability to work both independently and in a team environment, and to interface with software developers, test engineers, system engineers, program management, quality assurance engineers, and customer representatives. Basic Qualifications: Professional Java or C++ experienceAgile development and processesStrong problem solving and troubleshooting skillsExcellent team orientation skillsDoD Secret Clearance Desired Skills: Experience developing ground software for military systemsFull software development lifecycle experienceExperience with JIRA, Confluence, and GitLabKnowledge of PythonKnowledge of RHEL Security Clearance Statement:This position requires a government security clearance, you must be a US Citizen for consideration. Clearance Level:Secret Other Important Information You Should Know Expression of Interest:By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings. Ability to Work Remotely:Onsite Full-time: The work associated with this position will be performed onsite at a designated Lockheed Martin facility. Work Schedules:Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits. Schedule for this Position:9x80 every other Friday off Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. At Lockheed Martin, we use our passion for purposeful innovation to help keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work.   With our employees as our priority, we provide diverse career opportunities designed to propel, develop, and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. We place an emphasis on empowering our employees by fostering an inclusive environment built upon integrity and corporate responsibility.  If this sounds like a culture you connect with, you’re invited to apply for this role. Or, if you are unsure whether your experience aligns with the requirements of this position, we encourage you to search on Lockheed Martin Jobs, and apply for roles that align with your qualifications. Experience Level:Experienced Professional Business Unit:SPACE Relocation Available:Possible Career Area:Software Engineering Type:Full-Time Shift:First At Lockheed Martin, we apply our passion for purposeful innovation to keep people safe and solve the world's most complex challenges. Mission-Focused Innovation: From aerospace to outer space to cyber space, you can solve the world's most complex challenges for our customers. Foundational Values: Our culture of performance excellence, ethics, teamwork and inclusion is embedded in everything we do. Diverse Career Opportunities with Meaningful Work: Grow your career and skills for life. Our technology-driven learning platforms and programs enable your development and agility. Your Health, Your Wealth, Your Life: Our flexible schedules, competitive pay and comprehensive benefits enable you to live a healthy, fulfilling life at and outside of work. Empowered to Be Your Best: Use your strengths to make a difference in the lives of one another, our customers, our communities and our planet. Commitment to Sustainability: We foster innovation, integrity and security to preserve the environment, strengthen diverse communities and propel growth. Here, the possibilities are endless because we offer: Flexible Schedules, dependent on role Levels: Student, Entry, Mid, Senior, Management Locations: Nationwide & OCONUS PositionsShow more Report"
        ],
        "Hard Skills": [
            "Flight Testing",
            "C++ (Programming Language)",
            "Security Clearance",
            "Secret Clearance",
            "Red Hat Enterprise Linux",
            "Learning Platforms",
            "JIRA",
            "Java (Programming Language)",
            "Software Engineering",
            "Software Development Life Cycle",
            "Corporate Social Responsibility",
            "Software Development",
            "Research And Development",
            "Test Engineering"
        ],
        "Soft Skills": [
            "Interpersonal Communications",
            "Ethical Standards And Conduct",
            "Quality Assurance",
            "Program Management",
            "Teamwork",
            "Communications",
            "Problem Solving",
            "Innovation",
            "Management"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-davidson-technologies-inc-JV_KO0,17_KE18,43.htm?jl=1008944661812": {
        "Location": "Alabama",
        "Data": [
            "Job Description:Davidson is seeking a Software Engineer in Huntsville, AL.This position will support a major strategic weapons system program. Davidson will be supporting the Air Force’s development, production, sustainment and deployment of hardware and software systems for Intercontinental Ballistic Missile (ICBM) Ground and Airborne Launch Control Systems, Launch Facilities and associated infrastructureQualified candidate will work a 9/80 work schedule which allows employees to work a nine-hour day Monday through Thursday to take every other Friday offThe candidate that is selected will perform the full software development life-cycle activities including requirements analysis, design, implementation, unit testing, integration, verification, documentation, and configuration management using Agile methodologyRequirements:Bachelor's Degree in a STEM field and 2-10 years of Software Engineering ExperienceExperience in software engineering with C/C++ in a Linux environmentU.S. CitizenshipDesired Competencies/Experience/Certifications:Experience in software development on a real time operating systemExperience with Agile Scrum or Kanban methodologiesExperience using and/or setting up a DevSecOps pipelineFamiliarity with common source control tools (git, Mercurial, etc.) and automated build system workflows (Jenkins, Go, etc.)Familiarity with virtual machine technologyClearance Requirements:Must possess a DoD Secret Security ClearanceJob Type: Full-timePay: $100,000.00 - $160,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleFlexible spending accountHealth insuranceLife insurancePaid time offParental leaveReferral programRetirement planTuition reimbursementVision insuranceSchedule:8 hour shiftEducation:Bachelor's (Required)Experience:Software Engineering: 2 years (Required)C/C++: 2 years (Required)Linux: 2 years (Required)Computer science: 4 years (Preferred)Security clearance:Secret (Required)Work Location: In personShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Systems",
            "Linux Kernel",
            "DevSecOps",
            "Security Clearance",
            "Git (Version Control System)",
            "Linux",
            "Software Development Life Cycle",
            "Scrum (Software Development)",
            "Software Engineering",
            "Requirements Analysis",
            "Jenkins",
            "Mercurial",
            "Configuration Management",
            "Unit Testing",
            "Version Control",
            "Virtual Machines",
            "Computer Science",
            "Software Development",
            "Agile Methodology",
            "Automation"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/associate-sw-engineer-software-engineer-aht-northrop-grumman-JV_KO0,43_KE44,60.htm?jl=1008929038727": {
        "Location": "Alabama",
        "Data": [
            "Requisition ID: R10134457 Category: Engineering Location: Huntsville, Alabama, United States of America Citizenship required: United States Citizenship Clearance Type: Secret Telecommute: No- Teleworking not available for this position Shift: 1st Shift (United States of America) Travel Required: Yes, 10% of the Time Relocation Assistance: Relocation assistance may be available Positions Available: 5 At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history. At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people’s lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation’s history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they’re making history. Northrop Grumman Defense Systems is searching for Software Engineers (multiple positions) to join the Command and Control, Communication and Computer Missile Defense (C4MD) Business Unit in support of our programs, in Huntsville, AL. This position is capable of placing candidates anywhere within C4MD, MRPS, any programs like ABAD, IBCS, Wisla, SHORAD, and/or IRADs. The selected candidates’ task encompasses the following: Designs, develops, documents, tests and debugs applications software and systems that contain logical and mathematical solutions. Conducts multidisciplinary research and collaborates with systems engineers and/or hardware engineers in the planning, design, development. Determines computer user needs; analyzes system capabilities to resolve problems on program intent, output requirements, input data acquisition, programming techniques and controls; prepares operating instructions; designs and develops compilers and assemblers, utility programs, and operating systems. Ensures software standards are met. This requisition may be filled at a Level 1 or a Level 2 Software Engineer: Associate SW Engineer - Bachelor's degree in STEM, or additional years of experience in lieu of degree may be considered SW Engineer - Bachelor's degree in STEM (and 2 years of relevant experience, or Masters and 0 years) or additional years of experience in lieu of degree may be considered Basic Qualifications: Active Secret Security Clearance is required Experience with JAVA (work experience) Familiarity with Python Experience with collaborating in or using source code control environment (such as GitHub) Understanding of all phases of software development, and practical experience in an Agile / Dev*Ops environment For all positions: Following are good to have, but are not required: Security+ certification Experience testing SW for performance and functionality based on requirement specification and ability to identify and document exact sequence of activities desired Experience with automated testing Experience developing Eggplant software or Squish/ Froglogic. OpenGL and Front end experience OSGi services experience Experience in Air & Missile Defense Command and Control programs such as PATRIOT, SENTINEL, C2BMC or THAAD or any sensor/weapon system, Link 16 experience Python R (Language) Julia (Language) SQL NoSQL MongoDB Elasticsearch Web Scraping REST API Git / Version control AI/ML Tensorflow PyTorch Numerical Computing / Optimization Scrum Master experience Dev Ops experience Salary Range: $63,000 - $95,000 Salary Range 2: $77,000 - $115,000 Employees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business. Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit http://www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions.Show more Report"
        ],
        "Hard Skills": [
            "Scrum (Software Development)",
            "Multidisciplinary Research",
            "NoSQL",
            "Web Scraping",
            "Systems Engineering",
            "Source Code Control Systems",
            "CompTIA Security+",
            "Github",
            "Secret Clearance",
            "Numerical Computing",
            "Link 16",
            "Software Engineering",
            "Git (Version Control System)",
            "RESTful API",
            "R (Programming Language)",
            "Agile Methodology",
            "Test Automation",
            "Compilers",
            "Python (Programming Language)",
            "Utility Software",
            "MongoDB",
            "Froglogic Squish",
            "Java (Programming Language)",
            "SQL (Programming Language)",
            "Machine Learning",
            "Data Acquisition",
            "Elasticsearch",
            "Control Communications",
            "PyTorch (Machine Learning Library)",
            "OpenGL",
            "Julia (Programming Language)",
            "Operating Systems",
            "Version Control",
            "Front End (Software Engineering)",
            "TensorFlow",
            "Software Development"
        ],
        "Soft Skills": [
            "Planning",
            "Courage",
            "Intellectual Curiosity",
            "Mathematics"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-integration-engineer-jacobs-JV_KO0,29_KE30,36.htm?jl=1008925861487": {
        "Location": "Alabama",
        "Data": [
            "Challenging Today. Reinventing Tomorrow.  We're invested in you and your success. Everything we do is more than just a project. It's our challenge as human beings, too. That's why we bring a thoughtful and collaborative approach to every one of our partnerships.  At Jacobs, we challenge the status quo and redefine how to solve the world's greatest challenges, transforming big ideas into intelligent solutions for a more connected, sustainable world.  Design your career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow   Your Impact: Jacobs Space Exploration Group (JSEG) is comprised of 10 companies and is located at Marshall Space Flight Center in Huntsville, AL (ranked #1 in Best Places to Live by U.S. News for 2022-2023). JSEG has been a primary contractor for NASA since 1989 and supports marquee NASA programs, including the Space Launch System, International Space Station, space optics fabrication, earth and space sciences and advanced propulsion system development. As a partner in NASA’s next generation of space exploration, our jobs are literally history in the making. This position will support the Systems Integration and Test Facility (SITF), Systems Integration Laboratory (SIL) Hardware-in-the-Loop facility (HWIL), and the new MARS Ascent Vehicle Systems Integration LAb. These facilities will be used to verify the integrated avionics system and Flight Software for the Space Launch System (SLS) at NASA’s Marshall Space Flight Center (MSFC). Responsibilities: The Software Development Engineer participates in implementing and maintaining laboratory automation software that controls real-time HWIL simulation systems used to support the NASA Space Launch System program at MSFC. This operations team member collects, interprets and documents system requirements; participates in component, subsystem and system concept designs; develops and recommends methods, tools, designs, and automation functions. Perform software systems engineering functions. Develop and execute test plans and procedures. Enter and update documentation into appropriate control systems. Troubleshoot and correct test anomalies. Collaborate with cross-functional teams to ensure products meet requirements. Produce documentation and user training materials to assist users. These activities will be ongoing through multiple launch vehicle configurations as the SLS program completes program phases, reviews and schedule milestones. Here’s What You’ll Need: Qualifications: B.S/M.S degree in Computer Science, Software Engineering, Electrical Engineering or related field is required. Degree from an ABET-accredited university is preferred. Typically, educational requirements are a BS with at 0-5 years experience. Required Experience: Proficient in tools/languages such as: Python, Qt, Windows 10, and Linux Exposure to tools/languages/standards such as: XML, C/C++, Git, Bash,Trac, and Linux shell scripting. Desired Experience: Systems engineering experience in disciplines such as hardware and software integration, requirements development, verification and validation, and testing. Development on Windows and Linux operating systems. Network communications with TCP and UDP. Configuration management of distributed computing platforms used during formal avionics HWIL test activities. Developing user interfaces for automated test control and data display in support of formal avionics HWIL - test activities. The ideal candidate should be proactive, willing to learn, a team player, customer-focused, attentive to details, and always looking for improvements. The Jacobs Space Exploration Group (JSEG) offers a partnership in which you can grow personally and professionally within a framework of strong leadership, competitive compensation, and rewarding career paths. Come join our team on the Engineering Services and Science Capability Augmentation (ESSCA) contract whose work is destined to have a long-range effect on future generations! For more information on why Huntsville is known as “one of the smartest cities in the nation”, check out these websites: https://hsvchamber.org/ www.Huntsville.org/ https://www.movoto.com/guide/huntsville-al/moving-to-huntsville/ https://realestate.usnews.com/places/alabama/huntsville https://iveyhsv.com/real-estate-blog/13-reasons-why-you-should-move-to-huntsville/ Essential Functions Work Environment: This position is 100% onsite and in a lab environment. Requires ability to provide clear, concise, accurate and timely communication, both verbally and in writing (100%). Requires ability to interact professionally with co-workers, management, and client (100%). Physical Requirements: Requires sitting for extended periods of time at a desk in an MSFC NASA facility to perform technical tasks (10%). Also, requires sitting for extended periods of time at a desk to write reports and perform engineering tasks (80%). Requires ability to use stairs or elevators for access between multiple floors and buildings at an MSFC NASA facility (10%). Equipment and Machines: Requires ability to operate a personal computer, a telephone, fax machine, copier, calculator, and other general office equipment (100%). Attendance: Normal workday 7:30 – 4:30, Monday thru Friday. Shift work is required during 24 hour operations. Minimal overtime may be required (10%) to meet schedule milestones and to support technical demands of the job. Regular attendance is a necessity and adequate arrangements for delegating duties during absences are required. Other Essential Functions: The ability to work independently with minimal supervision, and to make rational decisions, and to exercise good judgment is essential (100%). Grooming and dress must be appropriate for the position and must not impose a safety risk/hazard to the employee or others. Proof of U.S. Citizenship is required. #ESSCAShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Systems",
            "Office Equipment",
            "Electrical Engineering",
            "Linux",
            "Extensible Markup Language (XML)",
            "Vehicle Systems",
            "Space Science",
            "Distributed Computing",
            "Space Stations",
            "Git (Version Control System)",
            "Qt (Software)",
            "Python (Programming Language)",
            "Network Communications",
            "Laboratory Automation",
            "Space Flight",
            "Flight Software",
            "Launch Vehicle Systems",
            "Software Engineering",
            "Scripting",
            "Software Development",
            "Space Exploration",
            "Configuration Management",
            "Data Display Debuggers",
            "User Interface (UI) Design",
            "Test Automation",
            "Verification And Validation",
            "Bash (Scripting Language)",
            "Systems Engineering",
            "Computer Science",
            "Unix Shell",
            "Transmission Control Protocol (TCP)",
            "Microsoft Windows 10",
            "Systems Integration",
            "Test Planning",
            "Automation",
            "Avionics",
            "Milestones (Project Management)",
            "Optics",
            "System Requirements"
        ],
        "Soft Skills": [
            "Customer Service",
            "Calculators",
            "Professionalism",
            "Communications",
            "Willingness To Learn",
            "Report Writing",
            "Management",
            "Operations",
            "Troubleshooting (Problem Solving)",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/specialist-software-engineering-l3harris-technologies-JV_KO0,31_KE32,53.htm?jl=1008911810748": {
        "Location": "Alabama",
        "Data": [
            "We are seeking a Specialist, Software Engineer to join the team at our Huntsville, AL site. Reporting directly to the Sr. Manager, Software Development, Space Business Unit, this position will support the Huntsville's software team’s primary responsibility is to develop and maintain flight and ground software in support of key Space programs. Our team also provides support to defense control systems on an as needed basis. As a key contributor under the general guidance of a project team lead, you will have hands on opportunities develop applications that support human space flight. This career opportunity will challenge you to tackle complex design problems in a rapid paced, laboratory development environment. As a member of the software development team your regular duties will include contributing to the production of software requirements, design, implementation, and test for flight and ground applications. This position would be 1st shift. 7:00 am to 4:30 pm 9/80 schedule. This opening may be filled at this level as posted or at one level higher.Show more Report"
        ],
        "Hard Skills": [
            "Space Flight",
            "Development Environment",
            "Software Engineering",
            "Software Development"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-test-and-quality-assurance-qa-engineer-nou-systems-inc-JV_KO0,47_KE48,63.htm?jl=1008908360429": {
        "Location": "Alabama",
        "Data": [
            "nou Systems, Inc. (nSI) is here to solve diverse and challenging technical problems in an enjoyable, stimulating environment, while providing unsurpassed value to our customers. We are pleased to announce an opening for a Software Test Engineer who will join our JSTC2 Software Program in Huntsville, AL (Redstone Arsenal) and become part of our rapidly growing technology company operating in missile defense, cybersecurity, test range modernization, biotechnology, and space control marketspaces. Here’s what you’ll be doing: You’ll be working with the Integration & Test, Development and Cybersecurity Teams for a Government Off the Shelf (GOTS) Software Product that is currently in development. Duties in this position will include working side by side with a highly qualified Development staff, working with the Government customer on their Integration support, and assisting the Cybersecurity Team in finding and documenting vulnerabilities found in testing, and developing automated tests to provide continual support to product development. Here’s what you’ll need: You must have a Bachelor’s degree at minimum, in a relevant field such as Software Development, System Engineering, or similar. Also, we’re looking for someone with 5+ years full-time professional experience in areas such as Software Testing, Software Development, Software Engineering, or similar. Finally, you must possess or have the ability to obtain an active Secret Clearance. You also must have:The ability to document test results for product acceptance and requirement traceabilityFamiliarity with executing software tests within a development environmentExperience with automated test frameworks, and designing automated tests and requirementsExposure to multiple types of testing (Integration, Compatibility, Stress, Regression, etc)Proficiency with using source control tools (Git, TFS, etc)Issue tracking application experience (Gitlab, Jira, etc)Ability to communicate findings clearly to both the development team and customer baseA drive to learn and grow on a great team in an amazing company Lacking any one of these disqualifies you from this job. Other qualifications we hope you bring to the table:Software Development ExpertiseModeling and Simulation QA/testingExperience in software QA/testing for a DoD programExperience with Fortify scanningExperience with GitLab Ultimate scanning/security toolsUnit Testing experienceFamiliarity with integrating with CI/CD pipelinesThe ability to share knowledge via mentorship and teachingTechnical Writing Experience (SOPs, RMF Documentation, Architectural Diagrams, etc.)Current Secret or higher clearance Remote work option? This position may include a hybrid aspect to work location. Most work will be done at Government site, but occasional remote work may be approved. Who is nou (pronounced ‘new’) Systems? nou Systems, Inc. (or nSI for short) is a rapidly growing technology company that cares about its people located all over the globe. Our people are passionate about missile defense, cybersecurity, test range modernization, and all-things space and space-market related. We offer significant advancement and personal career development opportunities within our dynamic high-tech company.  Although we are a rapidly growing company, winning the Inc. 5000 List as one of America’s fastest-growing private companies from 2017–2021, our culture is firmly established in treating our employees like family. See some words our employees use to describe our culture with the attached Culture Cloud. Benefits of working at nSI nou Systems, Inc. offers a comprehensive, total rewards package that includes competitive compensation and diverse benefits that reflect our company culture of service, excellence, and a supportive work environment. Other specific benefits include: Competitive Wages* Medical, Rx, Dental & Vision Insurance Medical plan with Health Savings Account eligibility Generous company-funded Basic Life Insurance Company-funded Short-Term & Long-Term Disability Optional Accident and Critical Illness Insurance Personal Time Off, Annual Leave, and Paid Federal Holidays 401(k) Retirement Plan Employee Stock Ownership Plan (ESOP) Tuition Reimbursement for ongoing training, continuing education, or advanced degree programs Personal Development, Learning Opportunities, & Lunch-n-Learns Opportunities for Advancement Skills Development & Certifications Employee Referral Bonus Program Corporate Sponsored Events & Community Outreach Remote-work friendly If you work from the corporate office – Fully stocked breakrooms!!!Final compensation for this position is determined by a variety of factors, such as a candidate’s relevant work experience, skills, certifications, and geographic location. nSI is an Equal Opportunity Employer Employment opportunities at nSI are based upon a candidate’s qualifications and capabilities to perform the essential functions of a particular job and are free from discrimination based on race, color, religion, national origin, sex, sexual orientation, gender identity, age, disability, protected veteran status, genetic information, or any other characteristic protected by law. For our complete EEO/AA and Pay Transparency statement, please visit www.nou-systems.com/workingatnou. U.S. citizenship is required for most positions.Show more Report"
        ],
        "Hard Skills": [
            "Software Quality (SQA/SQC)",
            "Systems Engineering",
            "Software Testing",
            "Git (Version Control System)",
            "Secret Clearance",
            "Government Off-The-Shelf",
            "JIRA",
            "Community Outreach",
            "Software Engineering",
            "Cyber Security",
            "Team Foundation Server",
            "Version Control",
            "Test Automation",
            "CI/CD",
            "Gitlab",
            "Software Development",
            "Biotechnology",
            "Vulnerability"
        ],
        "Soft Skills": [
            "Communications",
            "Mentorship"
        ]
    },
    "https://www.glassdoor.com/job-listing/jr-software-engineer-yulista-management-services-JV_KO0,20_KE21,48.htm?jl=1008931486756": {
        "Location": "Alabama",
        "Data": [
            "Troy 7 Inc. Regular PRIMARY FUNCTION Troy 7, Inc. is seeking a software Jr. Software Engineer to support the Missile Defense Agency (MDA). In this position, the selected candidate will support the MDA/TC Targets and Countermeasures Technical Team at Redstone Arsenal in Huntsville Alabama. ESSENTIAL FUNCTIONS Develop and maintain in house software to decommutate telemetry data Deploy for missions and provide technical and telemetry support Ability to learn new software development languages and technologies Troubleshoot coding problems quickly and efficiently Analyze, develop unit testing, and test programs and products before distribution Aid and support the coaching and training of other team members to ensure all employees are confident in the use of software applications SUPERVISORY RESPONSIBILITIES There are no supervisory responsibilities for this position. KNOWLEDGE, SKILLS, & ABILITIES: REQUIRED: Must be detail oriented, self-motivated, and work both independently and collaboratively Experience applying engineering rigor to analyze and resolve problems Experience developing object-oriented software using Java, C++, C# and more DESIRED: Experience with source code control tools such as Git Familiar with Matlab QUALIFICATIONS: A bachelor's degree in computer science or related degree is required Active Secret clearance is required, Top Secret desired 3+ years working on missile defense-related or other DoD program/projects PREFERENCE STATEMENT Preference will be given to Calista shareholders and their descendants and to spouses of Calista shareholders, and to shareholders of other corporations created pursuant to the Alaska Native Claims Settlement Act, in accordance with Title 43 U.S. Code 1626(g). EEO STATEMENT Additionally, it is our policy to select, place, train and promote the most qualified individuals based upon relevant factors such as work quality, attitude and experience, so as to provide equal employment opportunity for all employees in compliance with applicable local, state and federal laws and without regard to non-work related factors such as race, color, religion/creed, sex, national origin, age, disability, marital status, veteran status, pregnancy, sexual orientation, gender identity, citizenship, genetic information, or other protected status. When applicable, our policy of non-discrimination applies to all terms and conditions of employment, including but not limited to, recruiting, hiring, training, transfer, promotion, placement, layoff, compensation, termination, reduction in force and benefits.  REASONABLE ACCOMMODATION It is Calista and Subsidiaries' business philosophy and practice to provide reasonable accommodations, according to applicable state and federal laws, to all qualified individuals with physical or mental disabilities.  The statements contained in this job description are intended to describe the general content and requirements for performance of this job. It is not intended to be an exhaustive list of all job duties, responsibilities, and requirements.  This job description is not an employment agreement or contract. Management has the exclusive right to alter the scope of work within the framework of this job description at any time without prior notice.Show more Report"
        ],
        "Hard Skills": [
            "Object-Oriented Programming (OOP)",
            "C++ (Programming Language)",
            "Source Code Control Systems",
            "Git (Version Control System)",
            "Secret Clearance",
            "Contract Management",
            "Java (Programming Language)",
            "C# (Programming Language)",
            "Philosophy Of Business",
            "MATLAB",
            "Unit Testing",
            "Software Engineering",
            "Computer Science",
            "Software Development"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Coaching",
            "Self-Motivation",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/ctatt-software-engineer-gan-JV_KO0,23_KE24,27.htm?jl=1008941536714": {
        "Location": "Alabama",
        "Data": [
            "Overview:  Come work for on our GaN software team developing innovative solutions for our customers. If you have experience in the following areas, we want to talk with you: National Instruments Labview C++ Python MIL-STD-1553 Network programming GUI Programming The software team is trying new things and working on problems that others cannot solve. Positions are available for mid-level developers. Responsibilities: Candidate will be responsible for developing software to handle incoming MIL-STD-1553 data on commodity PCs Designs and implements UI/UX applications for displaying data as needed Implements software using an Agile process and standard code management tools (Gitlab, Git etc..) Designs, develops, documents, tests and debugs software Candidates will participate in software team meetings, software design reviews; technical interchange meetings, and other meetings as needed. Qualifications:  Requirements: BS in Computer Science, or related degree and 3+ years of related experience Ability to operate and deliver independently A desire to learn and solve problems Self-driven, customer focused performer C++ Desired Skills National Instruments Labview Windows/Linux Network Programming Python Special Requirements Must be a US Citizen and successfully complete a U.S. government background investigation. Must have a Secret clearance or be capable of obtaining an interim Secret clearance Geeks and Nerds is an innovative technology company that encourages ingenuity, defies the norm, fosters teamwork, and defines the future for our community and nation. We are an Employee-Owned company which means our dedicated team members are also the owners of Geeks and Nerds. When you join GaN, you are not an employee; you are the future owner of Geeks and Nerds. Come join the company that develops innovative solutions that makes a positive difference in our community and nation. Come join the exceptionally talented and dedicated co-owners. Join a company of significance! GaN Corporation is an Equal Opportunity Employer. We are pleased to consider all qualified applicants for employment without regard to race, color, gender, sexual orientation, gender identity, religion, national origin, age, marital status, veteran status, disability, genetic information, or any other legally protected classifications. GaN Corporation participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "LabVIEW",
            "C++ (Programming Language)",
            "Network Programming",
            "Graphical User Interface",
            "Git (Version Control System)",
            "Secret Clearance",
            "Linux",
            "Python (Programming Language)",
            "Agile Methodology",
            "Military Standards And Specifications",
            "User Experience (UX)",
            "Computer Science",
            "Gitlab",
            "Generative Adversarial Networks"
        ],
        "Soft Skills": [
            "Ingenuity",
            "Customer Service",
            "Willingness To Learn",
            "Teamwork",
            "Management",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-junior-to-mid-level-dynetics-JV_KO0,37_KE38,46.htm?jl=1008864154602": {
        "Location": "Alabama",
        "Data": [
            "Leidos Dynetics Group is seeking a talented Junior to Mid-level Software Engineer to join a diverse team to create quality solutions for complex problems. We have offices across the United States engaging in the defense, space, cyber and commercial fields, Dynetics provides responsive, cost-effective engineering, scientific and IT solutions. In this role, you will use your skills to design and implement new features, fix bugs, perform peer reviews, write tests, analyze new technologies and best practices, and collaborate with other teammates. You’ll be developing solutions primarily in .NET and C#. The team follows agile software practices, shares a passion for solving complex problems, delivering exceptional software, improving software development processes, and exceeding customer expectations. Basic Qualifications Bachelor's Degree in Computer Science, Computer/Software Engineering, or equivalent technical degree3+ years' experience preferred (can be waived for exceptional candidates)Proficiency with C#, .NET, C++, Java, or other object-oriented programming language is required.Knowledge of data structures and object-oriented design is required.Experience with binary communications protocols used over a network or serial portMust be a resident of the North Alabama area OR willing to relocate to the Huntsville - North Alabama, AL area. Other Qualifications Knowledge and experience with one or more of the following are a plus:Agile software methodologies (e.g., Scrum).NET technologies such as WPFGitUnit testing and continuous integration best practices</li><li>Design patterns Security Requirements Candidate must be a US Citizen and possess (and be able to maintain) a Final Secret Clearance or meet the eligibility to obtain (and maintain) a Secret Clearance.Show more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            ".NET Framework",
            "Secret Clearance",
            "Scrum (Software Development)",
            "Continuous Integration",
            "Object Oriented Programming Language",
            "Object-Oriented Design",
            "Communications Protocols",
            "Security Requirements Analysis",
            "Java (Programming Language)",
            "C# (Programming Language)",
            "Data Structures",
            "Peer Review",
            "Software Engineering",
            "Agile Software Development",
            "Computer Science",
            "Software Development"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-safety-quality-engineer-oasys-inc-JV_KO0,32_KE33,42.htm?jl=1008925639141": {
        "Location": "Alabama",
        "Data": [
            "OASYS, INC., a Leading-Edge Government contractor in Huntsville Alabama, is seeking applicants for several Software Quality Assurance Engineer positions we have open. Job Responsibilities include: The Software Quality Assurance Engineer will develop Software Quality Assurance Surveillance Plans and document quality activities in compliance with Army processes and procedures. The successful candidate will implement a system and software quality program per the Army Quality Standard Operating Procedures and other quality processes and procedures while using ISO 9000-3 as a reference. Will support the Army Materiel Release Process and support software materiel release determinations. Will prepare change requests for the quality processes and implement the changes once approved by the Process Configuration Control Board (PCCB) or the Quality Assurance Division Chief, as appropriate. Will measure and analyze the effectiveness of the process. Minimum Requirements: Minimum of 3 years relevant work software development or software quality assurance experience. Must be able to obtain and maintain a DoD Secret security clearance. Demonstrated knowledge of software development life-cycle. Preferred Skills: Active DoD Secret Clearance. ISO 9001-2008 quality management system certifications. Required Education: A Bachelor's degree in a technical discipline (computer science, electrical engineering, computer engineering, etc.) is desired but NOT required. Years of experience may be substituted for education. Eligibility: Only US citizens are eligible for this position. Candidates must have the ability to obtain and maintain a DoD Secret Clearance and an Active Security Clearance is highly desired. The successful candidate will be subject to a government security investigation. About OASYS, INC.: Located in Huntsville, Alabama, OASYS, INC. is a technology services and products company dedicated to delivering the right solutions to our government and commercial clients. Our innovative solutions combined with today's technology and our subject matter expertise help to provide full lifecycle support for our client's needs. OASYS, INC. offers a robust benefit plan to include BC/BS of Alabama Heath & Dental, VSP Vision, Employee Stock Ownership Plan (ESOP), 401-K with Matching, Flexible Spending Account, Tuition Reimbursement, Holidays, Vacation, Short-term/Long-term Disability. www.oasys-incorporated.com EOE AA M/F/Vet/Disability Equal Employment Opportunity is the Law: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf Resumes may also be mailed to 650 Pratt Avenue NW, Suite C, Huntsville, AL 35801.Show more Report"
        ],
        "Hard Skills": [
            "Configuration Management",
            "Software Quality (SQA/SQC)",
            "Quality Management Systems",
            "ISO 9000 Series",
            "Security Clearance",
            "Secret Clearance",
            "Software Development Life Cycle",
            "Change Requests",
            "Computer Engineering",
            "Computer Science",
            "Electrical Engineering",
            "Software Development",
            "Quality Management"
        ],
        "Soft Skills": [
            "Quality Assurance",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-quality-engineer-genconnect-recruiting-and-consulting-JV_KO0,25_KE26,62.htm?jl=1008864751179": {
        "Location": "Alabama",
        "Data": [
            "Software Quality Engineer position in Huntsville, Alabama. As a Software Quality Engineer, you will help develop, modify, apply, and maintain standards for software quality operating methods, processes, systems and procedures. You will conduct software inspections, support software testing, requirement analysis and assist in verification and validation activities of our software. You will help develop overall operating criteria to ensure implementation of the software quality program according to project, process and contract requirements and objectives. You will ensure that project and process control documentation are compliant with requirements, objectives and/or contract Duties and Responsibilities Review source code and provide technical feedback and solutions alternatives. Participate in reviews and audits. Perform process audits of software development processes to assure compliance to established policies, procedures, work instructions, and program specific plans. Examine the products associated with the preparation and configuration control of software test environments to assess the team’s readiness to enter formal testing. Witness execution of software qualification and system acceptance tests to ensure tests are executed in accordance with approved test procedures, requirements are fully verified, and that all test procedure and software anomalies are documented and tracked to closure. Conduct data analysis, data integration, and data management. Required Qualifications Bachelor's degree and up to 5 years of Software Assurance experience OR a Master of Science Degree with 3 years of experience. Will consider relevant years of experience in lieu of degree. Multi-tasking aptitude Proactive problem solver Proficiency in MS Office (Excel, Word, and PowerPoint) Ability to obtain and maintain a security clearance US Citizen Up to 25% travel Effective written and oral communication skills Experience in computer programming languages such as C/C++ and Java. Strong knowledge of Object-Oriented Design and Programming.  Preferred Qualifications Experience with Agile Development methodologies Experience with JIRA or similar Agile management tools Experience in Linux environments  Core Values Superior ethics, Integrity Organizational skills Professionalism Excellent communication skills Team player Motivated Positive attitude  Company Activities: We take our work environment serious. We have established a Culture Committee to bring the best activities and work collaboration together to engage a diversified team. Health & Fitness: We offer Medical, Dental & Vision coverage; Wellness Resources; Life Insurance Employee Incentives: 401K; Educational Assistance; Casual work environment; Telework; Flex Schedule; Generous PTO; Work-life balance; Upward Mobility; RelocationShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Requirements Analysis",
            "Configuration Management",
            "Software Quality (SQA/SQC)",
            "Process Control",
            "Security Clearance",
            "Agile Methodology",
            "Software Testing",
            "Linux",
            "Data Integration",
            "Object-Oriented Design",
            "JIRA",
            "Java (Programming Language)",
            "Agile Management",
            "Computer Programming",
            "Verification And Validation",
            "Data Management",
            "Software Development",
            "Data Analysis",
            "Apache Flex"
        ],
        "Soft Skills": [
            "Verbal Communication Skills",
            "Professionalism",
            "Positivity",
            "Ethical Standards And Conduct",
            "Multitasking",
            "Organizational Skills",
            "Microsoft Excel",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/performance-assessment-software-engineer-ierus-technologies-inc-JV_KO0,40_KE41,63.htm?jl=1008898147884": {
        "Location": "Alabama",
        "Data": [
            "IERUS specializes in electromagnetic spectrum technologies and design for RF, IR, and optical applications. IERUS also supports customers with a diverse set of competencies including software development, air and missile defense, and systems engineering. IERUS develops value for our defense and commercial customers through accelerations of the technology life cycle: identifying, creating, transitioning, and producing technologies with integrity of purpose and product. IERUS is looking for bright, talented, motivated, and dedicated employees in the engineering field, and offers competitive compensation and benefits package. To learn more, please visit www.ierustech.com Description: This is an opportunity to join the IERUS team as a Software Engineer supporting a large Missile Defense Agency program. The ideal candidate will have a minimum of 3-5 years’ experience and will have experience in relevant DoD interface, assessment and test methodologies and terminologies and Missile Defense Agency (MDA) elements or components. The candidate will be able to make a wide application of principles, theories, and concepts in their field and provide solutions to a wide range of difficult problems with imaginative and thorough solutions; working under general direction; frequently making internal and external customer contacts and representing the organization in providing solutions to difficult technical issues associated with specific projects. Required Qualifications:  B.S., M.S., or Ph.D. in an engineering discipline; Computer Science, Mathematics, Physics, or Engineering and 3+ years experience with advanced degree or 5+ years experience with bachelors or equivalent. Must possess understanding of DoD and missile defense command and control, battle management, architectures and communications system concepts, mission, and common system test and data analysis techniques. Must have experience with software development or tooling automation. Ability to write programs in one or more programming languages, specifically Java and Python. Experience with verification of requirements, System Engineering and iterative product development using Agile practices is a plus. Experience in developing capability assessments, assessment objectives and related assessment plans and procedures. Experience in scripting and automated test development is a plus. Experience with automated metric pipelines and database management. Experience developing visualization tools for communication to stakeholders. Ability to quickly develop new metrics or plug-ins to identify or diagnose issues found in data. Excellent written and verbal communication skills and the ability to work effectively and cooperatively with people within and external to the program.  Location: Huntsville, AL Some Travel Required to program sites and possibly other locations. A final Secret Clearance is required to start. IERUS Technologies is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age, or any other federally protected class. IERUS Technologies participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "System Testing",
            "Systems Engineering",
            "Secret Clearance",
            "Python (Programming Language)",
            "Battle Management Technology",
            "Technology Life Cycle",
            "Communications Systems",
            "Java (Programming Language)",
            "Scripting",
            "Test Automation",
            "Software Engineering",
            "Database Management",
            "Computer Science",
            "Automation",
            "Agile Methodology",
            "Data Analysis",
            "Software Development",
            "Physics"
        ],
        "Soft Skills": [
            "Communications",
            "Mathematics",
            "Verbal Communication Skills"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-test-automation-huntsville-al-davidson-technologies-inc-JV_KO0,47_KE48,73.htm?jl=1008882261583": {
        "Location": "Alabama",
        "Data": [
            "Davidson is seeking a Software Engineer (Test Automation) in Huntsville, AL  The qualified candidate will be an integral part of the advanced engineering scrum team and will focus on creating automated and manual tests for our GBSD team. This role will have a high sense of ownership in the product since it will involve many aspects of software design and validation from inception through release. You will interact directly with other software developers, embedded engineers, and test engineers to develop advanced test and automation to support high level of quality assurance in our products. This will also play a key role as a part time developer with the team facilitating TDD across the team (Test Driven Development). KEY RESPONSIBILITIES:  Own software quality for product Champion testable software architecture Design and execute software test plans for embedded software product Work closely with developers to reproduce and debug issues Develop and perform software unit testing Perform functional system testing at both the software and hardware level Perform regression, black box, sanity and user acceptance testing Automate test processes and generate reports Participate in the development of software applications using the latest technologies  Requirements:  Must have at least a Bachelor’s in Software, Computer, Electrical, or equivalent engineering discipline Must have at least 2 years of professional work experience Ability to participate and collaborate in a scrum team environment Excellent communication and documentation skills Attention to detail and high sense of quality in the product Experience creating and maintaining an automated CI/CD Pipeline Proficiency in writing code in C/C++, Python Basic knowledge of Git version control Experience using Agile SCRUM development process Desired Competencies/Experience/Certifications:  Test Driven Development (TDD) Experience with Jira or similar CRM softwar Familiarity with test equipment (Single board computers) Jenkins Pipeline syntax (or similar tech) Embedded microprocessor development and testing Clearance Requirements: Must have a current Active Secret Security ClearanceShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Design",
            "Software Quality (SQA/SQC)",
            "System Testing",
            "Debugging",
            "Embedded Software",
            "Git (Version Control System)",
            "Scrum (Software Development)",
            "Python (Programming Language)",
            "Software Testing",
            "Software Architecture",
            "JIRA",
            "User Acceptance Testing (UAT)",
            "Jenkins",
            "Test Automation",
            "Testability",
            "Test Equipment",
            "Unit Testing",
            "CI/CD",
            "Software Engineering",
            "Version Control",
            "Automation",
            "Agile Methodology",
            "Software Development",
            "Test-Driven Development (TDD)",
            "Test Engineering",
            "Syntax"
        ],
        "Soft Skills": [
            "Communications",
            "Detail Oriented",
            "Quality Assurance"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-integration-engineer-modern-technology-solutions-inc-JV_KO0,29_KE30,61.htm?jl=1008896843813": {
        "Location": "Alabama",
        "Data": [
            "Own Your Future. Modern Technology Solutions, Inc. (MTSI), is seeking a Software Integration Engineer in Huntsville, AL. Why is MTSI known as a Great Place to Work? Interesting Work: Our co-workers support some of the most important and critical programs to our national defense and security. Values: Our first core value is that employees come first. We challenge our co-workers to provide the highest level of support and service, and reward them with some of the best benefits in the industry. 100% Employee Ownership: we have a stake in each other's success, and the success of our customers. It's also nice to know what's going on across the company; we have company wide town-hall meetings three times a year. Great Benefits - Most Full-Time Staff Are Eligible for: Starting PTO accrual of 20 days PTO/year + 10 holidays/year Flexible schedules 6% 401k match with immediate vesting Semi-annual bonus eligibility (July and December) Company funded Employee Stock Ownership Plan (ESOP) - a separate qualified retirement account Up to $10,000 in annual tuition reimbursement Other company funded benefits, like life and disability insurance Optional zero deductible Blue Cross/Blue Shield health insurance plan Track Record of Success: We have grown every year since our founding in 1993 Modern Technology Solutions, Inc. (MTSI) is a 100% employee-owned engineering services and solutions company that provides high-demand technical expertise in Digital Transformation, Modeling and Simulation, Rapid Capability Development, Test and Evaluation, Artificial Intelligence, Autonomy, Cybersecurity and Mission Assurance. MTSI delivers capabilities to solve problems of global importance. Founded in 1993, MTSI today has employees at over 20 offices and field sites worldwide. For more information about MTSI, please visit www.mtsi-va.com. Responsibilities: Position Overview: This individual will be part of a team that works directly with Army Aviation and Missile Center (AvMC) and Missile Defense Agency (MDA) Government customers on the C2BMC Distributed Training System (DTS Sim/Stim) conducting development, integration, fielding, and sustainment. The DTS Sim/Stim is a system of systems consisting of distributed training and exercise frameworks as well as weapons systems and sensor modeling applications. The DTS Sim/Stim is the primary driver that provides the stimulus needed to enable Warfighters to train on their operational Missile Defense systems at their warfighting location. Primary responsibility is the integration & interoperability of the Distributed Missile Defense System (MDS) framework, weapons and sensor models, and Hardware in the Loop (HWIL) provided by the various element program offices into the DTS Sim/Stim product. The Systems Integrator is responsible for coordinating the development and interoperability of the C2BMC Distributed Training System. Responsible for maintaining, installing and planning the current and future iterations of the DTS Sim/Stim equipment. Responsibilities require involvement in the planning and coordination of software updates among Missile Defense Agency (MDA) and other organizations to facilitate seamless integration of evolving components within the product suite. Tasks include loading, configuration, maintenance, and troubleshooting the various Modeling & Simulation components within the DTS Sim/Stim environment. Integration efforts will include the analysis and troubleshooting of various tactical messaging protocols such as TADIL-J/Link16, VMF, B-Series, BXS/XML, and ADIP formats. Knowledge of networks, protocols, and RHEL commands will be required in the troubleshooting of various interfaces within and external to the DTS Sim/Stim Product Suite. Qualifications: Required Qualifications: Bachelor’s degree plus six years of experience. Experience may be used in lieu of a degree Active DoD Secret Security Clearance Proficient in operating on Linux based systems Security+ certification or the ability to obtain Security+ certification with 60 days of hire Linux+ certification or have the ability to obtain Linux+ or comparable Operating System certificate within 60 days of hire Aptitude for rapidly learning new concepts and the ability to adapt to a fast-paced environment Must be able to support 10% annual travel worldwide in support of DTS planning, fielding, and system support Knowledge of network protocols and network connectivity troubleshooting Excellent communication, presentation, and written skills Desired Qualifications Knowledge and experience working with the Missile Defense System Experience with MDS truth frameworks and or model simulations such as SSF, OSF, OSM, EADSIM, JSAF, MDST, FOXSIM, BOA, C2BMX, and GFC Experience tactical message protocols (TADIL-J/Link16, VMF, B-Series, BXS/XML, etc.) Experience in providing briefings and/or demonstrations on system capabilities and architectures. Familiarity with DIS, TCP, UDP, and Multicast Please Note: U.S. Citizenship is required for most MTSI positions. #LI-KC1Show more Report"
        ],
        "Hard Skills": [
            "Network Troubleshooting",
            "Operating Systems",
            "Gel Filtration Chromatography",
            "Digital Transformation",
            "System Support",
            "Multicasting",
            "CompTIA Security+",
            "Extensible Markup Language (XML)",
            "Secret Clearance",
            "Network Protocols",
            "Linux",
            "CompTIA Linux+",
            "Red Hat Enterprise Linux",
            "Capability Development",
            "Interoperability",
            "Link 16",
            "Distributed Temperature Sensing (DTS)",
            "Cyber Security",
            "Technology Solutions",
            "Artificial Intelligence",
            "Transmission Control Protocol (TCP)",
            "Systems Integration",
            "Simulations",
            "Demonstration Skills"
        ],
        "Soft Skills": [
            "Planning",
            "Communications",
            "Presentations",
            "Coordinating",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/uas-software-engineer-peopletec-inc-JV_KO0,21_KE22,35.htm?jl=1008933685830": {
        "Location": "Alabama",
        "Data": [
            "Responsibilities: PeopleTec seeks a UAS Software Engineer is responsible for providing technical expertise in the development and qualification of software for uncrewed aircraft systems. Provides Subject Matter Expertise on software architecture and development standards such as FACE and DO-178. Familiar with Cybersecurity requirements for software systems. Able to evaluate and resolve software issues with fielded systems. Supports the specification, qualification, and airworthiness determination of integrated software subsystems. Effectively communicates with TUAS personnel, PM UAS and PEO functionals and staff, prime contractors and suppliers, user representatives, and Army airworthiness personnel. Supports the evaluation of cost, schedule, and performance of non-recurring engineering projects. Prepares and delivers reports and briefings to senior management describing program status, issues, analyses, findings, results, recommendations, and conclusions as appropriate.  Qualifications:  Bachelor's degree in electrical engineering, Electronics Engineering or Computer Engineering from a college program with ABET (Accreditation Board for Engineering and Technology, Inc.) certification. +4 years experience with a willingness to learn new processes. Experience with software development, performing software requirements analysis, software design, software coding, software integration and software testing in a corporate or governmental Software Development Environment. Program Management Office experience desired. Knowledge of software engineering design, development and management principles Knowledge of computer hardware design, development and management principles Knowledge and experience in agile software development and DevSecOps Knowledge and experience in Model Based Systems Engineering Knowledge of program management techniques (Cost, Schedule, and Performance) Knowledge of the acquisition process including development, test and evaluation, contracting, production, and fielding Excellent organizational and communication skills, as well as the ability to work in a highly collaborative environment Professional experience using Microsoft Office applications to include Excel, Outlook, PowerPoint, Project, and Word Candidate must possess strong oral and written communication skills Must be a self-starter that thrives in a dynamic team environment Candidate must possess a proven ability to develop and provide reports to management US Citizenship is required Active DoD Secret security clearance and the ability to maintain such is required  Overview:  People First. Technology Always. PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce. Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields. Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people. Come Experience It. #cjpost #dpost EEO Statement PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, applicationhelp@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Software Systems",
            "Model Based Systems Engineering",
            "Development Testing",
            "DevSecOps",
            "Electronic Engineering",
            "Software Requirements Analysis",
            "Agile Software Development",
            "Secret Clearance",
            "Software Testing",
            "DO-178B/C (Software Considerations in Airborne Systems and Equipment Certification)",
            "Integrated Development Environments",
            "Acquisition Processes",
            "Customer Support",
            "Software Coding",
            "Software Architecture",
            "Software Engineering",
            "Cyber Security",
            "Project Management Office (PMO)",
            "Software Development",
            "Airworthiness",
            "Computer Engineering",
            "Electrical Engineering",
            "Systems Integration",
            "Unmanned Aerial Systems (UAS)",
            "Computer Hardware"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Writing",
            "Willingness To Learn",
            "Microsoft Office",
            "Program Management",
            "Management",
            "Microsoft PowerPoint",
            "Microsoft Excel",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/2023-software-engineer-for-artificial-intelligence-applications-1st-edge-JV_KO0,63_KE64,72.htm?jl=1008931550819": {
        "Location": "Alabama",
        "Data": [
            "Company Description 1st Edge is a growing business seeking top performers to join in our mission of developing Artificial Intelligence solutions for our Government customers. We offer technically advanced, challenging work in an employee-centered environment driven by the desire to contribute to a meaningful purpose. Our employees work closely with Space and Missile Defense Command (SMDC), Missile Defense Agency (MDA), and Combat Capabilities Development Command (CCDC). We believe in a balanced, quid pro quo relationship between the company and its employees, providing all benefits at no cost plus generous time off. This balanced culture allows employees to do their best work and contributes to our extraordinary success rate. From an excellent benefits package to job autonomy with challenging work, 1st Edge cultivates an innovative and collaborative environment with meaningful work.  Job Description Based on the requirements of our government contracts, you must be a U.S. Citizen and have or be able to obtain a secret security clearance. This position is on-site, located in Huntsville, AL. Responsibilities include, but are not limited to the following tasks: Agile software development in small, fast-paced groups Development duties include full software life-cycle tasks: requirements analysis, design, development, testing, and integration Conduct machine learning model training for teammates and/or customers  Qualifications Essential job skills include: Strong knowledge and experience with artificial intelligence concepts and development methods Strong communication skills Knowledge of data science development and parsing techniques Proven experience with SW development tools – git, Visual Studio Code, Azure DevOps or similar, Docker SW languages – Python 3+ and/or an OOP language such as C# SW development methods – Scrum, CI/CD Strong interpersonal skills and attention to detail Work independently with minimal supervision Desired skills: Experience developing knowledge based systems, genetic algorithms, or other AI solutions SW frameworks – Torch/PyTorch, Tensorflow, Pandas, OpenCV General Requirements: 5-15 years of related experience Ability to obtain and maintain a security clearance US Citizenship required Education Requirements: Bachelor’s Degree in Computer Science, Computer Engineering or Software Engineering Additional Information All your information will be kept confidential according to EEO guidelines. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law. However, please note, based on the requirements of our Government contracts, you must be a U.S. citizen to apply for this position.Show more Report"
        ],
        "Hard Skills": [
            "Azure DevOps",
            "Knowledge-Based Systems",
            "Agile Software Development",
            "Microsoft Visual Studio",
            "Security Clearance",
            "Secret Clearance",
            "Data Science",
            "Genetic Algorithm",
            "Docker (Software)",
            "Git (Version Control System)",
            "Machine Learning Model Training",
            "Scrum (Software Development)",
            "Development Testing",
            "Python (Programming Language)",
            "Parsing",
            "Torch (Machine Learning)",
            "Software Engineering",
            "Requirements Analysis",
            "C# (Programming Language)",
            "PyTorch (Machine Learning Library)",
            "OpenCV",
            "Artificial Intelligence",
            "CI/CD",
            "Computer Engineering",
            "Object-Oriented Programming (OOP)",
            "Computer Science",
            "Programming Tools",
            "TensorFlow",
            "Pandas (Python Package)"
        ],
        "Soft Skills": [
            "Interpersonal Communications",
            "Detail Oriented",
            "Innovation",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-test-engineer-parry-labs-JV_KO0,22_KE23,33.htm?jl=1008936101168": {
        "Location": "Alabama",
        "Data": [
            "Who Are We?  At Parry Labs, we’re redefining the edge where new capability meets mission-proven certainty. We deliver digital combat power with open software architecture, small-form factor hardware and engineering to keep pace with the speed of modern warfare and enable a decisive combat advantage for the defense community. We make the networked connectivity of every asset, from warfighters to weapon systems, the dominant force in a digital battlespace, all in a day’s work. Join us in the innovation of integration at Parry. About The Role  This position is for a Software Test Engineer who is part of a cross functional team working in an Agile environment performing Model Based Systems Engineering (MBSE) in developing next generation Unmanned Air Systems (UAS) Ground Control Stations (GCS). This includes integrating new software and payloads into existing the DoD UAS fleet. Duties & Responsibilities:  While working in a cross functional team in an Agile Development environment, will perform test engineering tasks including but not limited to: Set up, maintain, extend, and use test automation frameworks and tools. Create and execute test cases based on project documents, client demands and project objectives. Manage requirements and ensure traceability to test cases. Manage traceability between test cases and bugs. Testing new software in a lab environment while providing feedback to software developers. Develop Test Plans, Procedures, and Reports. Participate in design reviews with customers. Researching test tools, methodologies, trends and upgrading existing practices and processes. Complete component, regression, and validation/verification testing on software and hardware components. Provide knowledge and expertise during customer test events. Other duties as assigned.   Required Qualifications:  Bachelor’s Degree in computer science, computer engineering or a related field. Will consider years of related experience in lieu of degree.  4+ years of related experience. Excellent coding skills with knowledge in C/C++ and Java. Strong knowledge of Object-Oriented Design and Programming. Understand test automation and implementation. Experience in both Linux and Window test environments. Understand and debug TCP and UDP packet traffic. Passion for testing, quality, development, and design. Multi-tasking aptitude. Proactive problem solver. Capable of troubleshooting multi-platform systems. Proficiency in MS Office (Excel, Word, and PowerPoint).  Up to 25% travel.   Preferred Qualifications:  Experience with Continuous Build and Deploy Processes. Experience working in an Agile Development environment. Experience supporting requirement to test traceability. Experience with Jira or similar Agile Development tools. Knowledge of hardware/software testing methodologies.   Why Join Parry Labs?  At Parry Labs, we foster a culture of curiosity, collaboration, and diversity. Employees are given the autonomy to leverage their skills in creating state-of-the-art tech solutions that aid in the protection of the American Warfighter. We encourage new and bold ideas that push the status quo. It is this entrepreneurial spirit that drives us.   Parry Labs will support you with workplace flexibility, a commitment to the health and well-being of you and your family and provide opportunities to work with a purpose. We are committed to supporting your success in both your professional and personal lives with benefits such as education assistance and unlimited paid time off, just to name a few.   No One Has Time for Long Job Applications!  We completely understand, that is why we have made the application process easy. We promise. This will be simple. Accessibility/Accommodation:  If because of a medical condition or disability you need a reasonable accommodation for any part of the employment process, please send an e-mail to HR@parrylabs.com or call (256) 682-7145 to let us know the nature of your request and contact information.   Parry Labs is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Reasonable Accommodation Notice  Federal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. We can be reached at hr@parrylabs.com. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.   i) Section 503 of the Rehabilitation Act of 1973, as amended. For more information about this form or the equal employment obligations of Federal contractors, visit the U.S. Department of Labor’s Office of Federal Contract Compliance Programs (OFCCP) website at gov/ofccp.   Equal Opportunity/Affirmative Action Employer:  Parry Labs is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.   When applying to this job, you will be asked questions in reference to the following:   Voluntary Self-Identification of Disability  We are a federal contractor or subcontractor. The law requires us to provide equal employment opportunity to qualified people with disabilities. We have a goal of having at least 7% of our workers as people with disabilities. The law says we must measure our progress towards this goal. To do this, we must ask applicants and employees if they have a disability or have ever had one. People can become disabled, so we need to ask this question at least every five years.   Completing this form is voluntary, and we hope that you will choose to do so. Your answer is confidential. No one who makes hiring decisions will see it. Your decision to complete the form and your answer will not harm you in any way. If you want to learn more about the law or this form, visit the U.S. Department of Labor’s Office of Federal Contract Compliance Programs (OFCCP) website at www.dol.gov/ofccp.  How do you know if you have a disability?  A disability is a condition that substantially limits one or more of your “major life activities.” If you have or have ever had such a condition, you are a person with a disability. Disabilities include, but are not limited to:  Alcohol or other substance use disorder (not currently using drugs illegally) Autoimmune disorder, for example, lupus, fibromyalgia, rheumatoid arthritis, HIV/AIDS Blind or low vision Cancer (past or present) Cardiovascular or heart disease Celiac disease Cerebral palsy Deaf or serious difficulty hearing Diabetes Disfigurement, for example, disfigurement caused by burns, wounds, accidents, or congenital disorders Epilepsy or other seizure disorder Gastrointestinal disorders, for example, Crohn's Disease, irritable bowel syndrome Intellectual or developmental disability Mental health conditions, for example, depression, bipolar disorder, anxiety disorder, schizophrenia, PTSD Missing limbs or partially missing limbs Mobility impairment, benefiting from the use of a wheelchair, scooter, walker, leg brace(s) and/or other supports Nervous system condition, for example, migraine headaches, Parkinson’s disease, multiple sclerosis (MS) Neurodivergence, for example, attention-deficit/hyperactivity disorder (ADHD), autism spectrum disorder, dyslexia, dyspraxia, other learning disabilities Partial or complete paralysis (any cause) Pulmonary or respiratory conditions, for example, tuberculosis, asthma, emphysema Short stature (dwarfism) Traumatic brain injury  PUBLIC BURDEN STATEMENT: According to the Paperwork Reduction Act of 1995 no persons are required to respond to a collection of information unless such collection displays a valid OMB control number. This survey should take about 5 minutes to complete  Form CC-305 OMB Control Number 1250-0005 Expires 04/30/2026Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Diabetes Mellitus",
            "Model Based Systems Engineering",
            "Parkinson's Disease",
            "Agile Methodology",
            "Rheumatoid Arthritis",
            "Anxiety Disorder",
            "Debugging",
            "Software Testing",
            "Celiac Disease",
            "Hearing Disorders",
            "Cancer",
            "Linux",
            "Software Architecture",
            "Contract Compliance",
            "Mental Health",
            "Congenital Defects",
            "Object-Oriented Design",
            "JIRA",
            "Test Tools",
            "Java (Programming Language)",
            "Disabilities",
            "Seizure Disorders",
            "Post Traumatic Stress Disorder",
            "Traumatic Brain Injuries",
            "Multiple Sclerosis",
            "Bipolar Disorder",
            "Schizophrenia",
            "Asthma",
            "Test Automation",
            "Autism Spectrum Disorders",
            "Attention Deficit Hyperactivity Disorder (ADHD)",
            "Sign Language Interpretation",
            "Irritable Bowel Syndrome",
            "Learning Disabilities",
            "Dyslexia",
            "Computer Engineering",
            "Migraine",
            "Computer Science",
            "Transmission Control Protocol (TCP)",
            "Test Planning",
            "Rehabilitation",
            "Traceability",
            "Unmanned Aerial Systems (UAS)",
            "Tuberculosis Management",
            "Test Engineering",
            "Software Development",
            "Developmental Coordination Disorder",
            "Subcontracting"
        ],
        "Soft Skills": [
            "Curiosity",
            "Decisiveness",
            "Teamwork",
            "Multitasking",
            "Microsoft Excel",
            "Innovation",
            "Problem Solving"
        ]
    },
    "https://www.glassdoor.com/job-listing/sr-software-engineer-jacobs-JV_KO0,20_KE21,27.htm?jl=1008896683760": {
        "Location": "Alabama",
        "Data": [
            "Challenging Today. Reinventing Tomorrow.  We're invested in you and your success. Everything we do is more than just a project. It's our challenge as human beings, too. That's why we bring a thoughtful and collaborative approach to every one of our partnerships.  At Jacobs, we challenge the status quo and redefine how to solve the world's greatest challenges, transforming big ideas into intelligent solutions for a more connected, sustainable world.  Design your career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow   Your Impact: The Jacobs Space Exploration Group (JSEG) a primary contractor for NASA since 1989 is comprised of 10 companies and is located at Marshall Space Flight Center in Huntsville, AL (ranked #1 in Best Places to Live by U.S. News). Create Your Career: Grow With Us Your growth matters to us—that’s why we offer a variety of ways for you to develop your career. With professional and leadership development opportunities like Team Lead Academy, education reimbursement, mentoring, and company sponsored networking events, you can take control of your own career path on your own terms with a company that believes in you. A Place Where You Belong At Jacobs Space Exploration Group, people are at the heart of our business. We reflect a diversity of cultures, backgrounds, and experiences. We expect our people, clients, and partners to treat one another with dignity and respect. This means promoting inclusion, celebrating diversity, and appreciating the differences we all bring to our workplace. Support Your Well-Being Our comprehensive benefits package includes wellness programs, 11 paid holidays, parental leave, paid time off, employee perks and much more. With these benefits, plus the option for flexible schedules and possible remote a few days a week (depending on customer requirements) we’ll support you as you pursue a balanced, fulfilling life—at work and at home. Responsibilities: The Jacobs Space Exploration Group (JSEG) is seeking an energetic individual to support the software design of the Space Launch System Core Stage Flight Control Computers at Marshall Space Flight Center. The ideal candidate will be a part of the Science and Technology team working with C/C++ programming language on the SLS Project supporting the Artemis launch vehicle. The candidate should have excellent verbal and written communication skills, as they will be responsible for collaborating with cross-functional teams and documenting software requirements and design. If you have a passion for space, NASA, and cutting-edge technology, come join our team! Here’s What You’ll Need: Qualifications: A bachelor’s degree or higher in computer science, software engineering, electrical engineering or related field is required. Degree from an ABET-accredited university is preferred. BS degree with over 20 years of experience working in software development environments is highly desired. Typically, educational requirements are the equivalent of a Ph.D., with a minimum 14 years of experience, Masters with at least 18 years of experience, or BS with at least 20 years of experience. Candidate must possess and maintain a valid driver's license, automobile liability insurance and successfully complete a company defensive driving training class. The candidate should be proactive, detail-oriented, and able to work independently and as part of a team in a fast-paced, dynamic environment. Technical experience with and proficient in: Designing, developing, and testing real-time embedded spaceflight software and testing software in compliance of organizational/project coding standards Strong software development skills in various languages (including C++, C, python). Object Oriented Design and Implementation VxWorks and other real-time operating systems Atlassian tools suite (i.e. Jira, etc.). Configuration Management Tools (i.e. GitHub). Continuous Integration Practices. Agile methodologies and processes. Software/Hardware integration, debugging and troubleshooting. MIL-STD 1553 communication protocol interface as well as other various communication protocol interfaces such as ethernet, RS422, etc. UML Modeling. Working with a software development team in an Agile Development Environment. Ability to work proactively, independently, and within a diverse team. Ability to communicate professionally with customers, stakeholders, and cross-organizational team members; possess good communication skills. Desirable experience would include: Executing the ARTEMIS/MAESTRO simulation environment Development of fault scripts Integrating new ARTEMIS/MAESTRO versions with FSW including debugging/troubleshooting The Jacobs Space Exploration Group (JSEG) offers a partnership in which you can grow personally and professionally within a framework of strong leadership, competitive compensation, and rewarding career paths. Come join our team on the Engineering Services and Science Capability Augmentation (ESSCA) contract whose work is destined to have a long-range effect on future generations! For more information on why Huntsville is known as “one of the smartest cities in the nation”, check out these websites: https://hsvchamber.org/ www.Huntsville.org/ https://www.movoto.com/guide/huntsville-al/moving-to-huntsville/ https://realestate.usnews.com/places/alabama/huntsville https://iveyhsv.com/real-estate-blog/13-reasons-why-you-should-move-to-huntsville/ Essential Functions Work Environment: Office environment. Requires ability to provide clear, concise, accurate and timely communication, both verbally and in writing (100%). Requires ability to interact professionally with co-workers, management, and client (100%). Requires travel in the domestic USA (<10%). Physical Requirements: Requires sitting for extended periods of time in meetings with peers, management, and with our client at NASA facilities to discuss technical issues (10%). Also, requires sitting for extended periods of time at a desk to write reports and perform engineering tasks (80%). Requires ability to use stairs or elevators for access between floors and multiple buildings at NASA and Jacobs facilities (10%). Equipment and Machines: Requires ability to operate a personal computer, a telephone, fax machine, copier, calculator, and other general office equipment (100%). Attendance: Normal workday 7:30 – 4:30, Monday thru Friday. Minimal overtime may be required (10%) to meet schedule milestones and to support technical demands of the job. Regular attendance is a necessity, and adequate arrangements for delegating duties during absences are required. Other Essential Functions: The ability to work independently with minimal supervision, and to make rational decisions, and to exercise good judgment is essential (100%). Grooming and dress must be appropriate for the position and must not impose a safety risk/hazard to the employee or others. Proof of U.S. Citizenship is required. #ESSCAShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Debugging",
            "Software Design",
            "Office Equipment",
            "Github",
            "Agile Methodology",
            "Space Flight",
            "RS-422",
            "Python (Programming Language)",
            "Valid Driver's License",
            "Continuous Integration",
            "Object-Oriented Design",
            "Communications Protocols",
            "JIRA",
            "Real-Time Operating Systems",
            "Launch Vehicle Systems",
            "Software Engineering",
            "Military Standards And Specifications",
            "Unified Modeling Language",
            "Space Exploration",
            "Configuration Management",
            "VxWorks",
            "Computer Science",
            "Software Development",
            "Electrical Engineering",
            "Milestones (Project Management)"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Leadership Development",
            "Communications",
            "Calculators",
            "Professionalism",
            "Teamwork",
            "Energetic",
            "Writing",
            "Report Writing",
            "Mentorship",
            "Management",
            "Leadership",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/ireturn-software-principal-software-engineer-career-break-of-at-least-2-years-northrop-grumman-JV_KO0,77_KE78,94.htm?jl=1008897946309": {
        "Location": "Alabama",
        "Data": [
            "Requisition ID: R10132162 Category: Engineering Location: Huntsville, Alabama, United States of America Citizenship required: United States Citizenship Clearance Type: Interim Secret Telecommute: No- Teleworking not available for this position Shift: 1st Shift (United States of America) Travel Required: No Positions Available: 2 At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history. The Northrop Grumman iReturn program provides experienced professionals with internal support, mentors, and connections with other iReturn employees to transition back to a full-time career in one of several fields at Northrop Grumman through training, professional development, and networking opportunities. The iReturn program focuses on providing a seamless transition back into the workforce. At Northrop Grumman, we understand that sometimes we must pause our professional lives to support our family and loved ones. After taking a career break to care for children, aging parents or other family obligations, the road to return to work can be intimidating. iReturn can be the steppingstone in returning to your career. We’re seeking applicants with prior work experience in the outlined discipline who have a recent career break of at least 2 years. Learn more about the iReturn program here. NGiReturn Basic Qualifications: Career Break of at least two (2) years. Software Engineer: Bachelor's degree in STEM and 2+ years of relevant experience, or 4 additional years of experience in lieu of degree Principal Software Engineer: Bachelor's degree in STEM and 5+ years of relevant experience, or 4 additional years of experience in lieu of degree Experience with JAVA (work experience), OR the willingness to learn JAVA Familiarity with C++, Python Experience with collaborating in or using source code control environment (such as GitHub) Understanding of all phases of software development, and practical experience in an Agile / Dev*Ops environment Ability to obtain Secret Clearance Desired Qualifications: Security+ certification Experience testing SW for performance and functionality based on requirement specification and ability to identify and document exact sequence of activities desired Experience with automated testing Experience developing Eggplant software or Squish/ Froglogic. OpenGL and Front end experience OSGi services experience Experience in Air & Missile Defense Command and Control programs such as PATRIOT, SENTINEL, C2BMC or THAAD or any sensor/weapon system, Link 16 experience Salary Range: $77,200 - $105,000 Employees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business. Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit http://www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions.Show more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "Source Code Control Systems",
            "CompTIA Security+",
            "Github",
            "Link 16",
            "Secret Clearance",
            "Agile Methodology",
            "Test Automation",
            "Python (Programming Language)",
            "Froglogic Squish",
            "Java (Programming Language)",
            "OpenGL",
            "Software Engineering",
            "Front End (Software Engineering)",
            "Software Development"
        ],
        "Soft Skills": [
            "Courage",
            "Intellectual Curiosity",
            "Willingness To Learn"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-2-contract-boeing-JV_KO0,28_KE29,35.htm?jl=1008843490912": {
        "Location": "Alabama",
        "Data": [
            "Assists with the development, documentation and maintenance of architectures, requirements, algorithms, interfaces and designs for software systems. Develops and maintains code and integrates software components into a fully functional software system. Assists with test procedures and documenting test results to ensure software system requirements are met. Supports software project management and software supplier management functions.  Selects, tailors and deploys processes and tools; establishes metrics. Performs software research and trade studies. Troubleshoots software issues. Works under general supervision.Show more Report"
        ],
        "Hard Skills": [
            "Software Project Management",
            "Software Systems",
            "Algorithms",
            "Supplier Management"
        ],
        "Soft Skills": [
            "Research"
        ]
    },
    "https://www.glassdoor.com/job-listing/junior-aviation-systems-embedded-software-engineer-dynetics-JV_KO0,50_KE51,59.htm?jl=1008891408262": {
        "Location": "Alabama",
        "Data": [
            "Are you a Software/Computer Engineer with an interest in aviation systems software development, do you possess varied technical interests and able to demonstrate your engineering skills? Perhaps you’re a self-starter who’s ready to experience working on inter-disciplinary teams to solve challenging technical problems, as well as looking for an opportunity to be in a fast-paced small team environment through all phases of the product life cycle from conceptual development to post-delivery support? If so, the Aviation Software team is interested in YOU! Leidos, Dynetics Group is seeking a talented Junior Aviation Systems Embedded Software Engineer to join a multi-discipline engineering team developing software for aviation systems. We have offices across the United States engaging in the defense, space, cyber, and commercial fields, we provide responsive, cost-effective engineering, scientific, and IT solutions. Dynetics is well known for our people-oriented culture, positive work environment, technical excellence, and resilient business ethics. As a member of the team, you will work closely with electronics integrated into a diverse range of aerospace and military systems including manned/unmanned ground/air vehicles, missiles, defensive radars, and space systems. You’ll be responsible for developing robust software solutions. Your primary job function will include implementing and testing embedded software solutions targeting microprocessors, SoCs, and FPGAs. You’ll support resolution of technical issues discovered during the development, integration, and test of deliverable products. You’ll have the opportunity to join forces and partner with other engineers and developers, project managers, technicians, and the customer to develop solutions adhering to a diverse set of requirements. You'll be mentored by Senior Software Engineers on your team. Become a part of a team where you'll know that the systems we develop, and support are keeping deployed warfighters safe on the battlefield as well as aiding in the defense of our nation from foreign adversaries. Basic Qualifications Must possess or be pursuing a bachelor’s or master’s degree in Software Engineering, Computer Science, Computer Engineering, Electrical Engineering, Aerospace Engineering, or Mathematics from an ABET Accredited University. Demonstrate competency in software development in the C and C++ programming languages. Hands-on lab experience with instrumentation, test equipment, and debug/test methods for software and hardware. Capable of performing in a collaborative engineering environment working closely with multi-disciplinary teams. Have a passion for good object-oriented software design techniques. Willingness to participate in and contribute to software design and code reviews. Candidate must be a resident of or be willing to relocate to the Huntsville, AL area. Candidate must be a U.S. Citizen.  Other Qualifications Working knowledge and/or experience in the following: The Linux operating system. Microprocessor architectures such as ARM Cortex, PowerPC, and x86. Embedded operating systems such as VxWorks, Integrity, and FreeRTOS. Python programming. Software versioning and release cycles. Agile processes such as SCRUM. Communication protocols such as UART, Ethernet, SPI, I2C, and CAN. Security Requirements Candidate must be a US Citizen and possess (and be able to maintain) a Final Secret Clearance or meet the eligibility to obtain (and maintain) a Secret ClearanceShow more Report"
        ],
        "Hard Skills": [
            "Software Versioning",
            "Software Design",
            "Embedded Operating Systems",
            "Object-Oriented Programming (OOP)",
            "Code Review",
            "C++ (Programming Language)",
            "Powerpc",
            "Electrical Engineering",
            "Aerospace Engineering",
            "Debugging",
            "Computer Engineering",
            "Embedded Software",
            "Software Engineering",
            "Project Management",
            "X86 Architecture",
            "Secret Clearance",
            "Scrum (Software Development)",
            "Laboratory Experience",
            "FreeRTOS",
            "Communications Protocols",
            "Security Requirements Analysis",
            "Product Lifecycle Management",
            "Agile Methodology",
            "Test Equipment",
            "Serial Peripheral Interface",
            "VxWorks",
            "Linux",
            "Python (Programming Language)",
            "Computer Science",
            "Universal Asynchronous Receiver/Transmitter",
            "ARM Architecture",
            "Software Development",
            "C (Programming Language)",
            "Field-Programmable Gate Array (FPGA)",
            "Electronics",
            "Microprocessor"
        ],
        "Soft Skills": [
            "Business Ethics",
            "Self-Motivation",
            "Mathematics",
            "Resilience"
        ]
    },
    "https://www.glassdoor.com/job-listing/web-developer-multimedia-specialist-auburn-university-JV_KO0,35_KE36,53.htm?jl=1008943449395": {
        "Location": "Alabama",
        "Data": [
            "Position Details Position Information Requisition Number S3142P  Home Org Name SA Communications  Division Name Student Affairs  Position Title Web Developer/Multimedia Specialist  Job Class Code OC01A,B,C  Appointment Status Full-time  Part-time FTE  Limited Term No  Limited Term Length  Job Summary The Division of Student Affairs is seeking a Web Developer/Multimedia Specialist to design, develop and maintain web content and electronic news distributions. Under the supervision of the Director of Communications and Marketing, the Web Developer/Multimedia Specialist assists with developing and defining system scope and project objectives based on client needs and preferences. The Web Developer/Multimedia Specialist is responsible for program design, coding, testing, debugging and documentation.  Why Should YOU Choose Auburn University? Auburn University was named a “Best in Alabama” employer by Forbes! Our employee longevity speaks for itself, with employees staying an average of ten years. Competitive state benefits including retirement plan vesting at 10 years of service, generous leave accrual, and parental leave opportunity. Auburn University tuition assistance for yourself and your dependents. Employees can take 15 hours of classes for free, and dependents receive a 50% tuition waiver.   It’s a Lifestyle: The Auburn/Opelika area is a page right out of Southern Living magazine with an idyllic small-town feel, perfecting a unique balance between a close-knit community and driving consistent growth and development. Paralleling the exponential growth of Auburn University, the Auburn/Opelika area boasts services and amenities that cater to any interest. We’re proud of our top school systems, city services, award-winning restaurants, and the infectious spirit of life in a college town. You can find us nestled halfway between the beach and the mountains in a lower-cost-of-living area, two hours outside of Atlanta or Birmingham. If you’re new to Auburn, we’d love to introduce you. If you’re already acquainted with Auburn, we’ll keep it simple: it’s time to come home!  Our Commitment: Auburn University is committed to a diverse and inclusive campus environment. Visit auburn.edu/inclusion to learn more about our commitment to expanding equity and inclusion for all.  Essential Functions Oversees the organization, design and functionality of multiple websites for departments, programs and initiatives within Student Affairs. Reviews, modifies and writes program code and comprehensive application systems to support web projects. Provides technical oversight and coordination for coding following best practices for associated programming languages, applications and/or systems. Provides technical oversight to the application of and compliance with technical standards such as code reviews, unit testing, and security reviews. Collaborates with all Student Affairs departments and web users to understand and meet the information needs of all stakeholder groups to advance the coordination, communication and implementation of web projects, policies and procedures. Conducts quality assurance reviews to ensure that programs, applications, and systems meet business and technical requirements. Ensures all web content meets accessibility standards.   Minimum Qualifications Minimum Qualifications Degree or emphasis in Digital Design, Graphic Design, Computer Science, Communication or related field  Level I- Bachelor’s degree  Level II- Bachelor’s degree plus 2 years of experience in multimedia technologies  Level III- Bachelor’s degree plus 4 years of experience in multimedia technologies  Substitutions allowed for Education: 8 years of experience in multimedia technologies accepted in lieu of education requirement   Substitutions allowed for Experience: Graduate degrees accepted in lieu of experience for advanced levels, at a rate of one year relevant education per year of required experience.  Minimum Skills, License, and Certifications Minimum Skills and Abilities Proficient in Cascade, Dreamweaver and WordPress. Strong knowledge of programming languages, including JavaScript and CSS. Any knowledge of AzureReact is considered but not required. Knowledge of software development lifecycle processes and database designs. Knowledge of troubleshooting, client relations and formulating and contributing ideas. Knowledge of word processing and spreadsheet applications. Ability to explain technical information to a non-technical audience. Ability to multitask and work cooperatively with others.   Minimum Technology Skills  Minimum License and Certifications  Desired Qualifications Desired Qualifications Experience in multimedia technologies   Posting Detail Information Salary Range $41,600-$81,000  Job Category Communications/Public Relations/Marketing  Working Hours if Non-Traditional  City position is located in: Auburn  State position is located: AL  List any hazardous conditions or physical demands required by this position  Posting Date 10/24/2023  Closing Date 11/04/2023  EEO Statement Auburn University is committed to an inclusive and diverse campus environment. Women, underrepresented groups, individuals with disabilities and veterans are encouraged to apply.  AUBURN UNIVERSITY IS AN AFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER. It is our policy to provide equal employment opportunities for all individuals without regard to race, sex, religion, color, national origin, age, disability, protected veteran status, genetic information, sexual orientation, gender identity, or any other classification protected by applicable law.Show more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Code Review",
            "Graphic Design",
            "Marketing",
            "Technical Standard",
            "Organizational Architecture",
            "Student Services",
            "Unit Testing",
            "JavaScript (Programming Language)",
            "Digital Design",
            "Computer Science",
            "Software Development Life Cycle",
            "Public Relations",
            "Multimedia",
            "C (Programming Language)",
            "Adobe Dreamweaver"
        ],
        "Soft Skills": [
            "Communications",
            "Multitasking",
            "Quality Assurance",
            "Spreadsheets",
            "Word Processing"
        ]
    },
    "https://www.glassdoor.com/job-listing/entry-level-software-engineer-4m-research-inc-JV_KO0,29_KE30,45.htm?jl=1008895295926": {
        "Location": "Alabama",
        "Data": [
            "Are you looking for a career with a company known for it's culture and investment in its people? Are you looking for an amazing retirement program, best in class health insurance and a robust benefits package? Are you looking to work in an environment where you feel appreciated and part of a work family? If so, 4M Research is the employer for you! 4M Research, Inc. (4M) is a Woman owned small business established in 2007 and headquartered in Huntsville, AL. 4M specializes in Systems and Software Engineering and Analysis, Information Technology, Planning and Analysis, and Field Support Services to a variety of customers including MDA, NASA, and AMCOM. Our continuous and rapid growth is attributable to the caliber of employees 4M strives to hire and retain. We are currently seeking an Entry Level Software Engineer for our team in Huntsville, AL. Required Qualifications: ABET accredited BS in STEM or related technical field Background/ Education in software development Ability to obtain and maintain a Secret Security Clearance (Active Secret Clearance Preferred) Desired Qualifications: Strong Background in C/C++ Background in MATLAB Experience developing and maintaining System/Software Engineering artifacts Analysis of software source code and binary executable files Experience in software analysis tools such as Understand, CodeSonar, CodeDx, and CodePeer Please Note: US Citizenship is required Qualified candidates should apply online at www.4mresearch.com. For assistance call 256-319-4646. 4M Research, Inc. is an Affirmative Action/ Equal Opportunity Employer and an active participant in the Employment Eligibility Verification Program (E-Verify).Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "System Software",
            "Secret Clearance",
            "Software Analysis",
            "Information Technology Planning",
            "Software Engineering",
            "MATLAB",
            "Software Development"
        ],
        "Soft Skills": [
            "Research"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-cimarron-software-JV_KO0,17_KE18,35.htm?jl=1008909532058": {
        "Location": "Alabama",
        "Data": [
            "Job Description:Cimarron is seeking a Software Engineer (Modeling & Simulation) to support the Missile Defense Agency's Ground-based Midcourse Defense (GMD) System Integration, Test and Readiness (SITR) contract in Huntsville, AL. SITR is responsible for the overall GMD Element engineering and integration, including physical and logical integration of the GMD Element and Components with the Missile Defense System. Cimarron's team members will be instrumental in ensuring the GMD Element of the Missile Defense System continues to provide safe, reliable, and responsive capability to defend the U.S. homeland.In this role, you serve as a Software Engineer using Agile software development methods to assist in planning and executing GMD Element Modeling and Simulation development and integration for the upgrades to the GMD Element. We welcome you to be a part of this challenging and important program!This is an onsite position.Key Duties:Lead the development and integration of the GMD Weapon Systems M&S products.Lead activities to develop and integrate M&S products based on flow diagrams, Software Design documents, Interface Control documents, and dynamic M&S outputs.Lead activities to review system designs through Model Based Systems Engineering tools, such as Cameo.Work effectively in a rapid-paced team environment.Required Skills, Experience, and Education:Due to facility security requirements, only U.S. citizens are eligible for consideration at this time.Active or Interim Secret clearance.5 or more years of experience.Experience with or knowledge of one or more of the following: C, C++, Java, Python.Ability to understand complex system designs and algorithms.Ability to derive a system design/functionality based on high-level requirements.Design flow diagram of system functionality.Experience working on an Agile-based development team.Bachelor's degree in Engineering, Computer Science, Mathematics, Physics, or Chemistry and typically 5 or more years of related work experience, or an equivalent combination of technical education and experience.Degree obtained from an accredited course of study.Business Profile:Cimarron is a global solutions company with a strategic partnering approach to satisfying customer-driven requirements. We ensure customer success with a modern approach and experienced leadership. Driven by an entrepreneurial spirit, Cimarron is fueled by highly skilled employees, developing new innovative technologies, and delivering superior products and services. We believe in recognizing employees' worth by offering competitive salaries and benefits, including health, dental, and vision insurance, 401(k) contributions, educational reimbursement, and much more. From company communication through Company-wide information meetings led by our President and CEO, to an Awards program designed to recognize our amazing employees and their accomplishments, you will not only feel like you are a part of a team, you will be a valued member of the Cimarron family. Cimarron is an Equal Opportunity/Affirmative Action Employer, M/F/Disability/Veteran.Job Type: Full-timePay: $105,000.00 - $165,000.00 per yearBenefits:401(k)401(k) matchingHealth insuranceHealth savings accountPaid time offVision insuranceSchedule:8 hour shiftWork Location: In personShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Model Based Systems Engineering",
            "Software Design Documents",
            "Agile Software Development",
            "Security Requirements Analysis",
            "Java (Programming Language)",
            "System Integration Testing",
            "Customer Success Management",
            "Systems Design",
            "Software Engineering",
            "Computer Science",
            "Agile Methodology",
            "Chemistry",
            "Physics"
        ],
        "Soft Skills": [
            "Planning",
            "Communications",
            "Mathematics",
            "Innovation",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-developer-cloud-engineer-integration-innovation-inc-JV_KO0,33_KE34,60.htm?jl=1008897985732": {
        "Location": "Alabama",
        "Data": [
            "Overview:  We are looking for a highly skilled Cloud Engineer with a strong background in Azure Gov Cloud and software development to join our team. This position will help spearhead the development of an interoperable medical system using emerging technologies and hybrid cloud solutions. You will work with a highly motivated team of software developers and operations engineers to solve technical challenges and facilitate medical advancements in patient care for the entire U.S. Army Medical community. In this role, you will be responsible for designing, implementing, and managing cloud solutions that meet the unique security and compliance requirements of government agencies. You will work closely with our clients to understand their needs and provide technical expertise to ensure the successful deployment and operation of cloud-based applications and services. This position does support a hybrid work schedule and is located in Huntsville, AL. Responsibilities: Design, develop, and maintain Android applications using modern development practices and Kotlin. Collaborate with teams to integrate and enhance Android applications with ATAK components, ensuring seamless functionality. Write clean, efficient, and well-documented code to maintain high standards of quality, performance, and security. Work closely with UI/UX designers to create intuitive and user-friendly interfaces. Integrate RESTful APIs and web services into applications to extend functionality and improve user experiences. Identify and resolve software bugs and issues in existing applications to maintain their reliability. Collaborate with software development teams to integrate cloud services seamlessly into applications, ensuring optimal performance and reliability. Set up, configure, and manage Azure Cloud pipelines to automate build, deployment, and continuous integration processes. Design, implement, and maintain scalable and secure cloud architectures tailored to the specific requirements of government clients. Create and maintain comprehensive Azure Cloud documentation, including system architecture diagrams, configuration guides, and best practices. Monitor cloud resources, analyze performance metrics, and implement optimization strategies to reduce costs and improve efficiency. Provide technical support and troubleshooting assistance to resolve issues related to Azure Gov Cloud services and applications. Qualifications: Bachelor's degree in Computer Science, Information Technology, or a related field (or equivalent work experience). Proven experience as a Cloud Engineer with a focus on Azure Gov Cloud. In-depth knowledge of cloud architecture, infrastructure, and services. Familiarity with government compliance standards and regulations (e.g., FedRAMP, FISMA). Experience with DevOps practices and tools. Experience using Agile Methodologies. Background in software development and scripting. Experience in Android App Development preferred. Experience developing ATAK applications and plug-ins preferred. Excellent communication skills, including the ability to present complex concepts clearly and persuasively across audiences at various levels of understanding. Excellent problem-solving and troubleshooting skills. Strong communication and teamwork abilities. Azure certifications (e.g., Azure Administrator, Azure DevOps Engineer) are a plus. U.S. Citizenship is required. About i3:  Headquartered in Huntsville, AL, i3 is a national leader in providing innovative technical and engineering solutions to a broad customer base across the U.S. DoD. Specializing in missile and aviation engineering and logistic services, electronic warfare and electromagnetic affects analysis, UAS system integration and flight operations, full lifecycle C5ISR engineering services, engineering analysis, cybersecurity and IT/IA innovative solutions and virtual training, simulation & serious game development and implementation. We were founded in 2007 with the intent to do business differently. Our focus is to leave our team members and customers better than we found them. Our ultimate goal is to strengthen our Nation and our warfighter. Perks and Benefits at i3: 100% team member owned Outstanding insurance coverage 401(k) match Health and wellness incentives Tuition and certification reimbursement Generous PTO Fun culture with company activities Countless opportunities to give back to the community through our charitable organization, i3 Cares We work hard. We compete hard. We play hard. Apply now to join us!Show more Report"
        ],
        "Hard Skills": [
            "Azure DevOps",
            "Application Programming Interface (API)",
            "Microsoft Azure",
            "Android (Operating System)",
            "Cloud Computing Architecture",
            "Video Game Development",
            "Android Applications",
            "Cloud Services",
            "Cloud Engineering",
            "Business Metrics",
            "Performance Metric",
            "Agile Methodology",
            "Emerging Technologies",
            "Continuous Integration",
            "Electronic Warfare",
            "Kotlin",
            "RESTful API",
            "Interoperability",
            "Hybrid Cloud Computing",
            "Web Services",
            "FedRAMP",
            "Scalability",
            "Cyber Security",
            "Systems Architecture",
            "Scripting",
            "Microsoft Azure Certification",
            "User Experience (UX)",
            "DevOps",
            "Virtual Training",
            "Computer Science",
            "Federal Information Security Management Act",
            "Engineering Analysis",
            "Systems Integration",
            "Software Development",
            "Technical Support",
            "Unmanned Aerial Systems (UAS)",
            "Aviation"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Communications",
            "Teamwork",
            "Information Technology",
            "Operations",
            "Innovation",
            "Problem Solving",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-proofpoint-JV_KO0,17_KE18,28.htm?jl=1008880642112": {
        "Location": "Alabama",
        "Data": [
            "It's fun to work in a company where people truly BELIEVE in what they're doing! We're committed to bringing passion and customer focus to the business. The Role Proofpoint’s Security Products Group is looking for an engineer to work on designing, building, and deploying our large-scale threat detection pipeline. Our team develops the next generation distributed pipeline to detect, analyze and produce intelligence for the latest threats from sophisticated cyber threat actors. Our detection services are the foundational components which are leveraged across Proofpoint’s cybersecurity product offerings to protect our customers from threats delivered through e-mail, social media, and SaaS applications. We are a fast-paced, high-energy team where you will be given the opportunity to make a significant impact. The team has a solid engineering culture that values the craftsmanship of writing great code, enjoys learning, and solving big problems. Engineers on the team, work up and down the software stack to tackle challenges of scaling, reliability, security, and usability for our users. Your day-to-day Be member of a high-performing team of engineers responsible for building critical threat detection and analysis services Develop code, unit tests, and BDD to create resilient and scalable features Help define processes and build tools as needed to scale the solution and the team Contribute innovative ideas for the service to stay ahead of threat actors Collaborate with teammates and colleagues in partner teams What you bring to the team Bachelor's degree in computer science or information systems 5+ years of industry experience with Python and/or Go, with a solid understanding of common data structures 3+ years of professional experience with AWS (S3, IAM, RDS, etc.), Kubernetes, Helm, Docker, Jenkins, Terraform, CI/CD, Elasticsearch and other modern tools Experience with distributed systems like Temporal.io Strong motivation and ability to learn modern technologies and domains A positive can-do attitude and bring a passion for excellence to the workplace Excellent collaboration and communication skills Knowledge of cybersecurity, malware analysis, threat detection and/or sandboxing technology a bonus Participate on the on-call rotation #LI-EC1 #LI-Remote If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us! Consistent with Proofpoint values and applicable law, we provide the following information to promote pay transparency and equity. Our compensation reflects the cost of labor across several U.S. geographic markets, and we pay differently based on those defined markets as set out below. Pay within these ranges varies and depends on job-related knowledge, skills, and experience. The actual offer will be based on the individual candidate. The range provided may represent a candidate range and may not reflect the full range for an individual tenured employee. This role may be eligible for variable pay and/or equity. We offer a competitive benefits package that includes flexible time off, a robust well-being program that provides for 4 global wellbeing days per year, and a 3-week work from anywhere option. Base Pay Ranges: SF Bay Area, New York City Metro Area: Base Pay Range: 128,940.00 - 202,620.00 USD California (excludes SF Bay Area), Colorado, Connecticut, Illinois, Washington DC Metro, Maryland, Massachusetts, New Jersey, Texas, Washington, Virginia, and Alaska: Base Pay Range: 106,750.00 - 167,750.00 USD All other cities and states excluding those listed above: Base Pay Range: 96,320.00 - 151,360.00 USDShow more Report"
        ],
        "Hard Skills": [
            "Behavior-Driven Development",
            "Cyber Threat Intelligence",
            "Unit Testing",
            "Docker (Software)",
            "Kubernetes",
            "Temporal.io",
            "Python (Programming Language)",
            "Terraform",
            "Malware Analysis",
            "Scalability",
            "Cyber Security",
            "Jenkins",
            "Elasticsearch",
            "Data Structures",
            "Threat Detection",
            "CI/CD",
            "Amazon S3",
            "Build Tools",
            "Computer Science",
            "Information Systems",
            "Go (Programming Language)"
        ],
        "Soft Skills": [
            "Enthusiasm",
            "Customer Service",
            "Energetic",
            "Resilience",
            "Teamwork",
            "Innovation",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-ai-signal-research-inc-asri-JV_KO0,17_KE18,45.htm?jl=1008907790399": {
        "Location": "Alabama",
        "Data": [
            "Thank you for your interest in AI Signal Research, Inc. (ASRI). ASRI accepts applications for employment for current career opportunities only.  Education:: ABET accredited BS in an Engineering discipline, or BS in Computer Science or related technical field.  Months/Years of Experience: :Minimum two (2) years of related experience.   Required Qualifications: :U.S. Citizen. Ability to obtain and maintain a security clearance. Knowledge of the complete Software/Systems Development process and lifecycle. Knowledge of requirements management tools (e.g. DOORS). Familiarity with aviation systems. Some travel.  Skills Needed:: Strong background in C/C++, background in Java.  Duties::  Desired Qualifications: :Aviation, IV&V and modeling & Simulation experience is a plus.  Comments: :Compliance with health mandates as dictated by the contract may be required as condition of employment. ASRI offers the following Benefits package: 401K Plan Medical and Dental Insurance Life Insurance Disability Income Educational Assistance Direct Deposit Cafeteria Plan Vision   Drug Free Workplace.: Adherence to ASRI policy on drugs and alcohol is a condition of employment for all employees.  AI Signal Research, Inc. (ASRI) wants all interested and qualified candidates to apply for employment opportunities. If you are an applicant with a disability who is unable to use our online tools to search and apply for jobs, please contact us by calling (in the U.S.) 1-256-551-0008 x29. Please indicate the specifics of the assistance needed. This option is reserved only for individuals with disabilities who are unable to use our online tools and is not intended for any other purpose:.  ASRI is an equal opportunity and affirmative action employer-Veterans/Disabled and other protected categories.Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Systems",
            "Disability Income",
            "Security Clearance",
            "Requirements Management",
            "Java (Programming Language)",
            "Computer Science"
        ],
        "Soft Skills": [
            "Research"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-job-id-3109-valkyrie-enterprises-JV_KO0,36_KE37,57.htm?jl=1008948088673": {
        "Location": "Alabama",
        "Data": [
            "Senior Software Engineer Purpose: Hill Technical Solutions, a Valkyrie company, is hiring for a Senior Software Engineer to join our team supporting development, integration, test, and evaluation in Hardware in the Loop labs in our Huntsville, AL location. The ideal candidate will have experience with developing software for real-time implementations and with integrating avionics hardware and software within real-time closed-loop simulation environments. Job Description: Support flight software integration within a high-fidelity, real-time 6DOF simulation. Integrate avionics hardware and software within real-time closed-loop simulation environments. Perform integration of PCIe IO devices with a real-time 6DoF model. Perform diagnostic software analysis, real-time OS control, and collaboration with hardware, software, and simulation teams to determine and evaluate performance characteristics. Use lab tools (DVM, oscilloscope, power supplies, etc.) to verify system configuration. Test and evaluate specific systems with a team of engineers. Software may be required to diagnose or test specific components. Hands-on testing, diagnostic work as well as software integration and development. Debug software and hardware issues. Collaborate with cross-functional teams to ensure successful integration of avionics hardware. Provide technical support to other teams as needed. Interaction with customers and vendors will be required. Qualifications: Must have a Bachelor's degree in a related engineering or science field and at least 5 years of experience in software development for real-time closed-loop implementations. Must be able to work in a Linux environment. Must be fluent in C/C++. Must be proficient in debugging software issues. Must have excellent skills in Customer and Team Communication and Collaboration. Must have the ability to work with software and hardware. Must have the ability to Document and explain work. Desired Qualifications: Prefer Bachelor's Degree in Software Engineering, Computer Engineering, or Electrical Engineering Prefer familiarity with tools such as GDB/console-level debugging, VS Code (or similar), and Git. Prefer experience with various Linux distro installs. Prefer experience performing kernel configuration. Security Requirements Must be eligible to obtain and maintain a DoD Secret security clearance. Travel Requirements Occasional travel- less than 10% If position requires travel by domestic flight or access to secure federal facilities/military bases, candidate must be able to obtain (by start of position) and maintain appropriate identification credentials, such as REAL ID. (More information regarding REAL ID can be found: https://www.dhs.gov/real-id ) Physical Requirements May require working in an office, industrial, shipboard, or laboratory environment. Remaining in a stationary position, often standing, or sitting for prolonged periods, moving about to accomplish tasks, or moving from one worksite to another. Light work that includes moving objects up to 20 pounds. Valkyrie strictly adheres to a policy of equal employment opportunity. This policy is based on Valkyrie’s commitment to hire and retain qualified employees consistent with position requirements; and to seek, employ, promote and treat all employees and applicants for employment without regard to race, color, religious creed, national origin, ancestry, citizenship status, pregnancy, childbirth, physical disability, mental disability, age, military status or protected veteran status, marital status, registered domestic partner or civil union status, gender (including sex stereotyping and gender identity or expression), medical condition, genetic information or sexual orientation or other protected characteristics.  Additionally, Valkyrie Enterprises provides a variety of benefits to support your best health, wellness, and future, to include medical/dental/vision options, company paid life and disability insurances, 401k with match, education reimbursement, as well as company paid holidays and paid time off (PTO).Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Debugging",
            "Six Degrees Of Freedom",
            "Linux Distribution",
            "Oscilloscope",
            "Secret Clearance",
            "Git (Version Control System)",
            "Linux",
            "System Configuration",
            "GNU Debuggers",
            "Security Requirements Analysis",
            "Flight Software",
            "Software Engineering",
            "Integration Testing",
            "Computer Engineering",
            "Software Analysis",
            "Software Development",
            "Electrical Engineering",
            "Technical Support",
            "Systems Integration",
            "Input/Output",
            "PCI Express",
            "Operating Systems"
        ],
        "Soft Skills": [
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-systems-engineer-sse-integration-innovation-inc-JV_KO0,29_KE30,56.htm?jl=1008840555668": {
        "Location": "Alabama",
        "Data": [
            "Overview:  i3 is seeking a Software Systems Engineer to provide technical and professional support to the Command, Control and Effects (C2E) Product Office (PO) within the Program Management Office (PMO) Uncrewed Aircraft Systems (UAS). The SSE will assist the C2E PO by providing software system subject matter expertise to the development, testing, product management, and fielding activities. The ideal candidate will understand and have knowledge of DO 178C, Design Assurance Levels (DAL), MIL-STD-882, FACE, and Agile methodology. This position is located in Huntsville, AL at Redstone Arsenal. Responsibilities: Collect information on systems-level project specifications, performance requirements, and known capabilities and limitations as they relate to the LE system. Review contractor developed systems software to improve performance, correct errors, and conform with compatibility requirements of available hardware. Determines feasibility of proposed system modifications or design, ensuring the needs and requirements of the user will be met within time and cost requirements. Designs systems software to meet project requirements, collaborating with systems analysts, engineers, programmers, and other developers as needed. Develops and leads software system testing and validation procedures; compiles relevant documentation. Uses mathematical models and scientific analysis to predict and measure consequences and other outcomes of software system design. Coordinates and schedules installation of software system. Analyze architectural and functional requirements, specifications, and interfaces. Evaluate detailed software specifications and designs. Monitor/review software and system integration and testing functions. Monitor implementation of development standards including but not limited to Mil-STD-882E, FACE, and others. Help with presentations and development of course of actions to upper management. Qualifications:  Required: Bachelor’s degree (or advanced degree) in any of the engineering disciplines from a college program with ABET (Accreditation Board for Engineering and Technology, Inc.) certification. +4 years of experience with a willingness to learn new processes. Knowledgeable of DO 178C and Design Assurance Levels (DAL). Knowledge of Mil-STD-882E, FACE, and others. Knowledge of C and C++, Matlab, CAMEO, and Doors. Knowledge of Modular Open System Approach (MOSA) and Agile design and development principles. Ability to review and analyze computer programs for various purposes. Ability to analyze and address needs of users based on User Requirements and CONOPS. Thorough understanding of computer engineering principles and procedures. Ability to manage time and prioritize tasks. Excellent verbal and written communication skills. Communication skills to interface with government and contractors to represent technical and programmatic positions. Must be a self-starter that thrives in a dynamic team environment. Candidate must possess a proven ability to develop and provide reports to management. Clearance: Active DoD Secret security clearance and the ability to maintain such is required. US Citizenship is required. About i3:  Headquartered in Huntsville, AL, i3 is a national leader in providing innovative technical and engineering solutions to a broad customer base across the U.S. DoD. Specializing in missile and aviation engineering and logistic services, electronic warfare and electromagnetic affects analysis, UAS system integration and flight operations, full lifecycle C5ISR engineering services, engineering analysis, cybersecurity and IT/IA innovative solutions and virtual training, simulation & serious game development and implementation. We were founded in 2007 with the intent to do business differently. Our focus is to leave our team members and customers better than we found them. Our ultimate goal is to strengthen our Nation and our warfighter. Perks and Benefits at i3: 100% team member owned Outstanding insurance coverage 401(k) match Health and wellness incentives Tuition and certification reimbursement Generous PTO Fun culture with company activities Countless opportunities to give back to the community through our charitable organization, i3 Cares We work hard. We compete hard. We play hard. Apply now to join us!Show more Report"
        ],
        "Hard Skills": [
            "Software Systems",
            "Design Assurance",
            "Functional Requirement",
            "C++ (Programming Language)",
            "System Testing",
            "Agile Methodology",
            "Video Game Development",
            "Secret Clearance",
            "Development Testing",
            "User Requirements Documents",
            "Scientific Methods",
            "Command Controls",
            "Product Management",
            "Electronic Warfare",
            "Mathematical Modeling",
            "Military Standards And Specifications",
            "Concept Of Operations",
            "Cyber Security",
            "DO-178B/C (Software Considerations in Airborne Systems and Equipment Certification)",
            "Project Management Office (PMO)",
            "MATLAB",
            "Systems Design",
            "Virtual Training",
            "Computer Engineering",
            "Engineering Analysis",
            "Systems Integration",
            "Unmanned Aerial Systems (UAS)",
            "C (Programming Language)"
        ],
        "Soft Skills": [
            "Presentations",
            "Self-Motivation",
            "Time Management",
            "Information Gathering",
            "Writing",
            "Willingness To Learn",
            "Operations",
            "Management",
            "Innovation",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-4-contract-boeing-JV_KO0,28_KE29,35.htm?jl=1008905940612": {
        "Location": "Alabama",
        "Data": [
            "A Platform Engineer on this team supports the development of a virtualized system used to support multiple types of tests and development activities on the program, utilizing modern tools such as Ansible, Terraform, vSphere, and eSXI. Platform Engineer Develops and configures virtualization artifacts using Industry Standard tools and security recommendations Rapid prototyping of a variety of virtualized systems and sub-systems Write/debug PowerShell/BASH/Python scripts Create, Configure, Deploy virtual machines in both Linux & Windows Troubleshoot Virtual Machine security/networking configuration Develop documentation detailing software and system components Develop Terraform playbooks to create/destroy virtual environments Develop Ansible playbooks to configure virtual systems Requirements Cybersecurity IAT/IAM Level 2 Certificate or higher This position requires the ability to obtain a U.S. Security Clearance for which the U.S. Government requires U.S. Citizenship. This position requires clearing a background check and an enhanced Personal Conflict of Interest (PCI) requirements as a condition of employment. Desired Experience: 3+ years of experience developing and debugging scripts in PowerShell/BASH Experience with Ansible and Terraform 3+ year experience with Virtualization technologies (Creation, Deployment, and Configuration) Strong understanding of physical and virtual networking Strong understanding of Linux and Windows configuration Experience configuring continuous integration/continuous deployment (CI/CD) pipelines with Git or similar version control tools Experience working in fully virtualized environments Ability to solve technical problems without step-by-step documentation Highly motivated to learn new skills Experience performing Verification and Validation (V&V) of hardware/software systems along with integration and unit testing Strong attention to detail and ability to work independently and manage multiple activities simultaneouslyShow more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Software Systems",
            "Verification And Validation",
            "Security Clearance",
            "VMware VSphere",
            "Git (Version Control System)",
            "Virtual Machines",
            "IAM Level II Certification",
            "Linux",
            "Python (Programming Language)",
            "Virtualization",
            "Terraform",
            "Continuous Integration",
            "Security Recommendations",
            "Ansible",
            "Product Family Engineering",
            "Cyber Security",
            "Rapid Prototyping",
            "VMware ESX Servers",
            "Unit Testing",
            "Continuous Deployment",
            "CI/CD",
            "Bash (Scripting Language)",
            "Windows PowerShell",
            "Version Control"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Detail Oriented",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-john-h-northrop-and-associates-JV_KO0,17_KE18,48.htm?jl=1008928999720": {
        "Location": "Alabama",
        "Data": [
            "Overview: JHNA is seeking a Software Engineer/Software Management to join our team in Huntsville, AL within PEO Aviation. Roles/Responsibilities: Provide key software technical expertise for documentation review, analysis of Program or Contractor metrics, schedule, and cost estimates. Identify and track software risk areas for the program and implement risk mitigation plans. Assist PMs, or other customers, to generate metrics and measurement techniques to provide program office leadership with timely and accurate information on the state of ongoing and planned efforts. Assist PMs in development of cybersecurity documentation and coordination of cybersecurity test events. Develop/Review system/subsystem specifications, system architectures, program briefings, white papers, and other products. Required Qualifications: BS in a technical field such as Computer Engineering, Electrical Engineering, Computer Science Must have an active Secret clearance. Must have a minimum of 5 years relevant experience. Must have experience supporting a Government Project or Product Office in an acquisition organization such as PEO AVN or PEO M&S. Must be an accomplished self-starter with the ability to work in a small team with minimal supervision. Experience collaborating with project and product office personnel. Experience with open standards such as FACE, Technical Standards, HOST Standards, SOSA Technical Standard, VICTORY, OMS, etc. Experience developing contract language and requirements, reviewing, and evaluating contractor deliverables. Knowledge of at least one Object-Oriented Programming language Experience using issue-tracking software such as Jira or Git Desired Qualifications: Program or Project Management experience Experience with Army Aviation platforms such as Apache, Blackhawk, Chinook, UAS, FLRAA or FARA Experience using common MBSE tools (e.g., Cameo, Rhapsody, etc.)Show more Report"
        ],
        "Hard Skills": [
            "Open Standards",
            "Git (Version Control System)",
            "Secret Clearance",
            "Model Based Systems Engineering",
            "Object Oriented Programming Language",
            "JIRA",
            "Risk Mitigation",
            "Project Management",
            "Technical Standard",
            "Cyber Security",
            "Software Project Management",
            "Computer Engineering",
            "Software Engineering",
            "Computer Science",
            "Electrical Engineering"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Supervision",
            "Coordinating",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-therapy-brands-JV_KO0,24_KE25,39.htm?jl=1008868598583": {
        "Location": "Alabama",
        "Data": [
            "Company Description Therapy Brands is the leading healthcare technology partner for mental, behavioral, and rehabilitative therapy. Our purpose-built and all-in-one practice management, data, and billing solutions drive exceptional clinical and financial outcomes. Thousands of therapy practices rely on us as a trusted partner, to make their lives simpler and more efficient, improve revenue, and enable them to focus on patient care. For more information, explore our solutions at therapybrands.com.  Job Description We’re seeking a Software Developer to embark on a journey of crafting next-generation applications that will redefine and inspire healthcare software services, harnessing your expertise to empower medical professionals and enhance patient care. In a pivotal role on the team, you will be a catalyst for accuracy, efficiency, and security in medication management through optimizing prescription workflows on our e-prescribe platform. PRIMARY RESPONSIBILITIES OF THIS POSITION Contribute to full stack to applications and enhancements to existing applications using C#, .NET, Javascript, JQuery, SQL, HTML, and CSS on Cloud optimized platforms Collaborate with cross-functional teams to effectively develop solutions Conduct quality control checks throughout development Participate in strategy meetings Collaborate with product and customer support team to ensure applications are effectively developed/updated Comfortable with initiating and implementing new projects Comfortable reviewing code and coaching junior developers Anticipate possible failures/errors and implement new solutions to optimize performance of UIs, backend calls, and database queries Comfortable with merging code, helping with releases, and deploying code  Qualifications EDUCATION AND EXPERIENCE 7+ years of relevant, professional experience in web and API development Experience/education developing software, web applications using C#, .NET, Javascript, JQuery, SQL, HTML, and CSS in a SaaS environment Extensive use of APIs and understanding of HTTP and REST architecture Knowledgeable with version control (Azure DevOps/Git) Experience with MVC architecture pattern Experience with databases (MongoDB, PostgreSQL) Knowledge of Cloud Platforms (Azure, AWS) a plus Strong experience working in agile environments including utilizing SCRUM, TDD, TFD, DDD, CI, CD, etc. Desirable Experience in building applications in the healthcare space Experience with healthcare integration standards (HL7, CDA, CCDA, NCPDP, etc.) Experience/familiarity with test automation frameworks SSO experience (SAML, OIDC, oAuth, 3rd party identity providers) Payment/Billing experience (Stripe, etc.) SKILLS AND QUALIFICATIONS REQUIRED FOR THIS POSITION Ability to work in a fast-paced dynamic environment. Experience working in an Agile development environment. Must be a team player with strong attention to detail and able to work independently. Excellent critical thinking, problem solving, mathematical skills and sound judgment. Additional Information While we've outlined some key qualities we typically seek, it's essential to remember that there might be additional unique strengths and talents you possess that would make you an exceptional match for us, even if they're not explicitly mentioned. Studies have consistently highlighted the significance of this principle, particularly for individuals from disenfranchised backgrounds, including women and other marginalized groups. These individuals often hesitate to apply unless they meet every single requirement, unlike their male counterparts who are more inclined to apply when they meet around 60% of the criteria. The message we want to convey is that taking a leap of faith and applying can be incredibly rewarding. Your distinct abilities and perspectives could be exactly what we need to create a more diverse and inclusive team. So, don't hesitate—apply today and let's explore the exciting possibilities together! All your information will be kept confidential according to EEO guidelines. At Therapy Brands, Diversity, Equity, Inclusion, and Belonging aren’t just words. We celebrate what makes us unique, foster an ecosystem of inclusion for all and harness our talents to promote diversity of thought and action in everything we do. We instill Diversity, Equity, Inclusion, and Belonging into the fabric of our CARING culture and business, as we strive to be recognized not only as the leader in healthcare technology, but also for our intentional efforts to promote a diverse community. We will champion non-discriminatory practices throughout the employee and customer lifecycle; caring for every person regardless of race, national origin, color, religion, disability, sex, orientation, or familial status. Therapy Brands is an equal opportunity employer.Show more Report"
        ],
        "Hard Skills": [
            "Azure DevOps",
            "Database Queries",
            "Application Programming Interface (API)",
            "Agile Methodology",
            "Microsoft Azure",
            "Practice Management",
            ".NET Framework",
            "Customer Lifecycle Management",
            "PostgreSQL",
            "Git (Version Control System)",
            "Scrum (Software Development)",
            "Single Sign-On (SSO)",
            "Full Stack Development",
            "Customer Support",
            "Cisco Certified Design Associate",
            "Medical Software",
            "MongoDB",
            "Medication Administration",
            "Test-Driven Development (TDD)",
            "Model View Controller",
            "SQL (Programming Language)",
            "C# (Programming Language)",
            "Amazon Web Services",
            "Test Automation",
            "HyperText Markup Language (HTML)",
            "OAuth",
            "JQuery",
            "CI/CD",
            "JavaScript (Programming Language)",
            "Version Control",
            "Security Assertion Markup Language (SAML)",
            "Cascading Style Sheets (CSS)",
            "Software As A Service (SaaS)",
            "Web Applications",
            "Billing"
        ],
        "Soft Skills": [
            "Coaching",
            "Quality Control",
            "Critical Thinking",
            "Detail Oriented",
            "Mathematics",
            "Problem Solving",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-cae-JV_KO0,17_KE18,21.htm?jl=1008837559974": {
        "Location": "Alabama",
        "Data": [
            "Role and Responsibilities Summary CAE USA is seeking an experienced Software Engineer to work with high fidelity real-time immersive training systems for multi-domain military platforms. This position will work with the Research & Development Engineering team to develop, integrate, test, and demonstrate cutting edge technologies supporting our digital training and next-generation situational awareness solutions in support of our military customers. This position is based in Dothan, AL and will collaborate closely with engineering teams based in Florida (Tampa and Orlando) and Texas (Arlington). A significant part of this role will be to deploy, demonstrate, and maintain CAE’s latest training technologies at our Training Center in Dothan. Essential Duties and Responsibilities Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Support the development, deployment, and sustainment of technology demonstrators Present and conduct technology demonstrations to leadership and potential customers Support and participate in all phases of the software development life cycle, including requirements analysis, design, implementation, integration, and test. Must be self-motivated and expected to work independently with minimal supervision Report status on tasks and assignments Utilize a variety of software languages (i.e., C++, C#, Java, Python) on Windows, Linux, and mobile platforms and apply these technologies to the AR, VR, gaming, and mobile computing domains. Setup computer systems (include hardware and software installation and troubleshooting) Develop software/hardware interfaces Integrate and test VR/AR/MR hardware (VARJO, HoloLens, etc) Perform as part of an Agile (SAFe) team (scrums, planning, retrospectives) Qualifications and Education Requirements B S degree in Computer Engineering or Computer Science, or related engineering field with relevant experience 5 years of experience in an engineering or software development role Excellent written and verbal communication skills. Analytical math skills necessary to complete the required tasks. Experience writing C++, C#, Java, or JavaScript Experience with Angular JS, Node, Ext.js Experience using a source code repository such as Git Experience using a defect management system such as Jira Experience with Agile development methodologies Experience with real-time implementation of software and hardware integration Must be eligible for DoD Personal Security Clearance Due to U.S. Government contract requirements, only U.S. citizens are eligible for this role. Preferred Skills SAFe 5 Certification Experience with gaming technologies such as Unity 3D, Unreal Engine Experience with control loading systems for vehicle dynamics real-time simulation (Brunner, Bugeye, etc) Experience with Presagis Products such as Terra Vista or Creator Experience writing C++, C#, Java, or JavaScript Experience with Angular JS, Node, Ext.js Experience writing Ruby on Rails Experience writing Python Scripts Experience using OpenGL or WebGL Experience working with service-based architectures Experience with cloud environments such as AWS or Azure IAT Level 2 Certification (e.g. Security +) Experience with GDAL, GeoServer, OpenLayers or ESRI APIs Experience with OGC Standards such as WMS, WFS, WPS, WCS, GeoPackage, 3D Tiles, IS3, or CDB Experience with HTML, HTML5, CSS, XML, XSLT, and JSON Experience with Agile (SAFe) development methodologies Security Responsibilities Must comply with all company security and data protection / usage policies and procedures. Personally responsible for proper marking and handling of all information and materials, in any form. Shall not divulge any information, or afford access, to other employees not having a need-to-know. Shall not divulge information outside company without management approval. All government and proprietary information will be accessed and stored electronically on company provided resources.  Incumbent must be eligible for DoD Personal Security Clearance. Work Environment This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines. Physical Demands The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Must be able to perform normal office duties (sitting for long periods at a desk and in technical meetings) Must be able to climb stairs on a regular basis Must be willing to work overtime Must be able to travel CONUS and to international sites Must be able to travel via car and airplane Other Duties Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for their job. Duties, responsibilities, and activities may change at any time with or without notice. CAE USA Inc. is an EOE/AA employer and gives consideration for employment to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. If you’d like more information about your EEO rights as an applicant under the law, please click here Know Your Rights: Workplace Discrimination is Illegal. PAY TRANSPARENCY NONDISCRIMINATION PROVISION The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. Position Type  Regular CAE thanks all applicants for their interest. However, only those whose background and experience match the requirements of the role will be contacted. Equal Employment Opportunity At CAE, everyone is welcome to contribute to our success. With no exception. As captured in our overarching value \"One CAE\", we’re proud to work as one passionate, boundaryless and inclusive team. At CAE, all employees are welcome regardless of race, nationality, colour, religion, sex, gender identity or expression, sexual orientation, disability, neurodiversity or age. The masculine form may be used in this job description solely for ease of reading, but refers to men, women and the gender diverse.Show more Report"
        ],
        "Hard Skills": [
            "Unity Engine",
            "Virtual Reality",
            "Augmented Reality",
            "JavaScript (Programming Language)",
            "Office Equipment",
            "C++ (Programming Language)",
            "Application Programming Interface (API)",
            "Agile Methodology",
            "Microsoft Azure",
            "Personal Security",
            "Extensible Markup Language (XML)",
            "OpenLayers",
            "Git (Version Control System)",
            "C (Programming Language)",
            "Linux",
            "Software Development Life Cycle",
            "Unreal Engine",
            "GeoServer",
            "Python (Programming Language)",
            "Geospatial Data Abstraction Library (GDAL)",
            "Angular (Web Framework)",
            "JIRA",
            "Java (Programming Language)",
            "Extensible Stylesheet Language Transformations (XSLT)",
            "Requirements Analysis",
            "C# (Programming Language)",
            "Software Installation",
            "Vehicle Dynamics",
            "CompTIA Security+",
            "Amazon Web Services",
            "OpenGL",
            "Ruby On Rails",
            "Information Privacy",
            "HyperText Markup Language (HTML)",
            "HTML5",
            "Cascading Style Sheets (CSS)",
            "Sprint Retrospectives",
            "ArcGIS (GIS Software)",
            "WebGL",
            "JSON",
            "Computer Engineering",
            "Software Engineering",
            "IAT Level II Certification",
            "Hardware Interface Design",
            "Computer Science",
            "Node.js (Javascript Library)",
            "Web Processing Service",
            "Software Development",
            "Simulations",
            "Hololens (VR Technology)",
            "Management Systems",
            "Demonstration Skills"
        ],
        "Soft Skills": [
            "Mathematics",
            "Planning",
            "Self-Motivation",
            "Verbal Communication Skills",
            "Management",
            "Research",
            "Writing",
            "Leadership",
            "Filing"
        ]
    },
    "https://www.glassdoor.com/job-listing/automation-engineer-graduate-constellium-JV_KO0,28_KE29,40.htm?jl=1008847574762": {
        "Location": "Alabama",
        "Data": [
            "Primary Purpose A Graduate Automation Engineer utilizes technology to improve, streamline and automate a manufacturing process. They are responsible for planning, implementation, and monitoring of such technology. An Automation Engineer uses technology to oversee or manage the manufacturing process. The aim of this technology is to streamline the manufacturing process to make it as efficient as possible. For any step in the manufacturing process, an Automation Engineer can be tasked with designing, simulating, installing, testing and managing an electrical or mechanical automation. Key accountabilities Identification of new opportunities for automation within the manufacturing process. Supports management of a project team when necessary. Designing new automation equipment or processes. Simulating and testing these processes or equipment to ensure they function as desired. Development of documentation for the new equipment and processes. Programming new automated components to the manufacturing process. Developing and maintaining clear and accurate documentation of automation equipment or processes. Participate in training where necessary – typically after implementing new processes or equipment, or making changes to existing ones. Troubleshooting automated processes or equipment when errors occur. Leadership competencies, technical skills requirement Bachelor’s degree (Computer Science, Computer Engineering, Electronic Engineering, Controls Engineering, Automation or Robotics Engineering) Troubleshooting and Root-Cause Analysis Experience preferred. PLC programming skills using Ladder Logic, Structured Text, and Function Blocks. AC/DC Drive regulation, with a detailed understanding of coordinated drive systems (tension control, coordinated speed regulation, load sharing, etc.) Ability to work with a broad cross section of people from managers, hourly work force and internal/external customers. Work that requires frequently standing for long periods of time and often in awkward positions. Knowledge and experience in troubleshooting advanced electrical equipment. Understands schematics and knowledge of Low Voltage Power Systems. Willing to travel for advanced training of different electrical equipment and Factory Acceptance Tests of new equipment. After hour call outs and on the phone technical support. Excellent computer skills particularly in programming and software development Communication skills – will need to be able to explain novel and complex ideas to stakeholders of all levels and within multidisciplinary teams. Written communication skills will also be needed for record keeping and documentation. Problem-solving and creative thinking will be required to troubleshoot problems as they arise and find effective solutions. About Constellium Constellium Muscle Shoals is an aluminum manufacturing plant based in Alabama with over 1,200 employees. With its widest strip mill in the USA and a world-class recycling center, the site represents one of the largest sites within Constellium and is a world-class can recycling center, with the capacity to recycle nearly 20 billion cans per year. Muscle Shoals’ main product is aluminum can sheet for the packaging industry, particularly for beverage containers. It manufactures sheet used in all three components of an aluminum can, namely body stock, coated end stock and tab stock. Additionally, Muscle Shoals’ supplies Auto Body Sheet substrate to Constellium’s Bowling Green, Kentucky, site. Constellium is an Equal Opportunity Employer: Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.Show more Report"
        ],
        "Hard Skills": [
            "Electric Power Systems",
            "Structured Text",
            "Manufacturing Processes",
            "Factory And Site Acceptance Testing",
            "Root Cause Analysis",
            "Tension Control Bolts",
            "Electronic Engineering",
            "Programmable Logic Controllers Programming",
            "Computer Engineering",
            "Systems Engineering",
            "Computer Science",
            "Electrical Equipment",
            "Automation",
            "Robotics",
            "Ladder Logic",
            "Low Voltage",
            "Software Development",
            "Technical Support"
        ],
        "Soft Skills": [
            "Planning",
            "Creative Thinking",
            "Writing",
            "Record Keeping",
            "Communications",
            "Problem Solving",
            "Leadership",
            "Troubleshooting (Problem Solving)",
            "Computer Literacy",
            "Management",
            "Packaging And Labeling"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-outpost-technologies-JV_KO0,17_KE18,38.htm?jl=1008881451121": {
        "Location": "Alabama",
        "Data": [
            "Position Description:  Outpost Technologies is seeking a talented Software Engineer that will develop new software for test and evaluation instruments. This role involves assessing current systems and proposing enhancements to existing software while preserving the current capabilities of the systems. The Candidate will join a multi-disciplinary team dedicated software solutions that support EO/IR system operations, encompassing data collection, analysis, and management within government testing environments. As a Software Engineer, you will be responsible for software tool development and maintenance, data collection, equipment evaluation, analysis, and provide valuable insights for hardware and system design. This position may involve occasional travel, up to 10%. Communication skills are strongly desired. The Candidate must be self-motivated and produce excellent work that exceeds customer expectations. The Candidate must always present a professional demeanor while representing Outpost Technologies to customers and stakeholders. Position Responsibilities:  Develop software tools to facilitate testing and evaluation system operations, data collection, and analysis. Design software system architectures. Manage technical projects effectively. Collaborate in the creation of prototype systems. Provide support for EO/IR system operation, data collection, and analysis during and after test events. Travel to various CONUS locations in support of EO/IR operations.   Basic Qualifications:  Bachelor’s degree in software engineering, computer science, or an equivalent technical field. A minimum of 3 years of relevant experience. Proficiency in software development with object-oriented programming languages (e.g., Python, Java, C++). Strong understanding of network packet concepts. Willingness to travel up to 10% of the year. Effective time management and planning skills. Exceptional verbal and written communication skills.  Willingness to go above and beyond to exceed customer expectations.   Preferred Qualifications:  Experience with DevOps tools such as Docker and Git. Background in HWIL (Hardware-in-the-Loop) software development and testing. Familiarity with Wireshark.   Benefits  Health Insurance Dental Insurance Vision Insurance Life Insurance 401(k) Matching Paid Time Off Paid Parental Leave Tuition ReimbursementShow more Report"
        ],
        "Hard Skills": [
            "Object-Oriented Programming (OOP)",
            "C++ (Programming Language)",
            "Docker (Software)",
            "Git (Version Control System)",
            "Python (Programming Language)",
            "Design Software",
            "Java (Programming Language)",
            "Software Engineering",
            "DevOps",
            "Systems Design",
            "Network Packet",
            "Wireshark",
            "Computer Science",
            "Software Development"
        ],
        "Soft Skills": [
            "Planning",
            "Professionalism",
            "Writing",
            "Self-Motivation",
            "Time Management",
            "Management",
            "Communications",
            "Operations"
        ]
    },
    "https://www.glassdoor.com/job-listing/c-software-developer-dynetics-JV_KO0,20_KE21,29.htm?jl=1008937175882": {
        "Location": "Alabama",
        "Data": [
            "Leidos, Dynetics Group is seeking a talented Software Developer to join a diverse team to create unique solutions for complex problems. We have offices across the United States engaging in the defense, space, cyber and commercial fields. Dynetics provides responsive, cost-effective engineering, scientific and IT solutions. In this role, you will join a team that develops software solutions for our customers in Unmanned Aerial Systems simulation. You will use your skills to design and implement new features, fix bugs, perform peer reviews, write tests, analyze new technologies and best practices, and collaborate with other teammates. You’ll be developing solutions primarily in .NET and C#. Emphasis is placed on the utilization of existing and leading-edge tools to provide cost- effective and timely solutions to our customer. The team consists of highly skilled professionals that have strong fundamental skills, exercise best practices, conduct peer reviews, and exceeds customer expectations. Basic Qualifications Bachelor’s or Master’s degree in Computer Science, Computer Engineering, or equivalent degree from an ABET accredited school with a minimum of 3+ years of applicable experience. Software development experience and demonstrate knowledge of C#, as well as data structures, object-oriented design, and effective unit testing. Self-disciplined with good people skills, writing skills, attention to detail, and strong technical interests/capabilities. Candidate must be a resident of the North Alabama area or willing to relocate to the Huntsville - North Alabama, AL area.  Other Qualifications Knowledge of WPF and experience using the Model-View-ViewModel (MVVM) design pattern is preferred. Knowledge and experience in Microsoft Visual Studio, Microsoft ADS, and Git are considered a plus. Security Requirements Candidate must be a US Citizen and possess (and be able to maintain) a Final Secret Clearance or meet the eligibility to obtain (and maintain) a Secret Clearance.Show more Report"
        ],
        "Hard Skills": [
            "Unmanned Aerial Systems (UAS)",
            ".NET Framework",
            "Software Design Patterns",
            "Git (Version Control System)",
            "Secret Clearance",
            "Microsoft Visual Studio",
            "Object-Oriented Design",
            "Security Requirements Analysis",
            "C# (Programming Language)",
            "Model View ViewModel",
            "Data Structures",
            "Peer Review",
            "Unit Testing",
            "Computer Engineering",
            "Windows Presentation Foundation",
            "Computer Science",
            "Software Development"
        ],
        "Soft Skills": [
            "Self-Discipline",
            "Detail Oriented"
        ]
    },
    "https://www.glassdoor.com/job-listing/publication-tracking-software-developer-huntsville-al-directviz-solutions-llc-JV_KO0,53_KE54,77.htm?jl=1008944835527": {
        "Location": "Alabama",
        "Data": [
            "DirectViz Solutions, LLC. is a high-level, strategic consulting services firm that meets mission IT needs for government clients. We are sourcing for a Publication Tracking Software (PTS) Suite Developer. The work location will be Huntsville, AL with a Hybrid work schedule. Job Description: Supporting PTS suite of Products (PTS, Pubs Online, 2028 and MEO) development Database management PTS customer support (telephone and email) Desired Skills: C#, ASP.NET web application development, Visual Studio Crystal/Telerik Reports, MS SQL, transact-SQL (T-SQL) query language Desired Technical Experience: Configuring, testing, documenting PTS software and end user manuals. Physical and Mental Qualifications: Be able to maintain awareness during scheduled working hours Prolonged periods sitting or standing at desk and working on a computer (mouse and keyboard) Able to lift up to 15 pounds Excellent verbal and written communication; good command of the English language Execute tasks independently and work as a team Learns and memories routine tasks Strong organizational, grammar, business correspondence, and self-management skills Candidates must be able to perform the essential functions of the position satisfactorily. If requested, reasonable accommodations will be provided for employees with disabilities. DVS retains the right to change or assign other duties to this position.    DirectViz Solutions, LLC (DVS) is an equal opportunity employer and prohibits discrimination and harassment against any employee or applicant for employment because of race, color, sex (including pregnancy), age, gender identity, creed, religion, national origin, sexual orientation, marital status, genetic information, disability, political affiliation, protected veteran status, or any other status protected by federal, state or local law. DVS has a zero-tolerance policy for harassment, threats, coercion, discrimination, and intimidation. Employees may file a complaint or exercise any right protected by Executive Order 11246, Section 503 of the Rehabilitation Act of 1973, as amended, Section 4212 of the Vietnam Era Veterans Readjustment Assistance Act of 1974, or the Veterans Employment Opportunities Act of 1998.Show more Report"
        ],
        "Hard Skills": [
            "Transact-SQL",
            "Microsoft Visual Studio",
            "Query Languages",
            "Business Correspondence",
            "Customer Support",
            "Web Application Development",
            "ASP.NET",
            "Telerik",
            "C# (Programming Language)",
            "Microsoft SQL Servers",
            "Database Management"
        ],
        "Soft Skills": [
            "Teamwork",
            "Lifting Ability",
            "Writing",
            "Consulting",
            "English Language",
            "Management",
            "Grammar"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-developer-tyler-technologies-JV_KO0,18_KE19,37.htm?jl=1008847584928": {
        "Location": "Alabama",
        "Data": [
            "Tyler Technologies is a leader in digital government solutions and payments, partnering with government to deliver user-friendly digital services that make it easier and more efficient to interact with government. Our mission is to empower public sector entities to operate more efficiently and connect more transparently with their constituents and with each other.  Tyler Alabama is the State of Alabama’s premier provider of official eGovernment services, including websites, online services and secure payment processing solutions. Some examples of the services we've built in Alabama include online renewals for Driver Licenses, Online Voter Registration, Hunting & Fishing license purchases and the Outdoor Alabama mobile application.  Role Description As a Software Developer, you will have an opportunity to meaningfully improve the experience of millions of Alabama citizens, as we continue to make government interactions more accessible and convenient. This role is an entry- to mid-level software engineering position and reports to the Director of Development.  The services in our care currently include a wide array of: Java web applications ReactJS front ends NodeJS back-ends (using Serverless Framework) Mobile application built with React Native Creating and consuming REST, GraphQL and SOAP web services Batch processing, file exchanges or document generation Payment processing These applications are deployed on-premises to Java Application servers backed by Oracle databases, or in AWS leveraging several services such as API Gateway, Lambda, Step Functions, DynamoDB, Cognito, CloudFront or S3.  As a Software Developer, you will be tasked with designing, developing, and maintaining performant and secure web applications and APIs. You will also be expected to dedicate some of your time to collaborating with and learning from more experienced software engineers, as well as other, non-technical team members. You will have opportunities to focus on learning and expanding your skill set, and to apply what you've learned immediately on real projects. After a period of onboarding, where you will likely be paired with a more experienced engineer, and where you will familiarize yourself with our projects, methods and best practices, you will be tasked with completing increasingly complex development tasks, up to and including being the main developer on a full-stack project, once you've reached a sufficient level of proficiency. We understand that this journey takes different shapes for different individuals, and we will support you in any way we can.  Qualifications We are looking for engineers with an interest in developing and supporting web applications and APIs, preferably with Java MVC frameworks or with JavaScript front ends and back-ends, but we welcome applicants who have similar interest or experience in other technology stacks. You must be capable of communicating your ideas and solutions effectively to both technical and non-technical audiences.  A good understanding of the following is desirable: HTML/CSS and basic JavaScript API design principles and strategies Database modelling with either relational or non-relational databases (database structure, writing and debugging queries) Experience with any of the following would be great additions: Security as it applies to web applications Building and deploying applications in AWS ReactJS Serverless Framework Experience using and implementing APM and other Telemetry Experience assembling or using a sensible CI/CD pipeline PCI or HIPAA compliance requirements A specific degree is not required, we will gladly consider qualified applicants with alternative paths.Show more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Relational Databases",
            "Application Programming Interface (API)",
            "API Gateway",
            "Batch Processing",
            "React Native",
            "Amazon DynamoDB",
            "Software Engineering",
            "Serverless Computing",
            "API Design",
            "Full Stack Development",
            "Model View Controller",
            "Java (Programming Language)",
            "React.js (Javascript Library)",
            "Web Services",
            "Online Service Provider",
            "Mobile Application Development",
            "Oracle Databases",
            "Node.js (Javascript Library)",
            "Amazon Web Services",
            "Payment Processing",
            "Web Application Security",
            "Amazon Cloudfront",
            "HyperText Markup Language (HTML)",
            "Cascading Style Sheets (CSS)",
            "Application Deployment",
            "CI/CD",
            "GraphQL",
            "Amazon Cognito",
            "JavaScript (Programming Language)",
            "Amazon S3",
            "Java Web Start",
            "Simple Object Access Protocol (SOAP)",
            "Health Insurance Portability And Accountability Act (HIPAA) Compliance"
        ],
        "Soft Skills": [
            "Communications",
            "Writing"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-pradco-outdoor-brands-JV_KO0,24_KE25,46.htm?jl=1008931536857": {
        "Location": "Alabama",
        "Data": [
            "Headquartered in Birmingham, Alabama, Moultrie Mobile (www.moultriemobile.com) is a rapidly scaling software and cellular camera platform used by hunters, property owners, jobsite managers, and others for real-time remote monitoring. We take pride in developing deep user understanding, obsess about the details, and go the extra mile to show our users we love them. Moultrie is first and foremost customer driven – hardware, software, marketing, and customer success teams collaborate to deliver a quality user experience. Moultrie Mobile is a division of PRADCO Outdoor Brands, a leader in producing game calls, scents, attractants, game feeders, game cameras, tree stands and fishing lures. PRADCO has been in business since 1894, and we offer the stability and benefits of a firmly established corporation while operating as a growth-focused team with the entrepreneurial spirit of a startup. We are guided by the following principles: We put the customer first.; We are curious and seek to learn.; We take ownership.; We are grounded.; We win as a team.; We are builders working with relentless energy, urgency, passion, and drive.; We innovate, experiment, and take risks. Moultrie Mobile is looking to add a Senior Software Engineer to the team. This position will be focused on implementing new features and creating solutions for the Moultrie Mobile platform, as well as other hunting division software projects. As a team member, you will be accountable for implementing improvements based on best practices in a manner that is maintainable, scalable, testable, and works within the continuous delivery pipeline. You will also be working cross-functionally with Product, Customer Service, Marketing, and other engineering departments to ensure the completion of visions and timelines set by the business. He or she will grow the business by thoroughly understanding the marketplace and competition, and by developing products that address consumer needs and staying abreast of the latest software trends. Responsibilities: Working in a cross-functional team developing mobile and back-end features Deliver high quality multi-platform projects using Microsoft development technologies Demonstrate highly effective approaches to object-oriented software development based on industry best practices. Design, build, test and maintain scalable, secure, and testable code Mentor new and junior team members Monitor crash reports, identify solutions and implement fixes Provide estimates and participate in agile development Writing and maintaining unit tests Work with the dev team, product owners, and stakeholders to get clarification on business requirements and then implement solutions including code development and database design Required Skills: Bachelor’s degree in computer science, software engineering or related field (or equivalent years’ work experience) Demonstrated willingness and ability to adapt and learn new technologies and processes 5+ years of professional development experience Minimum of 5 years related experience in following: .NET framework and/or .NET core SQL Server Entity Framework Knowledge of common design patterns (Inversion of Control, Dependency Injection, etc.) Cloud experience 3+ years in some of the following: Source Control Azure DevOps Unit Testing Mobile Development Preferred Skills: Azure Xamarin Forms or MAUI Event/Message based architecture We are an equal opportunity employer and comply with all applicable federal, state, and local fair employment practices laws. We strictly prohibit and do not tolerate discrimination against employees, applicants, or any other covered persons because of race, color, sex, pregnancy status, age, national origin or ancestry, ethnicity, religion, creed, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, training, promotion, discipline, compensation, benefits, and termination of employment. We comply with the Americans with Disabilities Act (ADA), as amended by the ADA Amendments Act, and all applicable state or local law.Show more Report"
        ],
        "Hard Skills": [
            "Azure DevOps",
            "Entity Framework",
            "Microsoft Azure",
            ".NET Framework",
            "Software Design Patterns",
            "Unit Testing",
            "Agile Methodology",
            "Dependency Injection",
            "Continuous Delivery",
            "Business Requirements",
            "Marketing",
            "Software Engineering",
            "Mobile Application Development",
            "Scalability",
            "Customer Success Management",
            "Crash Reports",
            "Inversion Of Control",
            "SQL (Programming Language)",
            "Testability",
            "Xamarin",
            "Version Control",
            "Remote Monitoring",
            "Database Design",
            "Computer Science",
            "Software Development",
            "Back End (Software Engineering)"
        ],
        "Soft Skills": [
            "Curiosity",
            "Customer Service"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-systems-technology-and-research-inc-JV_KO0,17_KE18,53.htm?jl=1008920808825": {
        "Location": "Alabama",
        "Data": [
            "Job Description: Systems Technology and Research, Inc. (STaR) is seeking a Software Engineer in the Huntsville, AL area to support a PEO Aviation project office. Candidates should be highly motivated, a self-starter and be able to handle multiple tasks. Candidates will participate in activities to ensure on time implementation deliverables are met including day-to-day planning and coordination with testers, other developers, project managers and business representatives. Qualifications/Experience: A Bachelor of Science degree is preferred with at least 10 years of professional experience and 8 years of direct experience in Software Engineering Experience with software engineering fundamentals (data structures, algorithms, design patterns) Self-driven, customer focused performer Ability to obtain a DOD Secret Clearance; Interim Secret is required to begin work Experience working on DoD development programs Job Duties: Serve as an embedded software engineer for an Army Aviation Program Manage Office (PMO). Work with internal and external stakeholders to provide Software Engineering support to assist in program planning, development, and sustainment activities on engineering efforts. Support, ensure successful utilization, and defend the PEO Aviation and Army Aviation PMO MOSA and MBSE strategies, processes, and development techniques. Represent the Product Office in technical reviews as required to accomplish the mission to include System Requirements Reviews (SRRs), In-Process Reviews, (IPRs), Technical Interchange Meetings (TIMs), Preliminary Design Reviews (PDRs), Critical Design Reviews (CDRs), Test Readiness Reviews (TRRs), and Safety Review Boards associated with systems engineering activities. Support development and integration oversight of aircraft and ground mission computer products. Support and execute software integration processes of systems, subsystems, and components for Army Aviation systems. Preform the analysis of software requirements to ensure bi-directional traceability and completeness. Present high-level technical briefings on development and integration efforts to senior leadership. Capture and resolve action items to provide solutions in the areas of cost, schedule, performance, and processes associated with the day-to-day project execution. Participates in team and program planning events to achieve alignment.Show more Report"
        ],
        "Hard Skills": [
            "Software Design Patterns",
            "Software Technical Review",
            "Embedded Software",
            "Software Analysis",
            "Project Management",
            "Project Management Office (PMO)",
            "Secret Clearance",
            "Algorithms",
            "Model Based Systems Engineering",
            "Software Engineering",
            "Data Structures",
            "Critical Design Review (CDR)",
            "Project Implementation",
            "Engineering Design Process",
            "Systems Engineering",
            "Traceability"
        ],
        "Soft Skills": [
            "Customer Service",
            "Self-Motivation",
            "Planning",
            "Coordinating",
            "Research",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-archarithms-inc-JV_KO0,17_KE18,33.htm?jl=1008882760059": {
        "Location": "Alabama",
        "Data": [
            "WE ARE ARCARITHM, and we are changing the world!  If you are ready to grow your career and change the world with us, then join the Arcarithm team!  We are located in beautiful, downtown Huntsville, AL, one of the fastest growing cities in the U.S.! At Arcarithm, we cultivate and foster an environment of integrity, open communication, work life balance, and career development. We are committed to investing in our employees by offering comprehensive health insurance options, a generous 401K plan, competitive salaries, continuous career growth opportunities, flexible schedules including remote work, mentoring and performance incentives.  Arcarithm is currently seeking top talent in the areas of full stack software development, artificial intelligence, optimization, and data analytics. You will work in a dynamic and challenging environment alongside our customers which include Lockheed Martin, General Dynamics, Northrop Grumman, Raytheon, US Army, US Navy, US Air Force, the Missile Defense Agency, and NASA on cutting edge technologies including machine learning, augmented and virtual reality, big data analytics, and more!  We are excited to continue to change and improve the world through innovation and technology! Contact us today to hear more about Arcarithm and all we offer!  Job Title: Software Engineer  Job Location: Huntsville, Alabama  Responsible for the design, development, testing, verifying, sustaining and fully documenting developed software. Develops complex software applications involving graphical front-end interfaces, visualization toolsets, SQL Database interfaces, multi-user GUI interfaces, and rule base assessments. Works with application Product Owner to decompose Use Case entities into implemental software requirements. Performs software analysis, code analysis, requirements analysis, software reviews, software risk analysis, and software reliability analysis. Performs analysis on new software developments and revisions to existing systems to enhance system efficiencies. Responsible for software testing and user/system requirements verification/validation processes and procedures. Troubleshoots production problems related to deployment of software applications. Evaluates implemented requirements in software to determine if these requirements were met in deliverable software. Assists in the evaluation and recommendation of application integration and testing tools. Participates in development of software user manuals and technical reports. Works with project leads, developers, and end users to ensure application designs meet business requirements. Understands MDA test processes related to data management, scheduling, planning and commitments across all types of tests.  Arcarithm is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.Show more Report"
        ],
        "Hard Skills": [
            "Application Design",
            "Reliability Analysis",
            "Virtual Reality",
            "Graphical User Interface",
            "Software Testing",
            "Development Testing",
            "Full Stack Development",
            "Enterprise Application Integration",
            "Machine Learning",
            "Scrum (Software Development)",
            "Business Requirements",
            "SQL (Programming Language)",
            "Verification And Validation",
            "Requirements Analysis",
            "Code Analysis",
            "Risk Analysis",
            "Artificial Intelligence",
            "Software Engineering",
            "Software Analysis",
            "Test Tools",
            "Big Data Analytics",
            "Big Data",
            "Data Analysis",
            "Software Development",
            "Data Management",
            "Front End (Software Engineering)",
            "System Requirements"
        ],
        "Soft Skills": [
            "Planning",
            "Scheduling",
            "Communications",
            "Innovation",
            "Mentorship"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-pvm-inc-JV_KO0,24_KE25,32.htm?jl=1008941627453": {
        "Location": "Alabama",
        "Data": [
            "Sr. Software Engineer  Huntsville, Alabama  *On-Site*  TS clearance or higher required PVM, Inc is actively seeking an experienced Senior Software Engineer, to design, develop and support technical solutions and apply a variety of best practices. Specifically in this role, you’ll have an opportunity to solve technical challenges, work on complex, enterprise applications and develop solutions that will have a meaningful impact on U.S. DOJ operations. Responsibilities: Diagnose and resolve technical issues in highly interconnected and integrated enterprise applications Derive technical requirements from statements of capability needs Manage and communicate requirements throughout the software development lifecycle, including requirements prioritization, requirement changes, and conflict resolution. Develop, test, and deploy enhancements to existing systems while working with key customers, other team members, and management. Perform system analysis, testing and debugging to defect root cause Proficiency in programming languages: Should have a strong understanding of at least one programming language and be able to write efficient and maintainable code. Specific languages we desire are Java and Python. They should also be able to learn and adapt to new programming languages as needed. Knowledge of software development methodologies: Should be familiar with agile methodologies and be able to apply them effectively in a team environment. Experience with software design patterns: They should have a good understanding of common software design patterns and be able to apply them to solve complex problems. Strong debugging and troubleshooting skills: An intermediate software engineer should be able to identify and resolve technical issues in code and be able to work independently to find solutions. Good communication and collaboration skills: Candidate should be able to work effectively in a team environment, communicate clearly and professionally, and be able to collaborate with other team members to deliver high-quality software products. Requirements: ACTIVE TS CLEARANCE OR HIGHER WITH SCI ELIGIBILITY REQUIRED* 7-8 years of object-oriented software development experience in Java. Strong understanding and application of fundamental object-oriented design principles Strong understanding of messaging integration patterns Ability to ideate and develop solutions from concept to completion Ability to respond to after-hours emergencies (rare occurrences) Ability to work on client site (no remote work available) Education: BS/BA or equivalent experience Tools: Data/ML Pipelines using S3, Athena, Glue, Airflow, Kinesis or Kafka, and Sagemaker Serverless Apps using S3, Lambda, Step Functions, API Gateway, AppSync, and Cognito Experience/understanding of Infrastructure as Code, Cloud Native, AWS, and Serverless High technical standards demonstrated using design patterns, clean coding, peer reviews, and unit testing Experience with AWS GovCloud, DoD Risk Management Framework (RMF) is a plus Salary: $122,000- $135,000 Skills: Proactive Self-starter Process driven and project management skills Demonstrated superior organizational skills Exemplary communication and time management skills Excellent verbal and written communication skills Experience/Strong Proficiency in ETL development. Knowledge of ETL concepts, tools and data structures Ability to perform complex data analysis and troubleshooting Strong multitasking skills Ability to work independently Ability to work under pressure and meet time sensitive deadlines Why PVM?  At PVM, we mean it when we say we value diversity. As a PVM team member, you will work with people from all different backgrounds that are passionate about the problems we solve for our customers and are focused on delivering value for our clients. Our culture encourages problem solving, leadership, and innovation, and creates an environment that will support your professional and personal growth. Here are a few highlights of the advantages of being a part of the PVM community: Opportunities for growth and advancement Tuition/Training reimbursement Peer bonus program Remote and on-site positions available Unlimited PTO Flexible work schedule PVM delivers digital services that help government agencies unlock the power of their data for good and maximize the value of their technology investments. We design, develop, and deploy solutions to solve mission-critical problems. PVM is a black- and service-disabled veteran-owned small business and was founded by a retired Naval officer out of frustration with the status quo with one goal in mind: to help his fellow Shipmates solve the problems they were facing every day. Today, we continue to be driven by that same goal, and are focused on taking on our clients’ missions as our own to make a difference in the communities we serve.  PVM believes in equal opportunity employment. We won't discriminate against any employee or applicant based on race, gender, nationality, age, religion, disability, military status, or sexual orientation. As a company and as individuals, we're committed to providing an inclusive and welcoming environment for our team, our family members, and our clients.Show more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Requirement Prioritization",
            "Systems Analysis",
            "API Gateway",
            "Software Design Patterns",
            "Cloud-Native Computing",
            "Apache Kafka",
            "AWS Kinesis",
            "Serverless Computing",
            "Agile Methodology",
            "Python (Programming Language)",
            "Conflict Resolution",
            "Process Driven Development",
            "Object-Oriented Design",
            "Infrastructure as Code (IaC)",
            "Project Management",
            "Java (Programming Language)",
            "Risk Management Framework",
            "Machine Learning",
            "AWS SageMaker",
            "Technical Standard",
            "Data Structures",
            "Peer Review",
            "Extract Transform Load (ETL)",
            "Unit Testing",
            "Software Engineering",
            "Amazon Cognito",
            "Amazon S3",
            "Software Development Methodologies",
            "Software Development Life Cycle",
            "Amazon Web Services",
            "Apache Airflow",
            "Top Secret-Sensitive Compartmented Information (TS/SCI Clearance)",
            "Data Analysis",
            "Software Development"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Collaboration",
            "Communications",
            "Time Management",
            "Multitasking",
            "Writing",
            "Organizational Skills",
            "Complex Problem Solving",
            "Problem Solving",
            "Leadership",
            "Management",
            "Innovation",
            "Operations"
        ]
    },
    "https://www.glassdoor.com/job-listing/bm-software-engineer-ierus-technologies-inc-JV_KO0,20_KE21,43.htm?jl=1008898147754": {
        "Location": "Alabama",
        "Data": [
            "IERUS specializes in electromagnetic spectrum technologies and design for RF, IR, and optical applications. IERUS also supports customers with a diverse set of competencies including software development, air and missile defense, and systems engineering. IERUS develops value for our defense and commercial customers through accelerations of the technology life cycle: identifying, creating, transitioning, and producing technologies with integrity of purpose and product. IERUS is looking for bright, talented, motivated, and dedicated employees in the engineering field, and offers competitive compensation and benefits package. To learn more, please visit www.ierustech.com Description: This is an opportunity to join the IERUS team as a Software Engineer supporting a large Missile Defense Agency program. The ideal candidate will have a minimum of 3-5 years’ experience. The candidate will be key contributor to the design and development of Java-based applications. Candidate will help generate software design artifacts, implement software changes, support design and code reviews, support software testing and resolution of issues arising from software testing. Candidate may also be involved in the design and development of MATLAB based algorithms within Track Services. Required Qualifications:  B.S., M.S., or Ph.D. in an engineering discipline; Computer Science, Mathematics, Physics, or Engineering and 3+ years experience with advanced degree or 5+ years experience with bachelors or equivalent. Experience in full life cycle software development of Java-based applications and systems. Hands-on development experience for Java-based applications in a UNIX/Linux platform environment. Experience developing software in a structured, process-based integrated team environment. Proficient in mathematical algorithm development or translating mathematical algorithm design into software. Comfortable with mathematical algorithm development or translating mathematical algorithm design into software. Use of common software development and management tools such as Git and Eclipse Understanding of standard system engineering design artifacts such as System requirements, use cases and SysML diagrams  Desired Qualifications:  Command and control system application development Experience with Software Integration testing Strong problem-solving skills, including the ability to review performance, identify root cause and recommend a solution.  Location: Huntsville, AL IERUS Technologies is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age, or any other federally protected class. IERUS Technologies participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Code Review",
            "Application Development",
            "Systems Engineering",
            "Software Testing",
            "Unix",
            "Algorithm Design",
            "Git (Version Control System)",
            "Linux",
            "Algorithms",
            "Eclipse (Software)",
            "Technology Life Cycle",
            "Control Systems",
            "Java (Programming Language)",
            "MATLAB",
            "Software Development",
            "Software Engineering",
            "Computer Science",
            "Systems Integration",
            "Physics",
            "System Requirements",
            "Systems Modeling Language"
        ],
        "Soft Skills": [
            "Mathematics",
            "Problem Solving",
            "Management"
        ]
    },
    "https://www.glassdoor.com/job-listing/lead-software-engineer-ibm-i-rpg-and-microsoft-net-trisian-global-consulting-llc-JV_KO0,50_KE51,80.htm?jl=1008866224993": {
        "Location": "Alabama",
        "Data": [
            "Lead Software Engineer - IBM i RPG and Microsoft .NetWe are seeking a Lead Software Engineer - IBM i RPG and Microsoft .Net. Responsible for designing, coding, testing, implementing, maintaining, and supporting software systems. Works closely with business analysts and customers to gather requirements to ensure the customer’s business needs and expectations are met in a timely and cost-effective manner. Diagnoses, isolates, and de-bugs software problems and provides resolution. Prepares and modifies technical documentation. Researches, evaluates, and recommends new development tools and applications as appropriate. May be responsible for managing work within a project.ResponsibilitiesAnalysis and Design. Research, compiles, and evaluates information used in the development and maintenance of large and complex systems and processes to satisfy business needs.Designs large and complex systems and/or support processes that meet customer requirements while effectively interacting with existing systems/support processes.Programming and Testing. Constructs, modifies, and tests large and complex system changes.Problem determination and resolution. Quickly diagnoses complex problems; determines and implements quality solutions in a timely fashion. This covers all areas of production support and daily problem research and resolution. Production incidents need prompt attention and correction to reduce impact on the business area.Documentation. Provides thorough and complete documentation for all programming changes and enhancements. Documentation must meet corporate standards.Business Knowledge and Interaction: Understands the business needs of the customer and provides quality customer support by providing appropriate communication, anticipating customer needs and/or problems, and understanding the broad impact of changes on all customer processes. Provides appropriate solutions and proactively suggests process improvements.Project / Task Management. Performs project management duties for the technical aspects of large and complex projects as needed depending on the nature of the project. Manages individual tasks on large projects to ensure that all tasks are delivered according to the project plan.IT Influence/Leadership. Provides leadership as a model of how others should interact and accomplish tasks. Is considered 'a top expert' by peers in one or more important areas of expertise, such as, a programming language, computer system, data base, etc. Provides an appropriate level of feedback to peers, support and interface areas, and management. Willingly shares and assists in the development of others.Experience/EducationTechnology – 5-10 years’ experience with the following:C# .NET Development Experience - RequiredSQL for CRUD operations – RequiredIBM I Development Experience – Highly Preferred.Net WinForms Development - PreferredIBM RPG Free Format Experience - Highly PreferredIBM DB2 Database Experience - Highly PreferredPost-secondary degree, preferably in Management Information Services, Computer Science or Math related field - may substitute for up to 4 years of work and/or technical experience.10+ years of applicable work and/or technical experience in languages/environments is preferred.Technical certifications are desirable and may substitute for some work and/or technical experience. (Microsoft Certifications, etc.)Recognized expertise in their assigned areas of responsibility.Demonstrates a thorough, detailed working knowledge of relevant technologies.Responsible for designing and implementing how the technologies will be incorporated in current systems or will be used in development of very complex new systems.Demonstrates a thorough, detailed understanding of various data structures.Requires programming skills sufficient to solve difficult and complex technical problems.Must be able to manage multiple, changing priorities, resolve conflicts and be able to work well under pressure.Must be self- motivated, able to work independently and willing to self-teach and take responsibility for ongoing professional development.Ability to analyze and design software solutions to meet complex requirements.Requires strong oral and written communication skills sufficient to communicate clearly with peers and customers.Job Type: Full-timeBenefits:401(k)Dental insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:8 hour shiftMonday to FridaySupplemental pay types:Bonus opportunitiesWork Location: In personShow more Report"
        ],
        "Hard Skills": [
            "Software Systems",
            "IBM DB2",
            "Customer Support",
            "Design Software",
            "Project Management",
            "C# (Programming Language)",
            "Windows Forms",
            "Technical Documentation",
            "Microsoft Certified Professional",
            ".NET Development",
            "Data Analysis",
            "Design Research",
            "Open Format",
            "Software Engineering",
            ".NET Framework",
            "Computer Science",
            "Programming Tools",
            "Task Management"
        ],
        "Soft Skills": [
            "Mathematics",
            "Influencing Skills",
            "Communications",
            "Writing",
            "Self-Motivation",
            "Management",
            "Operations",
            "Research",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-software-management-professional-navigator-development-group-inc-JV_KO0,50_KE51,82.htm?jl=1008947116913": {
        "Location": "Alabama",
        "Data": [
            "Job: Software Engineer/Software Management Professional Location: Redstone Arsenal, Alabama Position: Full time Clearance: SECRET IS REQUIRED Required: SECRET security clearance. B.S. in a technical field such as Computer Engineering, Electrical Engineering, Computer Science. Minimum 5+ years relevant experience. Experience supporting a Government Project or Product Office in an acquisition organization such as PEO AVN or PEO M&S. Accomplished self-starter with the ability to work in a small team with minimal supervision. Experience collaborating with project or product office personnel. Experience with open standards such as FACE Technical Standard, HOST Standard, SOSA Technical Standard, VICTORY, OMS, etc. Provide key software technical expertise for documentation review, analysis of Program or Contractor metrics, schedule, and cost estimates. Identify and track software risk areas for the program and implement risk mitigation plans. Assist PMs, or other customers, to generate metrics and measurement techniques to provide program office leadership with timely and accurate information on the state of ongoing and planned efforts. Assist PMs in development of cybersecurity documentation and coordination of cybersecurity test events. Develop/Review system/subsystem specifications, system architectures, program briefings, white papers, and other products. Experience developing contract language and requirements, reviewing, and evaluating contractor deliverables. Desired Program Management or Project Management experience. Preferred Experience: Army Aviation platforms such as Apache, Blackhawk, Chinook, UAS, FLRAA or FARA. Knowledge of at least one Object-Oriented Programming (OOP) language. Using common Model-Based Systems Engineering tools (e.g., Cameo, Rhapsody, etc.). Experience using issue-tracking software such as Jira or Git Experience. Navigator is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.Show more Report"
        ],
        "Hard Skills": [
            "Object-Oriented Programming (OOP)",
            "Model Based Systems Engineering",
            "Open Standards",
            "Secret Clearance",
            "Git (Version Control System)",
            "JIRA",
            "Risk Mitigation",
            "Project Management",
            "Technical Standard",
            "Cyber Security",
            "Software Project Management",
            "Computer Engineering",
            "Software Engineering",
            "Computer Science",
            "Electrical Engineering"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Program Management",
            "Supervision",
            "Coordinating",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-optical-sciences-corporation-JV_KO0,17_KE18,46.htm?jl=1008877335161": {
        "Location": "Alabama",
        "Data": [
            "Qualifications:REQUIRED: BS in computer science, physics or engineering with 5+ years of relevant programming experience. Candidate should be familiar with C++ code development within the Linux operating environment, including GUI development using tools such as Qt and FLTK.Candidate must meet eligibility requirements for access to classified information.PREFERRED:Experience/familiarity with:Development/operation under a real-time operating environment such as RedHawk.Various hardware interfaces such as VME, PCI, PCIe and PCIx.Communication protocols such as RS232/RS422/RS485 and MIL-STD 1553.Use of higher-level language tools, such as Matlab and Python, for digital/analog signal and image processing.Current security clearance.Job Type: Full-timePay: $100,000.00 - $150,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offTuition reimbursementSchedule:Monday to FridaySupplemental pay types:Bonus opportunitiesEducation:Bachelor's (Required)Experience:programming: 5 years (Preferred)Security clearance:Secret (Preferred)Work Location: In personShow more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "Linux",
            "Graphical User Interface",
            "Security Clearance",
            "Qt (Software)",
            "RS-422",
            "Python (Programming Language)",
            "RS-485 Standard",
            "Military Standards And Specifications",
            "RS-232",
            "MATLAB",
            "Hardware Interface Design",
            "Computer Science",
            "PCI Express",
            "Physics"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/frontend-software-engineer-saic-JV_KO0,26_KE27,31.htm?jl=1008908531358": {
        "Location": "Alabama",
        "Data": [
            "Job ID: 2313717 Location: HUNTSVILLE, AL, US Date Posted: 2023-10-03 Category: Software Subcategory: SW Engineer Schedule: Full-time Shift: Day Job Travel: Yes, 10 % of the Time Minimum Clearance Required: Interim Secret Clearance Level Must Be Able to Obtain: Secret Potential for Remote Work: No Description SAIC is seeking a Frontend Software Engineer to join our team in Huntsville, AL at Redstone Arsenal.  Program Overview  The Network, System Integration and Test Environment (NSITE) is a Government owned, managed, and developed software suite. NSITE is used by the Missile Defense Agency (MDA), Joint Services, and numerous labs in support of continued testing of systems employed for defense of the United States and our Allies. The NSITE software provides data collection, situational awareness, and analysis capabilities to a wide range of users who benefit from NSITE’s ability to act as an independent third-party truth teller. The NSITE team has in-depth experience in Tactical Data Links (TDL), Ballistic Missile Defense System (BMDS) Test, Enterprise Information Technology, Software and Systems Engineering and Information Assurance. Duties and Responsibilities  Responsible for designing, developing, deploying, and maintaining the NSITE software application. Work on a small agile development team where success is defined by the ability to understand your path forward, effectively communicate that path, and complete the task inherent to that path in a timely matter. Research advancements in computer science and related fields to help steer the product toward long term success. Communicate with leadership and the customer to ensure a common understanding of requirements. Document your work for the benefit of your teammates, the user, leadership, and posterity. Identify and solve challenging problems by writing performant, clean, and practical code.  Qualifications Education Requirements:  Bachelor’s degree in Software Engineering, Computer Science, Computer Engineering, or equivalent 5 years experience working with Software Design and Development. Six (6) years' experience may be accepted in lieu of degree (per contract vehicle).  Clearance Requirements:  Must possess an active Secret security clearance or have the ability to obtain one; US Citizenship required.  Required Qualifications:  Proficient in C#, and in Microsoft .NET Proficient in WPF with MVVM patterns Ability to build an intuitive User Interface (UI) Knowledge of modern software engineering practices, including Agile methodologies Ability to analyze a requirement, generate a design, and produce efficient, robust, and testable software Ability to understand, and evaluate C# code and develop corresponding unit test(s) Mastery of computer science fundamentals, independent of a specific language  Preferred Qualifications:  Familiarity with WPF based control sets such as DevExpress, Telerik, or Infragistics Past experience of building applications with .NET using ASP.NET or Windows Forms. Familiarity with Extensible Application Markup Language (XAML). Understanding of and experience with secure programming techniques. Knowledge of tactical and simulation data links (specifically Link 16, JREAP, DIS, VMF, CMF and XML). Experience working with Microsoft Visual Studio Experience with using Git version control, JIRA, and Gitlab as software management tools. Experience with InstallAware.  Currently have an Information Assurance Technical certification (CompTia A+, Net+, or Sec+) or the ability to obtain one Covid Policy: SAIC does not require COVID-19 vaccinations or boosters. Customer site vaccination requirements must be followed when work is performed at a customer site.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Extensible Application Markup Language",
            "Information Assurance",
            "Software Suite",
            ".NET Framework",
            "Extensible Markup Language (XML)",
            "Agile Methodology",
            "Secret Clearance",
            "Link 16",
            "Git (Version Control System)",
            "Secure Programming",
            "CompTIA A+",
            "Microsoft Visual Studio",
            "ASP.NET",
            "Unit Testing",
            "JIRA",
            "Infragistics",
            "Software Engineering",
            "DevExpress",
            "Tactical Data Link",
            "Telerik",
            "Front End Design",
            "C# (Programming Language)",
            "Model View ViewModel",
            "Testability",
            "CompTIA Security+",
            "CompTIA Network+",
            "Software Project Management",
            "Windows Forms",
            "Computer Engineering",
            "Windows Presentation Foundation",
            "Systems Engineering",
            "Computer Science",
            "Gitlab",
            "Version Control",
            "User Interface (UI)",
            "Systems Integration",
            "Data Collection"
        ],
        "Soft Skills": [
            "Information Technology",
            "Research",
            "Writing",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/it-technical-specialist-iv-programmer-analyst-iv-remote-hybrid-optional-university-of-alabama-JV_KO0,71_KE72,93.htm?jl=1008948426109": {
        "Location": "Alabama",
        "Data": [
            "Tuscaloosa, Alabama, United States  Academic Affairs  Information Systems/Technology Support  Regular Full-time (Benefits eligible)  Closing at: Nov 9 2023 at 22:55 CST  Pay Grade/Pay Range: Based on Qualifications  Department/Organization: 200721 - Enterprise Technology  Normal Work Schedule: Monday - Friday 8:00am to 4:45pm  Note to Applicants: Position is eligible for remote work subject to University policy.  Job Summary: The IT Technical Specialist IV performs advanced IT activities for specialized, complex and/or functional areas requiring the expert knowledge and professional application of IT principles, practices and techniques in accordance with industry standards and university policy. Requires a great amount of evaluation, originality or ingenuity. May be responsible for training, assisting or supervising lower level IT personnel and other staff. May lead projects and cross-functional activities.  Additional Department Summary: The IT Technical Specialist IV designs, develops, and supports complex software systems to support the administrative function of the university. Develops processes and web applications using Laravel with PHP and .NET with C#. Manages application server and deployments via tools such as Docker, Git, and Kubernetes. Installs, customizes, supports, and creates integrations for vendor-supplied software systems, including Ellucian Banner (Self-Service 9 and Admin). Analyzes and resolves problems arising with the use of software systems. Works on a team and collaborates with specific departments, colleges, and customers around campus (University Registrar, HR, Enterprise Operations, etc.). Supports their needs, troubleshoots, and resolves issues. Responds to their questions and concerns in a timely manner. Leads software projects independently and mentors other developers.  Required Minimum Qualifications: Master's degree and one (1) year of IT experience; OR Bachelor's degree and three (3) years of IT experience; OR Associate’s degree and five (5) years of IT experience; OR High School Diploma or GED and seven (7) years of IT experience. Knowledge of advanced programming, networking, system, multimedia, instructional or security technology skills or knowledge of project management methods and applications. May require advanced level training or certification.  Additional Required Department Minimum Qualifications: Three (3) years of experience developing and maintaining software applications, working with relational database management systems, computer programming, web development, system administration, or related IT field. Some experience working with git version control, CSS, and web accessibility. Some experience working with relational databases (oracle, MySQL, etc.).  Skills and Knowledge: Advanced knowledge of HTML, C#, and JavaScript programming languages. Ability to effectively communicate, verbally and in writing, with users of varying degrees of technical ability and understanding. Advanced problem-solving skills. Strong desire to be continuously learning. Effective time management skills. Ability to work independently on multiple projects simultaneously.  Preferred Qualifications: Knowledge of the .NET framework. Experience with react, vue js or tailwind css. Prior experience working with containers (Docker).  Background Investigation Statement: Prior to hiring, the final candidate(s) must successfully pass a pre-employment background investigation and information obtained from social media and other internet sources. A prior conviction reported as a result of the background investigation DOES NOT automatically disqualify a candidate from consideration for this position. A candidate with a prior conviction or negative behavioral red flags will receive an individualized review of the prior conviction or negative behavioral red flags before a hiring decision is made.  Equal Employment Opportunity: The University of Alabama is an Equal Employment/Equal Educational Opportunity Institution. All qualified applicants will receive consideration for employment or volunteer status without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, gender expression, pregnancy, age, genetic or family medical history information, disability, protected veteran status, or any other legally protected basis, and will not be discriminated against because of their protected status. Applicants and employees of this institution are protected under Federal law from discrimination on several bases.Show more Report"
        ],
        "Hard Skills": [
            "Relational Databases",
            "Software Systems",
            "JavaScript (Programming Language)",
            "MySQL",
            "Medical History Documentation",
            ".NET Framework",
            "Docker (Software)",
            "React.js (Javascript Library)",
            "Git (Version Control System)",
            "Kubernetes",
            "Self Service Technologies",
            "Academic Affairs",
            "PHP (Scripting Language)",
            "Application Servers",
            "System Administration",
            "Security Technology",
            "Project Management",
            "Vue.js (Javascript Library)",
            "C# (Programming Language)",
            "Web Accessibility",
            "Laravel",
            "HyperText Markup Language (HTML)",
            "Relational Database Management Systems",
            "Computer Programming",
            "Cascading Style Sheets (CSS)",
            "Version Control",
            "Web Development",
            "Web Applications",
            "Information Systems"
        ],
        "Soft Skills": [
            "Ingenuity",
            "Time Management",
            "Problem Solving",
            "Operations"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-digital-signal-processing-dsp-firmware-engineer-dynetics-JV_KO0,54_KE55,63.htm?jl=1008948509251": {
        "Location": "Alabama",
        "Data": [
            "Dynetics, a wholly owned subsidiary of Leidos, is seeking a talented Senior DSP Firmware Engineer to join a talented team of engineers and scientists focused on real-time data analysis solutions for state-of-the-art RF collection systems. With offices across the United States engaging in the defense, space, cyber and commercial fields, Dynetics provides responsive, cost-effective engineering, scientific and IT solutions. Dynetics’ National Intelligence Department’s primary mission is to analyze, understand, and exploit foreign threats. The ideal candidate for this position will lead and support DSP firmware development efforts across multiple projects and specialized RF platforms. Basic Qualifications Bachelor's of Science in Electrical Engineering, Computer Engineering, or equivalent degree from an ABET-accredited institution. 12+ years experience in FPGA firmware development from architecture through implementation, simulation, and hardware testing or 10+ years with a relevant MS degree Proven experience with hardware description languages such as VHDL or Verilog Comprehensive understanding of digital signal processing techniques for communications and/or radar. Hands-on laboratory experience with instrumentation, test equipment, and debug/test methods for proving out FPGA development on hardware Highly motivated personality with the ability to work independently and across a collaborative team environment Candidates must be a resident of the North Alabama area or willing to relocate to the Huntsville - North Alabama, AL area Other Qualifications Familiarity or experience with any of the following would be a plus: Zynq UltraScale+ MPSoC / RFSoC Architecture Virtex UltraScale+ Architecture Zynq-7000 SoC Architecture Xilinx IP Integrator High speed ADCs/DACs RF system design PCB layout and design Security Requirements Candidate must be a US Citizen and possess (and be able to maintain) a Final Top Secret/SSBI Clearance or meet the eligibility to obtain (and maintain) a Final Top Secret Clearance.Show more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Digital Signal Processing",
            "Field-Programmable Gate Array (FPGA)",
            "Firmware Development",
            "Security Requirements Analysis",
            "Real Time Data",
            "Laboratory Experience",
            "Systems Design",
            "Test Equipment",
            "Computer Engineering",
            "Verilog",
            "VHSIC Hardware Description Language (VHDL)",
            "Firmware",
            "Printed Circuit Board",
            "Hardware Description Language (HDL)",
            "Electrical Engineering",
            "Radar",
            "Simulations"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Communications"
        ]
    }
}