{
    "https://www.glassdoor.com/job-listing/release-analyst-sanoh-america-inc-JV_KO0,15_KE16,33.htm?jl=1008942883507": {
        "Location": "Alabama",
        "Data": [
            "GENERAL SUMMARY (Describe the overall duties and responsibilities of the job):  Effective administrative coordination of all shipments in and out of the manufacturing facility ESSENTIAL DUTIES AND RESPONSIBILITIES (Duties required for successful job performance):  Process all incoming Electronic Data Exchange (EDI) and barcoding orders in the ERP system, including all special orders, Prototype orders, or service orders Facilitate accurate data entry: Enter and maintain accuracy of all manual entry customer orders; Ensure customer billing is timely and accurate; Ensure that Advance Ship Notices are timely and accurate; Enter master data into the ERP system in an accurate and timely manner; Communicate customer requirements to Production group; Act as liaison between Sanoh functions and the customer Interface with Shipping Team Leaders and shipping associates for shipping requirements and information to prioritize loads Interface with and coordinate logistics with carriers Investigate shipping discrepancies with Finance Works within and maintains customer portals for all required information. Specific customer requirements may be assigned outside normal duties (ex. FLA packaging) Verifies and updates shipping work instructions to cover all customer requirements for floor and office. Orders office and packaging supplies as needed REQUIRED EDUCATION and/or EXPERIENCE (These are the traditional minimum, or required, bona-fide occupational qualifications and other requirements of most people in this job).  High school diploma, GED, or equivalent experience Minimum one year experience in a Materials Planning, Shipping support, or equivalent experience REQUIRED SKILLS AND ABILITIES (Those needed to perform the essential functions of the job). Effective interpersonal, written and verbal communication skill Effective organizational and time management skills; Able to manage multiple projects and deadlines Basic knowledge of MS-Office and Plex Ability to read and follow written or verbal instructions, procedures, and policies Ability to apply basic math skills and accurately input and analyze data Basic understanding of materials management and logistics REQUIRED DECISION-MAKING AND ORGANIZATION IMPACT (Describe the typical types of decisions made by employees in this job and the likely impact of those decisions on the Company).  This position is responsible for a variety of data entry tasks. If these are not done accurately, results could include discrepancies between customer needs and what we supply them, incorrect / inadequate supply of materials, and incorrect billing. REPORTING RELATIONSHIPS (Indicate job titles for this job’s supervisor and direct reports).  This position reports directly to the Material Manager This position has no direct reports WORKING CONDITIONS (Describe the environment within which the work is performed).   Office environment, with periodic trips to the manufacturing floor  Overtime of varying levels may be required PHYSICAL REQUIREMENTS Able to travel throughout shipping, materials storage, and manufacturing areas Requires keyboarding and computer usage.Show more Report"
        ],
        "Hard Skills": [
            "Advance Ship Notice",
            "Data Exchange",
            "Materials Management",
            "Finance",
            "General Mathematics",
            "Materials Planning",
            "Barcoding",
            "Data Entry"
        ],
        "Soft Skills": [
            "Packaging And Labeling",
            "Verbal Communication Skills",
            "Decision Making",
            "Time Management",
            "Coordinating"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-requirements-development-engineer-jacobs-JV_KO0,42_KE43,49.htm?jl=1008962364147": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-torch-technologies-inc-JV_KO0,17_KE18,40.htm?jl=1008960982282": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineers-sahbi-systems-JV_KO0,18_KE19,32.htm?jl=1008810053011": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-test-engineer-integration-innovation-inc-JV_KO0,22_KE23,49.htm?jl=1008941958348": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/entry-level-c-software-engineer-analyst-intuitive-research-and-technology-corporation-JV_KO0,39_KE40,85.htm?jl=1008948953264": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-cimarron-software-JV_KO0,17_KE18,35.htm?jl=1008909532058": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-embedded-engineer-saic-JV_KO0,26_KE27,31.htm?jl=1008936428754": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/mid-level-software-engineer-platform-ctt-boeing-intelligence-and-analytics-JV_KO0,40_KE41,74.htm?jl=1008726848666": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-–-junior-level-integration-innovation-inc-JV_KO0,32_KE33,59.htm?jl=1008934441541": {
        "Location": "Alabama",
        "Data": [
            "Overview:  i3 is seeking a Software Engineers to provide technical support in defense acquisition, with a focus on agile software development and digital engineering tools and processes in the development of unmanned aircraft systems and control stations. Candidates will provide technical support in defense acquisition, with a focus on agile software development and digital engineering tools and processes. This role will be supporting the recently awarded Uncrewed Aircraft Systems (UAS) Technical Contract. This position provides support to the UAS Product Office (PO) at Redstone Arsenal, AL. This position is located in Huntsville, AL. Responsibilities: Develop, modify, and enhance software models in current tools such as CAMEO. Research, design, and develop computer and networks for the Gray Eagle system specialized utility programs. Support Agile processes such as SCRUM and cyber focused implementation activities; collaborate between cross-functional teams both in the project office and with the software developers. Analyze user requirements and develop/evaluate software solutions. Support review of software change request for correctness and impacts to the overall system capabilities. Work with senior software engineers to support schedules, contracting documentation, and costing. Follow program office processes and assist with ensuring proper software processes are followed across all EUAS software projects from the aircraft to the ground station, etc. Monitor/ utilize development tools to update tasks and stories, check-in, and version control. Analyze architectural and functional requirements, specifications, and interfaces. Evaluate detailed software specifications and designs. Monitor/review software and system integration and testing functions. Monitor implementation of development standards including but not limited to Mil-STD-882E, FACE, and others. Knowledge of C and C##, Matlab, CAMEO, and Doors. Help with presentations and development of course of actions to upper management. Qualifications: Bachelor's degree in electrical engineering, Electronics Engineering or Computer Engineering from a college program with ABET (Accreditation Board for Engineering and Technology, Inc.) certification. 2 - 5 YOE with a willingness to learn new processes. Experience with software development, performing software requirements analysis, software design, software coding, software integration and software testing in a corporate or governmental Software Development Environment. Program Management Office experience desired. Knowledge of software engineering design, development, and management principles. Professional experience using Microsoft Office applications to include Excel, Outlook, PowerPoint, Project, and Word. Candidate must possess strong oral and written communication skills. Must be a self-starter that thrives in a dynamic team environment. Candidate must possess a proven ability to develop and provide reports to management. US Citizenship is required. Active DoD Secret security clearance and the ability to maintain such is required. About i3:  Headquartered in Huntsville, AL, i3 is a national leader in providing innovative technical and engineering solutions to a broad customer base across the U.S. DoD. Specializing in missile and aviation engineering and logistic services, electronic warfare and electromagnetic affects analysis, UAS system integration and flight operations, full lifecycle C5ISR engineering services, engineering analysis, cybersecurity and IT/IA innovative solutions and virtual training, simulation & serious game development and implementation. We were founded in 2007 with the intent to do business differently. Our focus is to leave our team members and customers better than we found them. Our ultimate goal is to strengthen our Nation and our warfighter. Perks and Benefits at i3: 100% team member owned Outstanding insurance coverage 401(k) match Health and wellness incentives Tuition and certification reimbursement Generous PTO Fun culture with company activities Countless opportunities to give back to the community through our charitable organization, i3 Cares We work hard. We compete hard. We play hard. Apply now to join us!Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Functional Requirement",
            "Electronic Engineering",
            "Software Requirements Analysis",
            "Agile Software Development",
            "Unmanned Aerial Systems (UAS)",
            "Video Game Development",
            "Secret Clearance",
            "Software Testing",
            "Software Engineering",
            "Project Management Office (PMO)",
            "Integrated Development Environments",
            "Change Requests",
            "Scrum (Software Development)",
            "User Requirements Documents",
            "Software Coding",
            "Utility Software",
            "Electronic Warfare",
            "Research Design",
            "Systems Integration",
            "Military Standards And Specifications",
            "Cyber Security",
            "Agile Methodology",
            "MATLAB",
            "Software Development",
            "Virtual Training",
            "Computer Engineering",
            "Programming Tools",
            "Version Control",
            "Engineering Analysis",
            "Electrical Engineering",
            "Technical Support"
        ],
        "Soft Skills": [
            "Presentations",
            "Self-Motivation",
            "Writing",
            "Willingness To Learn",
            "Microsoft Office",
            "Operations",
            "Management",
            "Microsoft PowerPoint",
            "Microsoft Excel",
            "Innovation",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/uas-software-systems-engineer-c2e-peopletec-inc-JV_KO0,33_KE34,47.htm?jl=1008933685829": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-gan-JV_KO0,17_KE18,21.htm?jl=1008725545645": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/jr-software-engineer-strategic-systems-inc-JV_KO0,20_KE21,42.htm?jl=1008965038263": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/computer-engineer-us-defense-contract-management-agency-JV_KO0,17_KE18,55.htm?jl=1008953648825": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-iii-children-s-of-alabama-JV_KO0,21_KE22,43.htm?jl=1007315089844": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/uas-software-engineer-peopletec-inc-JV_KO0,21_KE22,35.htm?jl=1008933685830": {
        "Location": "Alabama",
        "Data": [
            "Responsibilities: PeopleTec seeks a UAS Software Engineer is responsible for providing technical expertise in the development and qualification of software for uncrewed aircraft systems. Provides Subject Matter Expertise on software architecture and development standards such as FACE and DO-178. Familiar with Cybersecurity requirements for software systems. Able to evaluate and resolve software issues with fielded systems. Supports the specification, qualification, and airworthiness determination of integrated software subsystems. Effectively communicates with TUAS personnel, PM UAS and PEO functionals and staff, prime contractors and suppliers, user representatives, and Army airworthiness personnel. Supports the evaluation of cost, schedule, and performance of non-recurring engineering projects. Prepares and delivers reports and briefings to senior management describing program status, issues, analyses, findings, results, recommendations, and conclusions as appropriate.  Qualifications:  Bachelor's degree in electrical engineering, Electronics Engineering or Computer Engineering from a college program with ABET (Accreditation Board for Engineering and Technology, Inc.) certification. +4 years experience with a willingness to learn new processes. Experience with software development, performing software requirements analysis, software design, software coding, software integration and software testing in a corporate or governmental Software Development Environment. Program Management Office experience desired. Knowledge of software engineering design, development and management principles Knowledge of computer hardware design, development and management principles Knowledge and experience in agile software development and DevSecOps Knowledge and experience in Model Based Systems Engineering Knowledge of program management techniques (Cost, Schedule, and Performance) Knowledge of the acquisition process including development, test and evaluation, contracting, production, and fielding Excellent organizational and communication skills, as well as the ability to work in a highly collaborative environment Professional experience using Microsoft Office applications to include Excel, Outlook, PowerPoint, Project, and Word Candidate must possess strong oral and written communication skills Must be a self-starter that thrives in a dynamic team environment Candidate must possess a proven ability to develop and provide reports to management US Citizenship is required Active DoD Secret security clearance and the ability to maintain such is required  Overview:  People First. Technology Always. PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce. Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields. Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people. Come Experience It. #cjpost #dpost EEO Statement PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, applicationhelp@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Software Systems",
            "Model Based Systems Engineering",
            "Development Testing",
            "DevSecOps",
            "Electronic Engineering",
            "Software Requirements Analysis",
            "Agile Software Development",
            "Secret Clearance",
            "Software Testing",
            "DO-178B/C (Software Considerations in Airborne Systems and Equipment Certification)",
            "Integrated Development Environments",
            "Acquisition Processes",
            "Customer Support",
            "Software Coding",
            "Software Architecture",
            "Software Engineering",
            "Cyber Security",
            "Project Management Office (PMO)",
            "Software Development",
            "Airworthiness",
            "Computer Engineering",
            "Electrical Engineering",
            "Systems Integration",
            "Unmanned Aerial Systems (UAS)",
            "Computer Hardware"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Writing",
            "Willingness To Learn",
            "Microsoft Office",
            "Program Management",
            "Management",
            "Microsoft PowerPoint",
            "Microsoft Excel",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-ethic-tech-llc-JV_KO0,17_KE18,32.htm?jl=1008953079034": {
        "Location": "Alabama",
        "Data": [
            "Summary Seeking a Missile Defense Systems (MDS) Analyst to support the development of air and missile defense systems. The candidate will be part of a team performing analysis of Hardware-In-The-Loop (HWIL) architecture performance for MDS Ground Tests, Flight Tests (System Pre-Mission Test and System Post-Flight Reconstruction), and Continuous Developmental Integration activities. Essential Functions Support simulation integration analysis, data analysis, interface analysis, and simulation verification and validation activities. Assist with developing material to be presented at engineering reviews that summarize the analytical work performed. Establishing requirements for evaluation tools and processes, development of analytical tools, providing analytical support to the test planning process, and coordination of analytical results within the MDS community. Performs other duties as assigned.Show more Report"
        ],
        "Hard Skills": [
            "Flight Testing",
            "Verification And Validation",
            "Data Analysis",
            "Test Planning"
        ],
        "Soft Skills": [
            "Coordinating"
        ]
    },
    "https://www.glassdoor.com/job-listing/database-and-software-engineer-kbr-JV_KO0,30_KE31,34.htm?jl=1008755120954": {
        "Location": "Alabama",
        "Data": [
            "Title: Database and Software Engineer Develop innovative weapon systems for the Warfighter! ABOUT THIS POSITION: Join a diverse team of talented and inspired engineers and analysts to develop US Army Air and Missile Defense systems in Huntsville, Alabama. The KBR Team in Huntsville, AL is seeking a Database and Software Engineer to support the design and management of desktop and web applications and their underlying databases, including the implementation and configuration of structured databases for big data analytics within a government enterprise. This candidate will be part of a software tools development team and will be responsible for administering and maintaining SQL Server databases and developing long-term data management and storage strategies at the enterprise level. The DBA is ultimately responsible for the establishment and management of policies and procedures related to data security and integrity. This person will work with a cross-section of internal IT organizations, including other DBAs, analysts, developers, and management teams. Position Type: This is a full time, contractor site position in Huntsville, AL. ESSENTIAL DUTIES AND RESPONSIBILITIES: Perform core DBA functions supporting multiple SQL Server instances Allocate systems storage and develop plans for future growth requirements Plan and implement effective availability, backup, recovery, and business continuity strategies Support multiple system environments for development, testing, and production releases Create database objects such as stored procedures, triggers, and packages, and perform tuning, database administration, and troubleshooting Proactively diagnose and resolve problems affecting database performance Define high-level standards for database management Analyze system performance; identify problems and implement solutions; provide input towards reviewing and tuning complex SQL statements Design, develop, and maintain plugins and extensions for Windows desktop applications REQUIRED QUALIFICATIONS: Bachelor’s degree in Computer Science, Information Systems, or information technology related major 10+ years of experience in SQL Database Administration Master's Degree can be substituted for an additional 2 years of experience Strong understanding of database management concepts, data normalization, and optimization techniques Proficiency in database backup and recovery strategies Knowledge of database security principles and best practices Ability to diagnose and troubleshoot Microsoft SQL Server Understanding of DevOps and Infrastructure as Code Experienced, self-reliant individual able to solve complex issues with little instruction Experience with database tuning, monitoring, installation, configuration, and maintenance Effective verbal and written communication skills; ability to adapt communication style to suit different audiences or facilitate group discussions and develop accurate written materials to communicate information clearly and concisely Ability to operate in a dynamic environment and take on various roles as part of the daily program operations Ability to build solid relationships with team members, leadership, and customers Candidate must be a US Citizen Possess (and be able to maintain) a Secret Clearance PREFERRED QUALIFICATIONS: Proficiency in C/C++/C# Experience in Python and/or MATLAB Experience in Linux Experience with programming/scripting languages (i.e. PowerShell) for automating DBA tasks Demonstrated ability creating and maintaining procedural and systemic documentation WHO WE ARE: KBR Government Solutions delivers mission critical full life cycle services that improve military readiness, drive innovation, and help ensure mission success. Since WWII, we have led many of the federal government’s most important programs in the areas of defense, space, and technology. Today, our employees are solving some of the world’s most challenging problems and inspiring the future. KBR Government Solutions core capabilities include engineering, operations, logistics, science, program and acquisition management, IT, cyber and security services. KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Database Administration",
            "Database Tuning",
            "Data Normalization",
            "Secret Clearance",
            "Linux",
            "Stored Procedure",
            "Development Testing",
            "Python (Programming Language)",
            "Microsoft SQL Servers",
            "Business Continuity",
            "Infrastructure as Code (IaC)",
            "SQL (Programming Language)",
            "C# (Programming Language)",
            "Scripting",
            "MATLAB",
            "DevOps",
            "Software Engineering",
            "Database Management",
            "Windows Desktop",
            "Windows PowerShell",
            "Computer Science",
            "Database Security",
            "Big Data Analytics",
            "Big Data",
            "Data Security",
            "Data Management",
            "Information Systems",
            "Web Applications",
            "Automation"
        ],
        "Soft Skills": [
            "Communications",
            "Discussion Facilitation",
            "Writing",
            "Information Technology",
            "Management",
            "Operations",
            "Innovation",
            "Troubleshooting (Problem Solving)",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-associate-sw-iv-and-v-boeing-JV_KO0,39_KE40,46.htm?jl=1008961197844": {
        "Location": "Alabama",
        "Data": [
            "At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Are you up for the challenge? Do you want free money in your 401k? Do you want job security and a company that invests in you? You need to check us out! ALONG WITH COMPETITIVE SALARIES AND OUR COMPREHENSIVE BENEFITS, WE OFFER: Employee Performance Incentives Ongoing Training Opportunities Boeing Employee Discount Program Health Insurance Opt-out Incentives Generous 401k Contribution – 10% contribution (NOT A MATCH) Student Debt Payoff Up to $30k Tuition Assistance HSA Contributions Professional Development Program Every day, Boeing Intelligence & Analytics supports global missions by building and delivering intelligence, analytics, and cyber solutions that enable users to advance national security. We have provided our customers with the tools needed to counter evolving global and cyber threats, and to improve wartime decision making. Our talented employees bring software development, systems engineering, and advanced analytics expertise. We offer numerous prime contract opportunities with customers headquartered in Maryland, Virginia, and the District of Columbia, as well as subcontract opportunities that align with our areas of focus and additional opportunities nationwide through our parent company. What you will do (day in the life): In this role, you will establish and maintain the software build pipelines in a DevSecOps environment using Azure Cloud, GitLab and build tools and scripts delivered from Prime developers. You will support the integration of SAST, DAST, and SCA tools used for independent software verification and validation (IV&V), and software assurance evaluations. You will evaluate the scan results determining false positives, and finding severity levels against system architecture. Validate developer mitigations to reduce or mitigate risks. You will trace functional requirements to architecture to models, and then into the source code for verification of cybersecurity specifications. You will participate in technical interchange meetings with government and Prime developers to discuss findings and software assurance progress and maturity. Boeing Intelligence & Analytics (BI&A) is seeking a Software Engineer – Associate (Sw-IV&V) to join the development team. Work Location: Huntsville, AL This position is expected to be 100% onsite. As the Associate Level Software - IV&V Analyst on this team your duties will be to: Build and script YAML DevSecOps pipeline in a closed network environment.  Perform Software Independent Verification and Validation (IV&V) activities. Develop, document and maintain complex architectures, requirements, algorithms, interfaces, and designs for software systems. Development of code and integration of complex software components into a fully functional software system. Develop software verification plans, test procedures, test environments, and unit tests to execute software and interfaces.  Documenting test results to ensure software system requirements are met. Assist with the selection, deployment, tailoring and operation of SAST, SCA, and DAST tools, processes, and metrics. Serve as an analyst for software domains, system-specific issues, processes, and regulations. Track and evaluate software team and supplier performance to ensure products and process conformance to government and industry standards. Provide Software Assurance evaluations of Missile Defense Agency development programs to ensure software development that is Sustainable, Maintainable, Available, Testable, and Survivable. Work under consultative direction, and in a team collaboration environment. Relevant Technologies used on this program: DevSecOps Azure Cloud Environment Containerization Static Application Scanning Tools (SAST), Software Component Analysis (SCA) Tools, Dynamic Application Scanning Tools (DAST). Requirements Experience in the following areas: Programming languages such as C/C++, ADA, Python, Java, Perl, Go, ... Embedded software development, systems engineering, or integration and test experience with mission systems on tactical platforms, flight software, or other complex systems. Agile product development in CI/CD techniques, testing, and delivery. Automating system testing, integration, and deployment Software factory maintenance and upgrades. Collaboration with developers, testers, and system engineers from multiple product teams. Typical Education: Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 2 or more years' related work experience or an equivalent combination of technical education and experience (e.g. Master). Secret clearance-US prestart DoD 8570 IAT/IAM Level II Certificate or higher This position requires clearing a background check and an enhanced Personal Conflict of Interest (PCI) requirements as a condition for employment. Desired Experience: Knowledge of software testing methods and approaches. Working knowledge of the CI/CD process including debugging, test, and integration of software tools. Knowledge of working with and supporting systems with Azure Cloud, Linux Operating System (OS) Kuberneties, Helm, and YAML. Good communication skills and a self-starter that can thrive and solve problems in a new development environment. Have the ability to work within a tool-chain using tools such as GitLab, Gradle, Maven, JFrog Artifactory, ELK Stack (Elasticsearch, Logstash, and Kibana), SonarQube, Fortify, Coverity, BlackDuck, CodeDx, Klocwork, and more. Boeing Intelligence & Analytics Benefits: Employees are more effective on the job when they are not distracted by health and financial worries. To support our workforce, we offer a wide variety of health, life and other insurance benefits (as described above) that allow each employee to choose the coverage best suited to their needs and the needs of their family. Summary Pay Range: Please note that the information shown below is a general guideline only. Pay is based upon candidate experience and qualifications, as well as market and business considerations. $70,000 - $125,000 BI&A is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race,color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Equal Employment Opportunity is the Law (PDF) Equal Opportunity Employer: We are an equal opportunity employer. We do not accept unlawful discrimination in our recruitment or employment practices on any grounds including but not limited to; race, color, ethnicity, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military and veteran status, or other characteristics covered by applicable law. We have teams in more than 65 countries, and each person plays a role in helping us become one of the world’s most innovative, diverse and inclusive companies. We are proud members of the Valuable 500 and welcome applications from candidates with disabilities. Applicants are encouraged to share with our recruitment team any accommodations required during the recruitment process. Accommodations may include but are not limited to: conducting interviews in accessible locations that accommodate mobility needs, encouraging candidates to bring and use any existing assistive technology such as screen readers and offering flexible interview formats such as virtual or phone interviews.Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Debugging",
            "Kibana",
            "Software Systems",
            "Coverity",
            "Screen Reader",
            "Functional Requirement",
            "Perl (Programming Language)",
            "DevSecOps",
            "System Testing",
            "Agile Product Development",
            "Elastic (ELK) Stack",
            "Microsoft Azure",
            "Component Analysis",
            "Unit Testing",
            "Toolchain",
            "Klocwork",
            "Gradle",
            "Software Testing",
            "Secret Clearance",
            "YAML",
            "Algorithms",
            "Python (Programming Language)",
            "Static Application Security Testing (SAST)",
            "Apache Maven",
            "Dynamic Application Security Testing (DAST)",
            "SonarQube",
            "Java (Programming Language)",
            "Flight Software",
            "Logstash",
            "Cyber Security",
            "Systems Architecture",
            "Embedded Software",
            "Containerization",
            "Elasticsearch",
            "Development Environment",
            "Cyber Threat Intelligence",
            "Testability",
            "Artifactory",
            "Employee Performance Management",
            "JFrog",
            "IAM Level II Certification",
            "Advanced Analytics",
            "Software Factory",
            "CI/CD",
            "Verification And Validation",
            "Software Engineering",
            "Build Tools",
            "Linux",
            "Supplier Performance Management",
            "Systems Engineering",
            "Computer Science",
            "Gitlab",
            "Software Development",
            "Chemistry",
            "Physics",
            "Automation",
            "Operating Systems",
            "System Requirements",
            "Go (Programming Language)"
        ],
        "Soft Skills": [
            "Self-Motivation",
            "Mathematics",
            "Teamwork",
            "Decision Making",
            "Communications",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/jr-software-engineer-yulista-management-services-JV_KO0,20_KE21,48.htm?jl=1008931486756": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/user-interface-software-engineer-polaris-sensor-technologies-JV_KO0,32_KE33,60.htm?jl=1008093227906": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/junior-web-developer-the-westervelt-company-JV_KO0,20_KE21,43.htm?jl=1008918333982": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/application-software-developer-asrc-federal-holding-company-JV_KO0,30_KE31,59.htm?jl=1008965059327": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-2-contract-boeing-JV_KO0,28_KE29,35.htm?jl=1008843490912": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/senior-electrical-engineer-embedded-software-steris-JV_KO0,44_KE45,51.htm?jl=1008961841690": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-rocketvox-JV_KO0,17_KE18,27.htm?jl=1008829032777": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-crm-neptune-technology-group-inc-JV_KO0,21_KE22,50.htm?jl=1008703825626": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/junior-level-software-engineer-e4-technology-JV_KO0,30_KE31,44.htm?jl=1006860143465": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/undergraduate-student-assistant-computer-science-and-software-engineering-auburn-university-JV_KO0,73_KE74,91.htm?jl=1008597582268": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/staff-software-engineer-application-security-shipt-JV_KO0,44_KE45,50.htm?jl=1008960056758": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/full-stack-engineer-stella-source-JV_KO0,19_KE20,33.htm?jl=1008965082428": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-trivector-JV_KO0,17_KE18,27.htm?jl=1008963915456": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/c-software-engineer-analyst-intuitive-research-and-technology-corporation-JV_KO0,27_KE28,73.htm?jl=1008695217662": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-asrc-federal-holding-company-JV_KO0,17_KE18,46.htm?jl=1008961550401": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-safety-engineer-gebc-JV_KO0,24_KE25,29.htm?jl=1008421034326": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/senior-software-data-engineer-intuitive-research-and-technology-corporation-JV_KO0,29_KE30,75.htm?jl=1008864175245": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/associate-sw-engineer-software-engineer-aht-northrop-grumman-JV_KO0,43_KE44,60.htm?jl=1008929038727": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/frontend-software-engineer-modern-technology-solutions-inc-JV_KO0,26_KE27,58.htm?jl=1008942204761": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/junior-systems-software-engineer-ironmountain-solutions-inc-JV_KO0,32_KE33,59.htm?jl=1008937504583": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-3-cohesionforce-JV_KO0,19_KE20,33.htm?jl=1008764084840": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-test-engineer-barrios-technology-JV_KO0,22_KE23,41.htm?jl=1008662909003": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/c-software-engineer-nou-systems-inc-JV_KO0,19_KE20,35.htm?jl=1008068905774": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/embedded-software-engineer-staff-all-points-logistics-JV_KO0,32_KE33,53.htm?jl=1008706042088": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-verification-and-validation-engineer-archarithms-inc-JV_KO0,45_KE46,61.htm?jl=1008960396800": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-associate-model-and-sim-weapons-systems-fire-control-development-integration-boeing-intelligence-and-analytics-JV_KO0,94_KE95,128.htm?jl=1008716754832": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-reverse-engineer-aviation-and-missile-solutions-JV_KO0,25_KE26,56.htm?jl=1008751723165": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-test-engineer-parry-labs-JV_KO0,22_KE23,33.htm?jl=1008936101168": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-crm-neptune-JV_KO0,21_KE22,29.htm?jl=1008703892340": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/junior-developer-bevilacqua-research-corporation-JV_KO0,16_KE17,48.htm?jl=1008788764345": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/graduate-research-assistant-computer-science-and-software-engineering-auburn-university-JV_KO0,69_KE70,87.htm?jl=1008606040506": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-quality-engineer-genconnect-recruiting-and-consulting-JV_KO0,25_KE26,62.htm?jl=1008864751179": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-simulation-engineer-applied-analytical-solutions-JV_KO0,28_KE29,57.htm?jl=1006238605365": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/jr-mid-software-engineer-davidson-technologies-inc-JV_KO0,24_KE25,50.htm?jl=1008752802607": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-developers-junior-positions-gps-it-solutions-JV_KO0,36_KE37,53.htm?jl=1005685503346": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-sentinel-gbsd-boecore-JV_KO0,31_KE32,39.htm?jl=1008963168676": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-ii-onsite-brasfield-and-gorrie-llc-JV_KO0,27_KE28,52.htm?jl=1008775678240": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/full-stack-python-developer-intuitive-research-and-technology-corporation-JV_KO0,27_KE28,73.htm?jl=1008948953288": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/mid-level-software-engineer-platform-ctt-boeing-JV_KO0,40_KE41,47.htm?jl=1008727929578": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-lockheed-martin-corporation-JV_KO0,17_KE18,45.htm?jl=1008915469826": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-systems-engineer-uas-cfd-research-corporation-JV_KO0,29_KE30,54.htm?jl=1008766655014": {
        "Location": "Alabama",
        "Data": [
            "Element with the specified ID not found."
        ],
        "Hard Skills": [],
        "Soft Skills": []
    }
}