{
    "https://www.glassdoor.com/job-listing/entry-level-software-engineer-torch-technologies-inc-JV_KO0,29_KE30,52.htm?jl=1008906887889": {
        "Location": "Alabama",
        "Data": [
            "Job Description: The Innovation through Integration (I2) Business Unit (BU) at Torch Technologies, Inc. focuses on integrating technologies to provide innovative solutions to customers. I2 is growing to meet the demands of our customers, and we want creative and imaginative teammates like you! In our services, we strive to provide visual solutions that are backed by real data. As a team member you’ll work with a team to build a back-end data pipeline that powers compelling visual interfaces. Torch Technologies is seeking Entry-Level Software Engineers to support the Integration (I2) Business Unit (BU). The candidate will be expected to work closely with other developers and customers to develop quality software products. Candidate will be working with multiple applications that support a multiple projects. Project applications integrate with an internal backend toolset and present simulation data in an appealing manner so soldiers can make better tactical decisions. Candidate should be dependable and self-motivated, eager to overcome challenges and solve problems.  Growth Vector (30 days/90 days/1 year) As an I2 developer, you will be provided with the flexibility and support needed to grow into a valued teammate. Below is an estimated timeline of what you can expect within the first year of employment. 30 days Meet the team Understand the goal of each project the team supports Start diving into a part of the code base Ship a small change Apply for security clearance  90 days Feel comfortable in a part of the code base Integrate with people across multiple projects Develop a significant feature Demo a feature to internal technical leadership  1 year Attain active security clearance Be comfortable in a specific feature set in each code base Architect and present a feature set to the development team  Benefits Launch a software engineering career with no prior experience Learn to code on the job in a relaxing environment Paid time off and paid holidays Education assistance program 401k with matching Wellness programs Employee stock ownership plan (ESOP) Health, vision, and dental insurance plans Interest-free computer loans  Interview Process The I2 interview process typically involves a phone call to establish interest and fit. The next phase could be a follow-up phone call or virtual meeting with the hiring manager which will cover more technical topics. Finally, you’ll be invited for an interview with I2 technical leadership. If all goes well, you will be extended an offer to become a member of the I2 Team!   Job Requirements: What We Are Looking For: Bachelor’s Degree or higher in software engineering, computer science, or other science, technology, engineering, and math (STEM) discipline Must be able to attain a security clearance. Strong desire to learn to code and some exposure to programming languages - No prior professional experience required. A natural problem solver. Challenge seekers looking to develop tech skills. Able to contribute to multiple code bases simultaneously. Able to effectively communicate in verbal and written form.  Technical Stack Below is a list of technologies the candidate will learn and work with: C# / C++ Java Python CMake Visual Studio Modeling and Simulation Tools (AFSIM, OneSAF) Unreal Engine 4 / 5 Git / Git LFS  U.S. Citizenship Required for this Position: Yes Job Type: Regular Full-time Security Clearance: Secret Schedule: M-F; 8-5 Work Location: Torch site Travel: Yes, 0-10% Benefits: Torch Technologies is proud to offer a stable and professional work environment, a competitive salary, and an excellent, comprehensive benefit package including: ESOP participation, 401(k) match and safe-harbor contribution, medical, dental, vision, life insurance, short-term disability, long-term disability, flexible spending accounts, Health Saving Accounts and Health Reimbursement Accounts, EAP, education assistance, paid time off, and holidays. Applying to Torch Technologies: Only those candidates invited for an interview will be contacted. Employment at Torch Technologies is contingent upon the successful completion of a comprehensive background check. Torch Technologies is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Employment Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class.Show more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "Data Pipelines",
            "Microsoft Visual Studio",
            "Security Clearance",
            "Software Engineering",
            "Git (Version Control System)",
            "Unreal Engine",
            "Python (Programming Language)",
            "Technical Leadership",
            "CMake",
            "Writing Systems",
            "Java (Programming Language)",
            "C# (Programming Language)",
            "Computer Science",
            "Torch (Machine Learning)",
            "Loans",
            "Extensible Authentication Protocol",
            "Excel Solver"
        ],
        "Soft Skills": [
            "Mathematics",
            "Self-Motivation",
            "Willingness To Learn",
            "Innovation",
            "Imagination"
        ]
    },
    "https://www.glassdoor.com/job-listing/sr-software-engineer-l3harris-technologies-JV_KO0,20_KE21,42.htm?jl=1008911810793": {
        "Location": "Alabama",
        "Data": [
            "We seek a Sr. Software Development Engineer for our Huntsville, AL location. The Huntsville based software team’s primary responsibility is to develop innovative, reliable and affordable real-time embedded control software used for defense propulsion systems. Our team also provides support to space propulsion systems on an as needed basis. As a key contributor under the general guidance of a project team lead, you will have hands on opportunities to shape the next generation of defense propulsion systems. This career opportunity will challenge you to tackle complex design problems in a rapid paced, laboratory development environment. As a member of the software development team your regular duties will include contributing to the production of software requirements, design, implementation, and test for avionics embedded systems. This position may include the opportunity to support live hot fire rocket motor tests at one of our test facilities. Join us to power the future with Aerojet Rocketdyne! This position will report to the Sr. Manager, Software Development, Defense Business Unit. This current opening may be filled at this level as posted or at one level higher.Show more Report"
        ],
        "Hard Skills": [
            "Spacecraft Propulsion",
            "Development Environment",
            "Embedded Systems",
            "Avionics",
            "Propulsion",
            "Software Development"
        ],
        "Soft Skills": [
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-integration-engineer-jacobs-JV_KO0,29_KE30,36.htm?jl=1008925861487": {
        "Location": "Alabama",
        "Data": [
            "Challenging Today. Reinventing Tomorrow.  We're invested in you and your success. Everything we do is more than just a project. It's our challenge as human beings, too. That's why we bring a thoughtful and collaborative approach to every one of our partnerships.  At Jacobs, we challenge the status quo and redefine how to solve the world's greatest challenges, transforming big ideas into intelligent solutions for a more connected, sustainable world.  Design your career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow   Your Impact: Jacobs Space Exploration Group (JSEG) is comprised of 10 companies and is located at Marshall Space Flight Center in Huntsville, AL (ranked #1 in Best Places to Live by U.S. News for 2022-2023). JSEG has been a primary contractor for NASA since 1989 and supports marquee NASA programs, including the Space Launch System, International Space Station, space optics fabrication, earth and space sciences and advanced propulsion system development. As a partner in NASA’s next generation of space exploration, our jobs are literally history in the making. This position will support the Systems Integration and Test Facility (SITF), Systems Integration Laboratory (SIL) Hardware-in-the-Loop facility (HWIL), and the new MARS Ascent Vehicle Systems Integration LAb. These facilities will be used to verify the integrated avionics system and Flight Software for the Space Launch System (SLS) at NASA’s Marshall Space Flight Center (MSFC). Responsibilities: The Software Development Engineer participates in implementing and maintaining laboratory automation software that controls real-time HWIL simulation systems used to support the NASA Space Launch System program at MSFC. This operations team member collects, interprets and documents system requirements; participates in component, subsystem and system concept designs; develops and recommends methods, tools, designs, and automation functions. Perform software systems engineering functions. Develop and execute test plans and procedures. Enter and update documentation into appropriate control systems. Troubleshoot and correct test anomalies. Collaborate with cross-functional teams to ensure products meet requirements. Produce documentation and user training materials to assist users. These activities will be ongoing through multiple launch vehicle configurations as the SLS program completes program phases, reviews and schedule milestones. Here’s What You’ll Need: Qualifications: B.S/M.S degree in Computer Science, Software Engineering, Electrical Engineering or related field is required. Degree from an ABET-accredited university is preferred. Typically, educational requirements are a BS with at 0-5 years experience. Required Experience: Proficient in tools/languages such as: Python, Qt, Windows 10, and Linux Exposure to tools/languages/standards such as: XML, C/C++, Git, Bash,Trac, and Linux shell scripting. Desired Experience: Systems engineering experience in disciplines such as hardware and software integration, requirements development, verification and validation, and testing. Development on Windows and Linux operating systems. Network communications with TCP and UDP. Configuration management of distributed computing platforms used during formal avionics HWIL test activities. Developing user interfaces for automated test control and data display in support of formal avionics HWIL - test activities. The ideal candidate should be proactive, willing to learn, a team player, customer-focused, attentive to details, and always looking for improvements. The Jacobs Space Exploration Group (JSEG) offers a partnership in which you can grow personally and professionally within a framework of strong leadership, competitive compensation, and rewarding career paths. Come join our team on the Engineering Services and Science Capability Augmentation (ESSCA) contract whose work is destined to have a long-range effect on future generations! For more information on why Huntsville is known as “one of the smartest cities in the nation”, check out these websites: https://hsvchamber.org/ www.Huntsville.org/ https://www.movoto.com/guide/huntsville-al/moving-to-huntsville/ https://realestate.usnews.com/places/alabama/huntsville https://iveyhsv.com/real-estate-blog/13-reasons-why-you-should-move-to-huntsville/ Essential Functions Work Environment: This position is 100% onsite and in a lab environment. Requires ability to provide clear, concise, accurate and timely communication, both verbally and in writing (100%). Requires ability to interact professionally with co-workers, management, and client (100%). Physical Requirements: Requires sitting for extended periods of time at a desk in an MSFC NASA facility to perform technical tasks (10%). Also, requires sitting for extended periods of time at a desk to write reports and perform engineering tasks (80%). Requires ability to use stairs or elevators for access between multiple floors and buildings at an MSFC NASA facility (10%). Equipment and Machines: Requires ability to operate a personal computer, a telephone, fax machine, copier, calculator, and other general office equipment (100%). Attendance: Normal workday 7:30 – 4:30, Monday thru Friday. Shift work is required during 24 hour operations. Minimal overtime may be required (10%) to meet schedule milestones and to support technical demands of the job. Regular attendance is a necessity and adequate arrangements for delegating duties during absences are required. Other Essential Functions: The ability to work independently with minimal supervision, and to make rational decisions, and to exercise good judgment is essential (100%). Grooming and dress must be appropriate for the position and must not impose a safety risk/hazard to the employee or others. Proof of U.S. Citizenship is required. #ESSCAShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Systems",
            "Office Equipment",
            "Electrical Engineering",
            "Linux",
            "Extensible Markup Language (XML)",
            "Vehicle Systems",
            "Space Science",
            "Distributed Computing",
            "Space Stations",
            "Git (Version Control System)",
            "Qt (Software)",
            "Python (Programming Language)",
            "Network Communications",
            "Laboratory Automation",
            "Space Flight",
            "Flight Software",
            "Launch Vehicle Systems",
            "Software Engineering",
            "Scripting",
            "Software Development",
            "Space Exploration",
            "Configuration Management",
            "Data Display Debuggers",
            "User Interface (UI) Design",
            "Test Automation",
            "Verification And Validation",
            "Bash (Scripting Language)",
            "Systems Engineering",
            "Computer Science",
            "Unix Shell",
            "Transmission Control Protocol (TCP)",
            "Microsoft Windows 10",
            "Systems Integration",
            "Test Planning",
            "Automation",
            "Avionics",
            "Milestones (Project Management)",
            "Optics",
            "System Requirements"
        ],
        "Soft Skills": [
            "Customer Service",
            "Calculators",
            "Professionalism",
            "Communications",
            "Willingness To Learn",
            "Report Writing",
            "Management",
            "Operations",
            "Troubleshooting (Problem Solving)",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-junior-to-mid-level-dynetics-JV_KO0,37_KE38,46.htm?jl=1008864154602": {
        "Location": "Alabama",
        "Data": [
            "Leidos Dynetics Group is seeking a talented Junior to Mid-level Software Engineer to join a diverse team to create quality solutions for complex problems. We have offices across the United States engaging in the defense, space, cyber and commercial fields, Dynetics provides responsive, cost-effective engineering, scientific and IT solutions. In this role, you will use your skills to design and implement new features, fix bugs, perform peer reviews, write tests, analyze new technologies and best practices, and collaborate with other teammates. You’ll be developing solutions primarily in .NET and C#. The team follows agile software practices, shares a passion for solving complex problems, delivering exceptional software, improving software development processes, and exceeding customer expectations. Basic Qualifications Bachelor's Degree in Computer Science, Computer/Software Engineering, or equivalent technical degree3+ years' experience preferred (can be waived for exceptional candidates)Proficiency with C#, .NET, C++, Java, or other object-oriented programming language is required.Knowledge of data structures and object-oriented design is required.Experience with binary communications protocols used over a network or serial portMust be a resident of the North Alabama area OR willing to relocate to the Huntsville - North Alabama, AL area. Other Qualifications Knowledge and experience with one or more of the following are a plus:Agile software methodologies (e.g., Scrum).NET technologies such as WPFGitUnit testing and continuous integration best practices</li><li>Design patterns Security Requirements Candidate must be a US Citizen and possess (and be able to maintain) a Final Secret Clearance or meet the eligibility to obtain (and maintain) a Secret Clearance.Show more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            ".NET Framework",
            "Secret Clearance",
            "Scrum (Software Development)",
            "Continuous Integration",
            "Object Oriented Programming Language",
            "Object-Oriented Design",
            "Communications Protocols",
            "Security Requirements Analysis",
            "Java (Programming Language)",
            "C# (Programming Language)",
            "Data Structures",
            "Peer Review",
            "Software Engineering",
            "Agile Software Development",
            "Computer Science",
            "Software Development"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/electronics-engineer-hardware-and-software-early-to-mid-career-lockheed-martin-corporation-JV_KO0,62_KE63,90.htm?jl=1008915471045": {
        "Location": "Alabama",
        "Data": [
            "JOB ID: 653656BR Date posted: Sep. 28, 2023 Program: THAAD  Description:Take your career to a new level and work at an extraordinary company in Huntsville AL. (opens in new window) The coolest jobs on this planet… or any other… are with Lockheed Martin Space! (opens in new window) Lockheed Martin. You know about us already. We've been around for over 100 years and plan to be here for at least 100 more! We solve complex challenges, advance scientific discovery and deliver innovative solutions that help our customers keep people safe. We employ 116,000 employees worldwide, 20% of whom are veterans!  We know that our strong company culture and core values help us perform better in the long run. We believe in work-life balance which results in increased productivity and a happier, less-stressed workforce.  Our 3 core values are the foundation of our culture: 1. Do the right thing 2. Perform with excellence 3. Treat others with respect  What does this role look like?  As an experienced member of our Electronic Engineering team, you will help provide solutions to a variety of technical problems by applying extensive technical expertise to develop solutions to complex problems which require the regular use of ingenuity and creativity.   In this important role you will collaborate with a diverse team of technical professionals and interact with senior external personnel on significant technical matters. You should be flexible, motivated, dedicated, detail-focused, team-oriented, and capable of multi-tasking.     Key activities you will accomplish in this role:  Implementation of design requirements, the assignment, coordination and execution of hardware designs, development and integration of hardware custom and procured electronic assemblies in accordance with process specifications.Requirements analysis, object oriented analysis & design, code & unit test, integration, and support to formal test/delivery. Develop software using languages such as C, C++.Manage risk and identify mitigation plans to meet productivity, quality, cost, schedule, and mission success objectives.  Typical mins for this role:  5 - 9 years of professional experience.Must have at least a DoD Interim Secret or higher clearance. Thus you must be a US Citizen.  BENEFITS OF EMPLOYMENT:  (opens in new window) .   We are an equal opportunity employer and value diversity at Lockheed Martin. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation. Basic Qualifications: Bachelor's degree or higher from an accredited college in Electrical Engineering or related discipline, or equivalent experience/combined education. Experience with design of digital and analog circuits. Proficient in programming in C/C++. Experience with production, manufacturing, and integration support. Desired Skills: Familiarity with processes on failure investigation (root cause analysis, failure review boards, etc.).Experience with microcontroller and FPGAsAbility to use standard lab test equipment Experience working with subcontractors and DoD personnel Project Leadership experience throughout the engineering life cycle.Proficient in programming in either Verilog, VHDL or equivalent programming language 9 or more years of professional experience for this role. Security Clearance Statement:This position requires a government security clearance, you must be a US Citizen for consideration. Clearance Level:Secret Other Important Information You Should Know Expression of Interest:By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings. Ability to Work Remotely:Onsite Full-time: The work associated with this position will be performed onsite at a designated Lockheed Martin facility. Work Schedules:Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits. Schedule for this Position:4x10 hour day, 3 days off per week Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.  As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories. Experience Level:Experienced Professional Business Unit:SPACE Relocation Available:Possible Career Area:Electrical Engineering Type:Full-Time Shift:First At Lockheed Martin, we apply our passion for purposeful innovation to keep people safe and solve the world's most complex challenges. Mission-Focused Innovation: From aerospace to outer space to cyber space, you can solve the world's most complex challenges for our customers. Foundational Values: Our culture of performance excellence, ethics, teamwork and inclusion is embedded in everything we do. Diverse Career Opportunities with Meaningful Work: Grow your career and skills for life. Our technology-driven learning platforms and programs enable your development and agility. Your Health, Your Wealth, Your Life: Our flexible schedules, competitive pay and comprehensive benefits enable you to live a healthy, fulfilling life at and outside of work. Empowered to Be Your Best: Use your strengths to make a difference in the lives of one another, our customers, our communities and our planet. Commitment to Sustainability: We foster innovation, integrity and security to preserve the environment, strengthen diverse communities and propel growth. Here, the possibilities are endless because we offer: Flexible Schedules, dependent on role Levels: Student, Entry, Mid, Senior, Management Locations: Nationwide & OCONUS PositionsShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Object-Oriented Programming (OOP)",
            "Security Clearance",
            "Unit Testing",
            "Learning Platforms",
            "Root Cause Analysis",
            "Laboratory Testing",
            "Microcontrollers",
            "Electronic Engineering",
            "Analog Electronics",
            "VHSIC Hardware Description Language (VHDL)",
            "Electrical Engineering",
            "Verilog",
            "Subcontracting"
        ],
        "Soft Skills": [
            "Ingenuity",
            "Ethical Standards And Conduct",
            "Multitasking",
            "Detail Oriented",
            "Team Oriented",
            "Teamwork",
            "Creativity",
            "Innovation",
            "Leadership",
            "Management",
            "Coordinating",
            "Investigation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-huntsville-al-sentinel-davidson-technologies-inc-JV_KO0,40_KE41,66.htm?jl=1008933143623": {
        "Location": "Alabama",
        "Data": [
            "Davidson is seeking a Software Engineer in Huntsville, AL.  This position will support a major strategic weapons system program. Davidson will be supporting the Air Force’s development, production, sustainment and deployment of hardware and software systems for Intercontinental Ballistic Missile (ICBM) Ground and Airborne Launch Control Systems, Launch Facilities and associated infrastructure Qualified candidate will work a 9/80 work schedule which allows employees to work a nine-hour day Monday through Thursday to take every other Friday off The candidate that is selected will perform the full software development life-cycle activities including requirements analysis, design, implementation, unit testing, integration, verification, documentation, and configuration management using Agile methodology   Requirements:  Bachelor's Degree in a STEM field and 2-10 years of Software Engineering Experience Experience in software engineering with C/C++ in a Linux environment U.S. Citizenship  Desired Competencies/Experience/Certifications:  Experience in software development on a real time operating system Experience with Agile Scrum or Kanban methodologies Experience using and/or setting up a DevSecOps pipeline Familiarity with common source control tools (git, Mercurial, etc.) and automated build system workflows (Jenkins, Go, etc.) Familiarity with virtual machine technology Active DoD Secret and able to obtain Top Secret Security Clearance  Clearance Requirements: Must possess a DoD Secret Security ClearanceShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Systems",
            "Operating Systems",
            "DevSecOps",
            "Agile Methodology",
            "Git (Version Control System)",
            "Linux",
            "Software Development Life Cycle",
            "Scrum (Software Development)",
            "Software Engineering",
            "Requirements Analysis",
            "Jenkins",
            "Top Secret Clearance",
            "Mercurial",
            "Configuration Management",
            "Unit Testing",
            "Version Control",
            "Virtual Machines",
            "Software Development",
            "Automation"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/associate-sw-engineer-software-engineer-aht-northrop-grumman-JV_KO0,43_KE44,60.htm?jl=1008929038727": {
        "Location": "Alabama",
        "Data": [
            "Requisition ID: R10134457 Category: Engineering Location: Huntsville, Alabama, United States of America Citizenship required: United States Citizenship Clearance Type: Secret Telecommute: No- Teleworking not available for this position Shift: 1st Shift (United States of America) Travel Required: Yes, 10% of the Time Relocation Assistance: Relocation assistance may be available Positions Available: 3 At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history. At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people’s lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation’s history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they’re making history. Northrop Grumman Defense Systems is searching for Software Engineers (multiple positions) to join the Command and Control, Communication and Computer Missile Defense (C4MD) Business Unit in support of our programs, in Huntsville, AL. This position is capable of placing candidates anywhere within C4MD, MRPS, any programs like ABAD, IBCS, Wisla, SHORAD, and/or IRADs. The selected candidates’ task encompasses the following: Designs, develops, documents, tests and debugs applications software and systems that contain logical and mathematical solutions. Conducts multidisciplinary research and collaborates with systems engineers and/or hardware engineers in the planning, design, development. Determines computer user needs; analyzes system capabilities to resolve problems on program intent, output requirements, input data acquisition, programming techniques and controls; prepares operating instructions; designs and develops compilers and assemblers, utility programs, and operating systems. Ensures software standards are met. This requisition may be filled at a Level 1 or a Level 2 Software Engineer: Associate SW Engineer - Bachelor's degree in STEM, or additional years of experience in lieu of degree may be considered SW Engineer - Bachelor's degree in STEM (and 2 years of relevant experience, or Masters and 0 years) or additional years of experience in lieu of degree may be considered Basic Qualifications: Active Secret Security Clearance is required Experience with JAVA (work experience) Familiarity with Python Experience with collaborating in or using source code control environment (such as GitHub) Understanding of all phases of software development, and practical experience in an Agile / Dev*Ops environment For all positions: Following are good to have, but are not required: Security+ certification Experience testing SW for performance and functionality based on requirement specification and ability to identify and document exact sequence of activities desired Experience with automated testing Experience developing Eggplant software or Squish/ Froglogic. OpenGL and Front end experience OSGi services experience Experience in Air & Missile Defense Command and Control programs such as PATRIOT, SENTINEL, C2BMC or THAAD or any sensor/weapon system, Link 16 experience Python R (Language) Julia (Language) SQL NoSQL MongoDB Elasticsearch Web Scraping REST API Git / Version control AI/ML Tensorflow PyTorch Numerical Computing / Optimization Scrum Master experience Dev Ops experience Salary Range: $63,000 - $95,000 Salary Range 2: $77,000 - $115,000 Employees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business. The health and safety of our employees and their families is a top priority. The company encourages employees to remain up-to-date on their COVID-19 vaccinations. U.S. Northrop Grumman employees may be required, in the future, to be vaccinated or have an approved disability/medical or religious accommodation, pursuant to future court decisions and/or government action on the currently stayed federal contractor vaccine mandate under Executive Order 14042 https://www.saferfederalworkforce.gov/contractors/. Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit http://www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions.Show more Report"
        ],
        "Hard Skills": [
            "Scrum (Software Development)",
            "Multidisciplinary Research",
            "NoSQL",
            "Web Scraping",
            "Systems Engineering",
            "Source Code Control Systems",
            "CompTIA Security+",
            "Github",
            "Secret Clearance",
            "Numerical Computing",
            "Link 16",
            "Software Engineering",
            "Git (Version Control System)",
            "RESTful API",
            "R (Programming Language)",
            "Agile Methodology",
            "Test Automation",
            "Compilers",
            "Python (Programming Language)",
            "Utility Software",
            "MongoDB",
            "Froglogic Squish",
            "Java (Programming Language)",
            "SQL (Programming Language)",
            "Machine Learning",
            "Data Acquisition",
            "Elasticsearch",
            "Control Communications",
            "PyTorch (Machine Learning Library)",
            "OpenGL",
            "Julia (Programming Language)",
            "Operating Systems",
            "Version Control",
            "Front End (Software Engineering)",
            "TensorFlow",
            "Software Development"
        ],
        "Soft Skills": [
            "Planning",
            "Courage",
            "Intellectual Curiosity",
            "Mathematics"
        ]
    },
    "https://www.glassdoor.com/job-listing/jr-software-engineer-yulista-management-services-JV_KO0,20_KE21,48.htm?jl=1008931486756": {
        "Location": "Alabama",
        "Data": [
            "Troy 7 Inc. Regular PRIMARY FUNCTION Troy 7, Inc. is seeking a software Jr. Software Engineer to support the Missile Defense Agency (MDA). In this position, the selected candidate will support the MDA/TC Targets and Countermeasures Technical Team at Redstone Arsenal in Huntsville Alabama. ESSENTIAL FUNCTIONS Develop and maintain in house software to decommutate telemetry data Deploy for missions and provide technical and telemetry support Ability to learn new software development languages and technologies Troubleshoot coding problems quickly and efficiently Analyze, develop unit testing, and test programs and products before distribution Aid and support the coaching and training of other team members to ensure all employees are confident in the use of software applications SUPERVISORY RESPONSIBILITIES There are no supervisory responsibilities for this position. KNOWLEDGE, SKILLS, & ABILITIES: REQUIRED: Must be detail oriented, self-motivated, and work both independently and collaboratively Experience applying engineering rigor to analyze and resolve problems Experience developing object-oriented software using Java, C++, C# and more DESIRED: Experience with source code control tools such as Git Familiar with Matlab QUALIFICATIONS: A bachelor's degree in computer science or related degree is required Active Secret clearance is required, Top Secret desired 3+ years working on missile defense-related or other DoD program/projects PREFERENCE STATEMENT Preference will be given to Calista shareholders and their descendants and to spouses of Calista shareholders, and to shareholders of other corporations created pursuant to the Alaska Native Claims Settlement Act, in accordance with Title 43 U.S. Code 1626(g). EEO STATEMENT Additionally, it is our policy to select, place, train and promote the most qualified individuals based upon relevant factors such as work quality, attitude and experience, so as to provide equal employment opportunity for all employees in compliance with applicable local, state and federal laws and without regard to non-work related factors such as race, color, religion/creed, sex, national origin, age, disability, marital status, veteran status, pregnancy, sexual orientation, gender identity, citizenship, genetic information, or other protected status. When applicable, our policy of non-discrimination applies to all terms and conditions of employment, including but not limited to, recruiting, hiring, training, transfer, promotion, placement, layoff, compensation, termination, reduction in force and benefits.  REASONABLE ACCOMMODATION It is Calista and Subsidiaries' business philosophy and practice to provide reasonable accommodations, according to applicable state and federal laws, to all qualified individuals with physical or mental disabilities.  The statements contained in this job description are intended to describe the general content and requirements for performance of this job. It is not intended to be an exhaustive list of all job duties, responsibilities, and requirements.  This job description is not an employment agreement or contract. Management has the exclusive right to alter the scope of work within the framework of this job description at any time without prior notice.Show more Report"
        ],
        "Hard Skills": [
            "Object-Oriented Programming (OOP)",
            "C++ (Programming Language)",
            "Source Code Control Systems",
            "Git (Version Control System)",
            "Secret Clearance",
            "Contract Management",
            "Java (Programming Language)",
            "C# (Programming Language)",
            "Philosophy Of Business",
            "MATLAB",
            "Unit Testing",
            "Software Engineering",
            "Computer Science",
            "Software Development"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Coaching",
            "Self-Motivation",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/sr-software-engineer-back-end-automation-u-s-bank-national-association-JV_KO0,40_KE41,70.htm?jl=1008882579165": {
        "Location": "Alabama",
        "Data": [
            "At U.S. Bank, we’re on a journey to do our best. Helping the customers and businesses we serve to make better and smarter financial decisions and enabling the communities we support to grow and succeed. We believe it takes all of us to bring our shared ambition to life, and each person is unique in their potential. A career with U.S. Bank gives you a wide, ever-growing range of opportunities to discover what makes you thrive at every stage of your career. Try new things, learn new skills and discover what you excel at—all from Day One. Job Description This position will be responsible for the analysis, design, testing, development and maintenance of best in class software experiences. The candidate is a self-motivated individual who can collaborate with a team and across the organization. The candidate takes responsibility of the software artifacts produced adhering to U.S. Bank standards in order to ensure minimal impact to the customer experience. The candidate will be adept with the agile software development lifecycle and DevOps principles. This position is not eligible for visa sponsorship. Essential Responsibilities: Responsible for designing, developing, testing, operating and maintaining productsTakes full stack ownership by consistently writing production-ready and testable codeConsistently creates optimal design adhering to architectural best practices; considers scalability, reliability and performance of systems/contexts affected when defining technical designsPerforms analysis on failures, propose design changes, and encourage operational improvementsMakes sound design/coding decisions keeping customer experience in the forefrontTakes feedback from code review and apply changes to meet standardsConducts code reviews to provide guidance on engineering best practices and compliance with development proceduresAccountable for ensuring all aspects of product development follow compliance and security best practicesExhibits relentless focus in software reliability engineering standards embedded into development standardsEmbraces emerging technology opportunities and contributes to the best practices in support of the bank’s technology transformationContributes to a culture of innovation, collaboration and continuous improvementReviews tasks critically and ensures they are appropriately prioritized and sized for incremental delivery; anticipates and communicates blockers and delays before they require escalation Basic Qualifications Bachelor’s degree, or equivalent work experienceFive to six years of relevant experience Preferred Skills/Experience Must be proficient in Java, Python, Powershell or similar programming languages, Working knowledge on GIT, Jenkins, Ansible, VMWare vRealize suite (vRAvRO), SaltStack, Terraform, Docker Kubernetes Experience developing and delivering Infrastructure as Code (IaC) through a CICD pipeline utilizing DevOps tools Experience with running/managing systems and services on a cloud platform (e.g. AWS, Azure) Thorough understanding of a feature, the users impacted, the flows impacted and feature's purpose Adept with agile software development lifecycle and DevOps principles Able to communicate processes and results with all parties involved in the product team, including engineers, product owner, scrum master, third party vendors and customers Strong problem-solving and analytical skills Excellent communication and interpersonal skills If there’s anything we can do to accommodate a disability during any portion of the application or hiring process, please refer to our disability accommodations for applicants. Benefits: Our approach to benefits and total rewards considers our team members’ whole selves and what may be needed to thrive in and outside work. That's why our benefits are designed to help you and your family boost your health, protect your financial security and give you peace of mind. Our benefits include the following (some may vary based on role, location or hours): Healthcare (medical, dental, vision) Basic term and optional term life insurance Short-term and long-term disability Pregnancy disability and parental leave 401(k) and employer-funded retirement plan Paid vacation (from two to five weeks depending on salary grade and tenure) Up to 11 paid holiday opportunities Adoption assistance Sick and Safe Leave accruals of one hour for every 30 worked, up to 80 hours per calendar year unless otherwise provided by law EEO is the Law U.S. Bank is an equal opportunity employer committed to creating a diverse workforce. We consider all qualified applicants without regard to race, religion, color, sex, national origin, age, sexual orientation, gender identity, disability or veteran status, among other factors. E-Verify U.S. Bank participates in the U.S. Department of Homeland Security E-Verify program in all facilities located in the United States and certain U.S. territories. The E-Verify program is an Internet-based employment eligibility verification system operated by the U.S. Citizenship and Immigration Services. The salary range reflects figures based on the primary location, which is listed first. The actual range for the role may differ based on the location of the role. In addition to salary, US Bank offers a comprehensive benefits package, including incentive and recognition programs, equity stock purchase 401k contribution and pension (all benefits are subject to eligibility requirements). Pay Range: $105,230.00 - $123,800.00 - $136,180.00Show more Report"
        ],
        "Hard Skills": [
            "Scrum (Software Development)",
            "Code Review",
            "Microsoft Azure",
            "Agile Software Development",
            "Docker (Software)",
            "Git (Version Control System)",
            "Kubernetes",
            "VMware Aria Suite",
            "Python (Programming Language)",
            "Full Stack Development",
            "Terraform",
            "Emerging Technologies",
            "Reliability Engineering",
            "Optimal Design",
            "Ansible",
            "Infrastructure as Code (IaC)",
            "Java (Programming Language)",
            "Jenkins",
            "Testability",
            "DevOps",
            "Windows PowerShell",
            "CI/CD",
            "Scalability",
            "Amazon Web Services",
            "New Product Development",
            "Accruals"
        ],
        "Soft Skills": [
            "Analytical Skills",
            "Interpersonal Communications",
            "Communications",
            "Self-Motivation",
            "Innovation",
            "Problem Solving",
            "Reliability"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-proofpoint-JV_KO0,17_KE18,28.htm?jl=1008880642112": {
        "Location": "Alabama",
        "Data": [
            "It's fun to work in a company where people truly BELIEVE in what they're doing! We're committed to bringing passion and customer focus to the business. The Role Proofpoint’s Security Products Group is looking for an engineer to work on designing, building, and deploying our large-scale threat detection pipeline. Our team develops the next generation distributed pipeline to detect, analyze and produce intelligence for the latest threats from sophisticated cyber threat actors. Our detection services are the foundational components which are leveraged across Proofpoint’s cybersecurity product offerings to protect our customers from threats delivered through e-mail, social media, and SaaS applications. We are a fast-paced, high-energy team where you will be given the opportunity to make a significant impact. The team has a solid engineering culture that values the craftsmanship of writing great code, enjoys learning, and solving big problems. Engineers on the team, work up and down the software stack to tackle challenges of scaling, reliability, security, and usability for our users. Your day-to-day Be member of a high-performing team of engineers responsible for building critical threat detection and analysis services Develop code, unit tests, and BDD to create resilient and scalable features Help define processes and build tools as needed to scale the solution and the team Contribute innovative ideas for the service to stay ahead of threat actors Collaborate with teammates and colleagues in partner teams What you bring to the team Bachelor's degree in computer science or information systems 5+ years of industry experience with Python and/or Go, with a solid understanding of common data structures 3+ years of professional experience with AWS (S3, IAM, RDS, etc.), Kubernetes, Helm, Docker, Jenkins, Terraform, CI/CD, Elasticsearch and other modern tools Experience with distributed systems like Temporal.io Strong motivation and ability to learn modern technologies and domains A positive can-do attitude and bring a passion for excellence to the workplace Excellent collaboration and communication skills Knowledge of cybersecurity, malware analysis, threat detection and/or sandboxing technology a bonus Participate on the on-call rotation #LI-EC1 #LI-Remote If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us! Consistent with Proofpoint values and applicable law, we provide the following information to promote pay transparency and equity. Our compensation reflects the cost of labor across several U.S. geographic markets, and we pay differently based on those defined markets as set out below. Pay within these ranges varies and depends on job-related knowledge, skills, and experience. The actual offer will be based on the individual candidate. The range provided may represent a candidate range and may not reflect the full range for an individual tenured employee. This role may be eligible for variable pay and/or equity. We offer a competitive benefits package that includes flexible time off, a robust well-being program that provides for 4 global wellbeing days per year, and a 3-week work from anywhere option. Base Pay Ranges: SF Bay Area, New York City Metro Area: Base Pay Range: 128,940.00 - 202,620.00 USD California (excludes SF Bay Area), Colorado, Connecticut, Illinois, Washington DC Metro, Maryland, Massachusetts, New Jersey, Texas, Washington, Virginia, and Alaska: Base Pay Range: 106,750.00 - 167,750.00 USD All other cities and states excluding those listed above: Base Pay Range: 96,320.00 - 151,360.00 USDShow more Report"
        ],
        "Hard Skills": [
            "Behavior-Driven Development",
            "Cyber Threat Intelligence",
            "Unit Testing",
            "Docker (Software)",
            "Kubernetes",
            "Temporal.io",
            "Python (Programming Language)",
            "Terraform",
            "Malware Analysis",
            "Scalability",
            "Cyber Security",
            "Jenkins",
            "Elasticsearch",
            "Data Structures",
            "Threat Detection",
            "CI/CD",
            "Amazon S3",
            "Build Tools",
            "Computer Science",
            "Information Systems",
            "Go (Programming Language)"
        ],
        "Soft Skills": [
            "Enthusiasm",
            "Customer Service",
            "Energetic",
            "Resilience",
            "Teamwork",
            "Innovation",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-lockheed-martin-corporation-JV_KO0,17_KE18,45.htm?jl=1008915469826": {
        "Location": "Alabama",
        "Data": [
            "JOB ID: 652390BR Date posted: Sep. 18, 2023 Program: LRHW  Description:Do you have a commitment to success, proven interpersonal skills, a positive outlook? Are you a creative thinker and problem solver? Are you looking for a meaningful career?  If so, then we would love to speak with you! The Engineering & Technology organization is a highly dynamic and growing organization that plays a vital role in providing mission-critical solutions to our customers.  Come be a part of the development of the new Long Range Hypersonic Weapon (LRHW). Join the Lockheed Martin team and be a part of the company that has developed and flown more hypersonic vehicles than any other U.S. Company and has decades of hypersonic development and flight test experience from government contracts as well as internal investments in research and development projects. This position is for a software engineer to support the LRHW software organization. You will help code, develop, and innovate technical solutions for soldier utilized ground systems.  This position requires strong communication skills, and the ability to work both independently and in a team environment, and to interface with software developers, test engineers, system engineers, program management, quality assurance engineers, and customer representatives. Basic Qualifications: Professional Java or C++ experienceAgile development and processesStrong problem solving and troubleshooting skillsExcellent team orientation skillsDoD Secret Clearance Desired Skills: Experience developing ground software for military systemsFull software development lifecycle experienceExperience with JIRA, Confluence, and GitLabKnowledge of PythonKnowledge of RHEL Security Clearance Statement:This position requires a government security clearance, you must be a US Citizen for consideration. Clearance Level:Secret Other Important Information You Should Know Expression of Interest:By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings. Ability to Work Remotely:Onsite Full-time: The work associated with this position will be performed onsite at a designated Lockheed Martin facility. Work Schedules:Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits. Schedule for this Position:9x80 every other Friday off Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. At Lockheed Martin, we use our passion for purposeful innovation to help keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work.   With our employees as our priority, we provide diverse career opportunities designed to propel, develop, and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. We place an emphasis on empowering our employees by fostering an inclusive environment built upon integrity and corporate responsibility.  If this sounds like a culture you connect with, you’re invited to apply for this role. Or, if you are unsure whether your experience aligns with the requirements of this position, we encourage you to search on Lockheed Martin Jobs, and apply for roles that align with your qualifications. Experience Level:Experienced Professional Business Unit:SPACE Relocation Available:Possible Career Area:Software Engineering Type:Full-Time Shift:First At Lockheed Martin, we apply our passion for purposeful innovation to keep people safe and solve the world's most complex challenges. Mission-Focused Innovation: From aerospace to outer space to cyber space, you can solve the world's most complex challenges for our customers. Foundational Values: Our culture of performance excellence, ethics, teamwork and inclusion is embedded in everything we do. Diverse Career Opportunities with Meaningful Work: Grow your career and skills for life. Our technology-driven learning platforms and programs enable your development and agility. Your Health, Your Wealth, Your Life: Our flexible schedules, competitive pay and comprehensive benefits enable you to live a healthy, fulfilling life at and outside of work. Empowered to Be Your Best: Use your strengths to make a difference in the lives of one another, our customers, our communities and our planet. Commitment to Sustainability: We foster innovation, integrity and security to preserve the environment, strengthen diverse communities and propel growth. Here, the possibilities are endless because we offer: Flexible Schedules, dependent on role Levels: Student, Entry, Mid, Senior, Management Locations: Nationwide & OCONUS PositionsShow more Report"
        ],
        "Hard Skills": [
            "Flight Testing",
            "C++ (Programming Language)",
            "Security Clearance",
            "Secret Clearance",
            "Red Hat Enterprise Linux",
            "Learning Platforms",
            "JIRA",
            "Java (Programming Language)",
            "Software Engineering",
            "Software Development Life Cycle",
            "Corporate Social Responsibility",
            "Software Development",
            "Research And Development",
            "Test Engineering"
        ],
        "Soft Skills": [
            "Interpersonal Communications",
            "Ethical Standards And Conduct",
            "Quality Assurance",
            "Program Management",
            "Teamwork",
            "Communications",
            "Problem Solving",
            "Innovation",
            "Management"
        ]
    },
    "https://www.glassdoor.com/job-listing/automated-test-engineer-software-tester-qa-engineer-peopletec-inc-JV_KO0,51_KE52,65.htm?jl=1008814026469": {
        "Location": "Alabama",
        "Data": [
            "Responsibilities: PeopleTec, Inc. is seeking an Automated Test Engineer to support development efforts at our Huntsville, AL location. The candidate will work in an Agile environment to support the digital transformation of a DoD testing infrastructure through migration to cloud-based services and development of M&S capabilities. The successful candidate will have experience with automated unit and integration test development, DevSecOps pipeline development and maintenance, and creating and updating technical documentation. Responsibilities: Develop an understanding of product requirements and create test cases based on those requirements. Collaborate with multiple software teams to develop and update unit and integration testing suites that ensure software products perform their intended function in an efficient and stable manner. Improve product quality by detecting and tracking issues, analyzing test coverage data and developing solutions for improvement, and documenting progress toward verification and validation. Develop and maintain automated testing pipelines. Create and maintain documentation related to software products, including user and admin documentation, training material, SDPs, and test plans. Qualifications: Qualifications: Secret clearance or the ability to obtain a secret clearance. Bachelor’s degree in Computer Science or a relevant technical field and a minimum of 2 years experience. Experienced with multiple programming languages, such as JS/TS (including Node.js), Python, C, and C++. Experienced with test automation frameworks, especially those used with JS/TS (Vitest, Mocha, Chai, Cypress, etc.). Detail-oriented with experience developing clear and concise technical documentation. Knowledge of git, container technologies such as Docker and Kubernetes , and CI/CD pipelines. Desired Experience: Operating in an Agile Scrum environment Familiar with cloud technologies Security+ Certification Familiarity with CMMI processes  Overview:  People First. Technology Always. PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce. Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields. Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people. Come Experience It. #cjpost #dpost EEO Statement PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, applicationhelp@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Mocha (JavaScript Framework)",
            "C++ (Programming Language)",
            "Digital Transformation",
            "DevSecOps",
            "CompTIA Security+",
            "Code Coverage",
            "Docker (Software)",
            "Git (Version Control System)",
            "Kubernetes",
            "Secret Clearance",
            "Scrum (Software Development)",
            "Test Automation",
            "Chai (Software)",
            "Customer Support",
            "Integration Testing",
            "Cloud Technologies",
            "Python (Programming Language)",
            "Technical Documentation",
            "Product Requirements",
            "Node.js (Javascript Library)",
            "CI/CD",
            "Verification And Validation",
            "Computer Science",
            "Automation",
            "Agile Methodology",
            "Test Planning",
            "Capability Maturity Model Integration",
            "JavaScript (Programming Language)",
            "Top Secret-Sensitive Compartmented Information (TS/SCI Clearance)"
        ],
        "Soft Skills": [
            "Detail Oriented"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-regions-JV_KO0,17_KE18,25.htm?jl=1008921471521": {
        "Location": "Alabama",
        "Data": [
            "Thank you for your interest in a career at Regions. At Regions, we believe associates deserve more than just a job. We believe in offering performance-driven individuals a place where they can build a career --- a place to expect more opportunities. If you are focused on results, dedicated to quality, strength and integrity, and possess the drive to succeed, then we are your employer of choice.  Regions is dedicated to taking appropriate steps to safeguard and protect private and personally identifiable information you submit. The information that you submit will be collected and reviewed by associates, consultants, and vendors of Regions in order to evaluate your qualifications and experience for job opportunities and will not be used for marketing purposes, sold, or shared outside of Regions unless required by law. Such information will be stored in accordance with regulatory requirements and in conjunction with Regions’ Retention Schedule for a minimum of three years. You may review, modify, or update your information by visiting and logging into the careers section of the system.  Job Description: At Regions, the Software Engineer oversees application development, modification, and maintenance of applications. This position monitors system applications, ensures systems run smoothly, and creates reports and other documentation outlining findings/solutions. This position sits within Regions' Technology department.  Primary Responsibilities Oversees development and installation of new hardware and software Provides advice and recommendations to management on processes and techniques required for improved work operations Installs and configures systems and other software Tests installed software for malfunction detection Identifies and resolves business systems issues Designs and deploys new applications and enhancements to existing applications, software, and operation systems Measures effectiveness and efficiency of existing systems Develops and implements strategies to improve systems Monitors and tests system performance Oversees the training of junior engineers to improve job skills and work efficiency Typically has full ownership of a process May act as a procedural expert  This position is exempt from timekeeping requirements under the Fair Labor Standards Act and is not eligible for overtime pay.  Requirements Bachelor's degree in Computer Science, Computer Engineering or a related field Seven (7) years of experience  Skills and Competencies Ability to collaborate with programmers, developers, and other technology professionals to achieve a common objective Ability to conduct system analysis to detect issues with performance Ability to develop and implement technology solutions to resolve technical challenges Ability to manage multiple projects simultaneously Knowledge of software testing techniques, code optimization and software debugging Strong communication, analytical and problem solving skills Strong executional capabilities Thorough understanding of software structures, hardware, computing systems and how to integrate them  Support, configure, and monitor SharePoint Server, SharePoint Online, OneDrive, Power Platform, and Teams environments Provide problem solving and troubleshooting for SharePoint Server, SharePoint Online, OneDrive, Power Platform, and Teams Perform SharePoint Server patching (requires after hours and weekend support) Perform Power Platform Deployments (requires after hours and weekend support) Help maintain operational and technical documentation for SharePoint Server, SharePoint Online, OneDrive, Power Platform, and Teams configuration and support processes Advanced PowerShell scripting support for SharePoint Server, SharePoint Online, OneDrive and Teams ShareGate Migrations Lotus Notes Migrations SailPoint Integration  Position Type Full time  Compensation Details Pay ranges are job specific and are provided as a point-of-market reference for compensation decisions. Other factors which directly impact pay for individual associates include: experience, skills, knowledge, contribution, job location and, most importantly, performance in the job role. As these factors vary by individuals, pay will also vary among individual associates within the same job.  The target information listed below is based on the national range and level of the position.  Job Range Target: Minimum: $101,804.50 USD Median: $143,900.00 USD Incentive Pay Plans: Opportunity to participate in the Long Term Incentive Plan.  Benefits Information Regions offers a benefits package that is flexible, comprehensive and recognizes that \"one size does not fit all\" for benefits-eligible associates. Listed below is a synopsis of the benefits offered by Regions for informational purposes, which is not intended to be a complete summary of plan terms and conditions. Paid Vacation/Sick Time 401K with Company Match Medical, Dental and Vision Benefits Disability Benefits Health Savings Account Flexible Spending Account Life Insurance Parental Leave Employee Assistance Program Associate Volunteer Program  Please note, benefits and plans may be changed, amended, or terminated with respect to all or any class of associate at any time. To learn more about Regions’ benefits, please click or copy the link below to your browser.  https://www.regions.com/welcometour/benefits.rf  Location Details Riverchase Operations Center Location: Hoover, Alabama  Bring Your Whole Self to Work  We have a passion for creating an inclusive environment that promotes and values diversity of race, color, national origin, religion, age, sexual orientation, gender identity, disability, veteran status, genetic information, sex, pregnancy, and many other primary and secondary dimensions that make each of us unique as individuals and provide valuable perspective that makes us a better company and employer. More importantly, we recognize that creating a workplace where everyone, regardless of background, can do their best work is the right thing to do.  OFCCP Disclosure: Equal Opportunity Employer/Disabled/VeteransShow more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Business Systems",
            "Systems Analysis",
            "Program Optimization",
            "Application Development",
            "Software Testing",
            "Microsoft Power Platform",
            "ShareGate",
            "Marketing",
            "Technology Solutions",
            "Technical Documentation",
            "Scripting",
            "Computer Engineering",
            "Software Engineering",
            "Windows PowerShell",
            "Computer Science",
            "Microsoft SharePoint",
            "Employee Assistance Programs",
            "Microsoft Teams"
        ],
        "Soft Skills": [
            "Communications",
            "Collaboration",
            "Management",
            "Operations",
            "Troubleshooting (Problem Solving)",
            "Problem Solving"
        ]
    },
    "https://www.glassdoor.com/job-listing/database-and-software-engineer-kbr-JV_KO0,30_KE31,34.htm?jl=1008755120954": {
        "Location": "Alabama",
        "Data": [
            "Title: Database and Software Engineer Develop innovative weapon systems for the Warfighter! ABOUT THIS POSITION: Join a diverse team of talented and inspired engineers and analysts to develop US Army Air and Missile Defense systems in Huntsville, Alabama. The KBR Team in Huntsville, AL is seeking a Database and Software Engineer to support the design and management of desktop and web applications and their underlying databases, including the implementation and configuration of structured databases for big data analytics within a government enterprise. This candidate will be part of a software tools development team and will be responsible for administering and maintaining SQL Server databases and developing long-term data management and storage strategies at the enterprise level. The DBA is ultimately responsible for the establishment and management of policies and procedures related to data security and integrity. This person will work with a cross-section of internal IT organizations, including other DBAs, analysts, developers, and management teams. Position Type: This is a full time, contractor site position in Huntsville, AL. ESSENTIAL DUTIES AND RESPONSIBILITIES: Perform core DBA functions supporting multiple SQL Server instances Allocate systems storage and develop plans for future growth requirements Plan and implement effective availability, backup, recovery, and business continuity strategies Support multiple system environments for development, testing, and production releases Create database objects such as stored procedures, triggers, and packages, and perform tuning, database administration, and troubleshooting Proactively diagnose and resolve problems affecting database performance Define high-level standards for database management Analyze system performance; identify problems and implement solutions; provide input towards reviewing and tuning complex SQL statements Design, develop, and maintain plugins and extensions for Windows desktop applications REQUIRED QUALIFICATIONS: Bachelor’s degree in Computer Science, Information Systems, or information technology related major 10+ years of experience in SQL Database Administration Master's Degree can be substituted for an additional 2 years of experience Strong understanding of database management concepts, data normalization, and optimization techniques Proficiency in database backup and recovery strategies Knowledge of database security principles and best practices Ability to diagnose and troubleshoot Microsoft SQL Server Understanding of DevOps and Infrastructure as Code Experienced, self-reliant individual able to solve complex issues with little instruction Experience with database tuning, monitoring, installation, configuration, and maintenance Effective verbal and written communication skills; ability to adapt communication style to suit different audiences or facilitate group discussions and develop accurate written materials to communicate information clearly and concisely Ability to operate in a dynamic environment and take on various roles as part of the daily program operations Ability to build solid relationships with team members, leadership, and customers Candidate must be a US Citizen Possess (and be able to maintain) a Secret Clearance PREFERRED QUALIFICATIONS: Proficiency in C/C++/C# Experience in Python and/or MATLAB Experience in Linux Experience with programming/scripting languages (i.e. PowerShell) for automating DBA tasks Demonstrated ability creating and maintaining procedural and systemic documentation WHO WE ARE: KBR Government Solutions delivers mission critical full life cycle services that improve military readiness, drive innovation, and help ensure mission success. Since WWII, we have led many of the federal government’s most important programs in the areas of defense, space, and technology. Today, our employees are solving some of the world’s most challenging problems and inspiring the future. KBR Government Solutions core capabilities include engineering, operations, logistics, science, program and acquisition management, IT, cyber and security services. KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Database Administration",
            "Database Tuning",
            "Data Normalization",
            "Secret Clearance",
            "Linux",
            "Stored Procedure",
            "Development Testing",
            "Python (Programming Language)",
            "Microsoft SQL Servers",
            "Business Continuity",
            "Infrastructure as Code (IaC)",
            "SQL (Programming Language)",
            "C# (Programming Language)",
            "Scripting",
            "MATLAB",
            "DevOps",
            "Software Engineering",
            "Database Management",
            "Windows Desktop",
            "Windows PowerShell",
            "Computer Science",
            "Database Security",
            "Big Data Analytics",
            "Big Data",
            "Data Security",
            "Data Management",
            "Information Systems",
            "Web Applications",
            "Automation"
        ],
        "Soft Skills": [
            "Communications",
            "Discussion Facilitation",
            "Writing",
            "Information Technology",
            "Management",
            "Operations",
            "Innovation",
            "Troubleshooting (Problem Solving)",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/uas-software-systems-engineer-c2e-peopletec-inc-JV_KO0,33_KE34,47.htm?jl=1008768023558": {
        "Location": "Alabama",
        "Data": [
            "Responsibilities: PeopleTec seeks a UAS Software Systems Engineer to assist the Program Management Office (PMO) Uncrewed Aircraft Systems (UAS) Command Control and Effects (C2E) Product Office (PO) by providing software system subject matter expertise to C2E on the Launched Effects (LEs) and supporting program planning and development activities. The SSE will provide the following duties: Collect information on systems-level project specifications, performance requirements, and known capabilities and limitations as they relate to the LE system. Review contractor developed systems software to improve performance, correct errors, and conform with compatibility requirements of available hardware. Determines feasibility of proposed system modifications or design, ensuring the needs and requirements of the user will be met within time and cost requirements Designs systems software to meet project requirements, collaborating with systems analysts, engineers, programmers, and other developers as needed. Develops and leads software system testing and validation procedures; compiles relevant documentation. Uses mathematical models and scientific analysis to predict and measure consequences and other outcomes of software system design. Coordinates and schedules installation of software system.  Qualifications: Knowledgeable of DO 178C and Design Assurance Levels (DAL) Ability to review and analyze computer programs for various purposes. Ability to analyze and address needs of users based on User Requirements and CONOPS. Thorough understanding of computer engineering principles and procedures. Ability to manage time and prioritize tasks. Knowledge of Modular Open System Approach (MOSA) and Agile design and development principles Excellent verbal and written communication skills. Communication skills to interface with government and contractors to represent technical and programmatic positions  Overview:  People First. Technology Always. PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce. Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields. Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people. Come Experience It. #cjpost #dpost EEO Statement PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, applicationhelp@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Software Systems",
            "Design Assurance",
            "System Testing",
            "User Requirements Documents",
            "Scientific Methods",
            "Command Controls",
            "Customer Support",
            "Mathematical Modeling",
            "Concept Of Operations",
            "DO-178B/C (Software Considerations in Airborne Systems and Equipment Certification)",
            "Project Management Office (PMO)",
            "Systems Design",
            "Computer Engineering",
            "Unmanned Aerial Systems (UAS)",
            "Agile Methodology"
        ],
        "Soft Skills": [
            "Planning",
            "Time Management",
            "Information Gathering",
            "Writing",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/2023-software-engineer-for-artificial-intelligence-applications-1st-edge-JV_KO0,63_KE64,72.htm?jl=1008931550819": {
        "Location": "Alabama",
        "Data": [
            "Company Description 1st Edge is a growing business seeking top performers to join in our mission of developing Artificial Intelligence solutions for our Government customers. We offer technically advanced, challenging work in an employee-centered environment driven by the desire to contribute to a meaningful purpose. Our employees work closely with Space and Missile Defense Command (SMDC), Missile Defense Agency (MDA), and Combat Capabilities Development Command (CCDC). We believe in a balanced, quid pro quo relationship between the company and its employees, providing all benefits at no cost plus generous time off. This balanced culture allows employees to do their best work and contributes to our extraordinary success rate. From an excellent benefits package to job autonomy with challenging work, 1st Edge cultivates an innovative and collaborative environment with meaningful work.  Job Description Based on the requirements of our government contracts, you must be a U.S. Citizen and have or be able to obtain a secret security clearance. This position is on-site, located in Huntsville, AL. Responsibilities include, but are not limited to the following tasks: Agile software development in small, fast-paced groups Development duties include full software life-cycle tasks: requirements analysis, design, development, testing, and integration Conduct machine learning model training for teammates and/or customers  Qualifications Essential job skills include: Strong knowledge and experience with artificial intelligence concepts and development methods Strong communication skills Knowledge of data science development and parsing techniques Proven experience with SW development tools – git, Visual Studio Code, Azure DevOps or similar, Docker SW languages – Python 3+ and/or an OOP language such as C# SW development methods – Scrum, CI/CD Strong interpersonal skills and attention to detail Work independently with minimal supervision Desired skills: Experience developing knowledge based systems, genetic algorithms, or other AI solutions SW frameworks – Torch/PyTorch, Tensorflow, Pandas, OpenCV General Requirements: 5-15 years of related experience Ability to obtain and maintain a security clearance US Citizenship required Education Requirements: Bachelor’s Degree in Computer Science, Computer Engineering or Software Engineering Additional Information All your information will be kept confidential according to EEO guidelines. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law. However, please note, based on the requirements of our Government contracts, you must be a U.S. citizen to apply for this position.Show more Report"
        ],
        "Hard Skills": [
            "Azure DevOps",
            "Knowledge-Based Systems",
            "Agile Software Development",
            "Microsoft Visual Studio",
            "Security Clearance",
            "Secret Clearance",
            "Data Science",
            "Genetic Algorithm",
            "Docker (Software)",
            "Git (Version Control System)",
            "Machine Learning Model Training",
            "Scrum (Software Development)",
            "Development Testing",
            "Python (Programming Language)",
            "Parsing",
            "Torch (Machine Learning)",
            "Software Engineering",
            "Requirements Analysis",
            "C# (Programming Language)",
            "PyTorch (Machine Learning Library)",
            "OpenCV",
            "Artificial Intelligence",
            "CI/CD",
            "Computer Engineering",
            "Object-Oriented Programming (OOP)",
            "Computer Science",
            "Programming Tools",
            "TensorFlow",
            "Pandas (Python Package)"
        ],
        "Soft Skills": [
            "Interpersonal Communications",
            "Detail Oriented",
            "Innovation",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-peopletec-inc-JV_KO0,17_KE18,31.htm?jl=1008893920865": {
        "Location": "Alabama",
        "Data": [
            "Responsibilities:  PeopleTec is currently seeking a Software Engineer to support our Huntsville, AL location. Responsible for executing software development with a specific focus on developing aviation HWIL capabilities. The software development candidate will be developing unique software solutions and exploring new technologies in the realm of avionics communications and testing. Design the software architecture to ensure its compatibility with physics-based simulation systems, emphasizing scalability, maintainability, and extensibility. The ideal candidate will have proven skills in writing clean, maintainable, and testable code and architecting of software products and tools from the ground up.  Qualifications: Desired Skills/Experience: Experience with embedded C/C++ programming and Python Experience with SOLID principles and design Working understanding of Agile development methodologies Experience with Git version control Good verbal and written communication skills Experience supporting the Army T&E and/or FVL communities. Experience integrating SILs (specifically aviation SILs) Ability to obtain an interim DoD Security Clearance after start date and maintain this level of clearance during their employment. Travel: 10 % Must be a U.S. Citizen An active DoD Secret clearance is required to perform this work. Candidates are required to have an active Secret clearance upon hire, and the ability to maintain this level of clearance during their employment. Education Requirements: BS in STEM & 5 years experience Overview:  People First. Technology Always. PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce. Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields. Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people. Come Experience It. #cjpost #dpost EEO Statement PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, applicationhelp@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "Security Clearance",
            "Agile Methodology",
            "Git (Version Control System)",
            "Embedded C",
            "Secret Clearance",
            "Python (Programming Language)",
            "Customer Support",
            "Solid Principles",
            "Software Architecture",
            "Testability",
            "Software Engineering",
            "Scalability",
            "Version Control",
            "Physics",
            "Software Development"
        ],
        "Soft Skills": [
            "Writing",
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-2-contract-boeing-JV_KO0,28_KE29,35.htm?jl=1008843490912": {
        "Location": "Alabama",
        "Data": [
            "Assists with the development, documentation and maintenance of architectures, requirements, algorithms, interfaces and designs for software systems. Develops and maintains code and integrates software components into a fully functional software system. Assists with test procedures and documenting test results to ensure software system requirements are met. Supports software project management and software supplier management functions.  Selects, tailors and deploys processes and tools; establishes metrics. Performs software research and trade studies. Troubleshoots software issues. Works under general supervision.Show more Report"
        ],
        "Hard Skills": [
            "Software Project Management",
            "Software Systems",
            "Algorithms",
            "Supplier Management"
        ],
        "Soft Skills": [
            "Research"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-3-eteam-inc-JV_KO0,19_KE20,29.htm?jl=1008877453038": {
        "Location": "Alabama",
        "Data": [
            "Job Description: Develops, documents and maintains architectures, requirements, algorithms, interfaces and designs for software systems. Develops and maintains code and integrates software components into a fully functional software system. Develops software verification plans, test procedures and test environments, executing the test procedures and documenting test results to ensure software system requirements are met. Performs software project management and software supplier management functions.  Develops, selects, tailors and deploys software processes, tools and metrics. Executes and documents software research and development projects. Serves as a subject matter expert for software domains, system-specific issues, processes and regulations. Tracks and evaluates software team and supplier performance to ensure product and process conformance to project plans and industry standards.  Works under general direction.Show more Report"
        ],
        "Hard Skills": [
            "Software Project Management",
            "Software Systems",
            "Algorithms",
            "Supplier Management",
            "Supplier Performance Management"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-na-oiwi-kane-JV_KO0,17_KE18,30.htm?jl=1008933571018": {
        "Location": "Alabama",
        "Data": [
            "Tactica Solutions LLC, an SBA certified 8(a), is seeking a full time, experienced Software Engineer with Secret clearance to support multiple prototype projects with the Army Hypersonic Project Office within the Rapid Capabilities and Critical Technologies Office (RCCTO). The RCCTO mission it is to rapidly and efficiently research, develop, prototype, test, evaluate, procure, transition, and/or field critical enabling technologies and capabilities that address near-term, and mid-term threats. This position requires the following:  Provide subject matter expertise in software engineering to oversee vendor software development AHPO ground segment software. Review vendor software that includes requirements analysis & traceability, software design, testing, independent verification and validation, configuration management, metrics, software assurance, data management and software environments Assess vendor’s software development and implementation schedule, to include: code generation, test analysis – tools and data, simulation and emulation software and data sets, sensor/weapon system/communications device software, data acquisition software, analog and digital processing software, and configuration interface software packages Support the vendor’s software prototype integration and participate in an IPT, software design reviews and industry engagements Oversee a vendor’s software integration process – from plan to design to implementation. This can also include reviewing documentation for the process so that future managers and engineers know how to solve potential issues Coordinate project information structure and flow to ensure that two or more programs can communicate effectively without barriers  Tasks performed in this role may include:  Reviewing requirements definition and traceability Ensure SW requirements align with system requirements Participation in software code review Participation in software test activity Review vendor’s software independent verification and validation efforts Support software simulation efforts Review delivered SW CDRLs Support Software System Safety Technical Reviews  Job Requirements:  Required Skills Bachelor’s degree in Computer Science, Programming, Mathematics, or related field US. citizenship with Secret Clearance Ability to work well in an agile and fast paced work environment Possess excellent written, oral, and interpersonal communications skills  Required Experience  Experience in the design analysis of software programs so that they integrate with specific systems and offer technical support during software preparation, installation, and system maintenance Objected Oriented design and development experience with programming languages such as C/C++, C#, JavaScript, and Python and practice building software Minimum of 5 years related software experience methodologies and continuous integration methodologies 5+ years direct experience supporting DoD or IC Acquisitions Experience with Agile development Knowledge of DevOps Knowledge of Docker, Kubernetes, AWS, Azure, GitLab, etc. Experience with the Jira tools  Desired Qualifications  Experience in agile software development methodologies Experience with architectural design patterns Experience with Linux operating systems Experience in developing autonomous systems, particularly in the areas of swarm behavior, decentralized algorithms, and edge computing Experienced in the design analysis of software programs  Clearance: Applicants selected may be subject to a government security investigation, must meet eligibility requirements for access to classified information, and must have a Secret security clearance as a minimum prior to beginning employment. Please note: Tactica Solutions LLC reserves the right to change or modify job duties and assignments at any time. The above job description is not all encompassing. Position functions and qualifications may vary depending on business needs. Tactica Solutions LLC is an equal opportunity employer and does not discriminate against applicants based on race, color, creed, religion, medical condition, legally protected genetic information, national origin, sex (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity and expression, age, disability, or Vietnam era, or other eligible veteran status or legally protected characteristics. Get job alerts by email. Sign up now! Join Our Talent Network! Job Snapshot Employee Type Full-Time Location Redstone Arsenal, AL (Onsite) Job Type Engineering Experience Not Specified Date Posted 09/30/2023Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Design",
            "Project Coordination",
            "Linux",
            "Agile Methodology",
            "Microsoft Azure",
            "Agile Software Development",
            "Software Technical Review",
            "Secret Clearance",
            "Software Analysis",
            "Docker (Software)",
            "Kubernetes",
            "Project Management Office (PMO)",
            "Information Structure",
            "Algorithms",
            "Python (Programming Language)",
            "Software Testing",
            "Continuous Integration",
            "Internet Protocol Telephony",
            "Architectural Design",
            "JIRA",
            "Code Generation",
            "System Safety",
            "Software Engineering",
            "Edge Computing",
            "Requirements Analysis",
            "Autonomous System",
            "Data Acquisition",
            "C# (Programming Language)",
            "Amazon Web Services",
            "DevOps",
            "Software Development",
            "Configuration Management",
            "Code Review",
            "Verification And Validation",
            "JavaScript (Programming Language)",
            "Computer Science",
            "Gitlab",
            "Data Management",
            "Technical Support",
            "Traceability",
            "Systems Integration",
            "System Requirements",
            "Classified Information"
        ],
        "Soft Skills": [
            "Communications",
            "Mathematics",
            "Interpersonal Communications",
            "Research",
            "Investigation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-requirements-engineer-tuskegee-university-JV_KO0,30_KE31,50.htm?jl=1008840661398": {
        "Location": "Alabama",
        "Data": [
            "Position Information Position Title Software Requirements Engineer  Job Summary The Flight and Ground Systems Division within the Space Systems Department at MSFC desires a Senior Software Requirements Development Engineer with an established background in Software Requirements development for real time embedded avionics subsystems to include associated toolsets. The candidate will be proficient in Agile Development Processes as they apply to the development and certification of Software Documentation to include Software Requirements. This position requires a solid understanding of the software development, test, and verification engineering discipline as well as the CMMI 3 level processes involved.   Essential Job Duties Spearhead the creation, review, and development of senior engineer level Software Requirements products to support to the Systems Engineering and Integration Division within the Space Systems Department at MSFC.  This includes technical performance requirements, functional flow decomposition and diagrams, trade studies, functional allocation, interface requirement documents, verification requirement planning, software requirement specifications, verification matrices, reliability and others.  Develop and maintain Software Requirements through extensive inter and intra team communications e.g. Configuration Management, Design, Test, and Software Review Boards.  Perform analyses and trade studies to determine the proper distribution and definition of requirements to meet the competing demands of performance, cost, and schedule.  Maintain proper documentation and records utilizing DOORS. Interact with Design, Test teams, and external vendors to develop and automate products and processes used to create them.   Qualifications (Education, Experience and Specialized Training) Degree in Engineering or related field is required. Degree from an ABET-accredited university is preferred. Typically, educational requirements are the equivalent of a Ph.D., with a minimum 9 years of experience, Masters with at least 13 years of experience, or BS with at least 15 years of experience.   Desired skills and experience: Expertise in in the specification of avionics flight software and associated tools for a launch vehicle system. Ability to review and provide relevant feedback on avionics and software technical products. Broad understanding of Systems and Software Engineering processes such as Agile and Object Oriented Methodologies.   Physical Demands Requires sitting for extended periods of time in meetings with peers, management, and with our client at NASA facilities to discuss technical issues (10%). Requires sitting for extended periods of time at a desk to write reports and perform engineering tasks (40%). Requires ability to use stairs or elevators for access between floors and multiple buildings at NASA and Jacobs facilities (10%).   Skills and Attributes Requires ability to operate a personal computer, a telephone, fax machine, copier, calculator, and other general office equipment (100%). The ability to work independently with minimal supervision, and to make rational decisions, and to exercise good judgment is essential (100%). Grooming and dress must be appropriate for the position and must not impose a safety risk/hazard to the employee or others Requires ability to provide clear, concise, accurate and timely communication, both verbally and in writing (100%). Requires ability to interact professionally with co-workers, management, and client (100%).  Posting Detail Information Posting Number  Will this position required travel? YES  Will this position required night, weekend, and after hour work? YES  Will this positon be supported using grants or contract funding? N/A  Number of Vacancies 1  Desired Start Date  Position End Date (if temporary)  Open Date 05/16/2023  Close Date 12/31/2023  Open Until Filled No  Special Instructions Summary Each applicant, including all current employees, must complete and submit the following documents: Tuskegee University employment application Cover Letter Resume/CV Recommendation letters Copies of unofficial transcripts. Please note that official transcripts(s) will be required upon hire   Quick Link for Internal Postings https://tuskegee.peopleadmin.com/postings/764Show more Report"
        ],
        "Hard Skills": [
            "Object-Oriented Programming (OOP)",
            "Office Equipment",
            "Agile Methodology",
            "Software Technical Review",
            "Technical Performance Measure",
            "Software Documentation",
            "Flight Software",
            "Launch Vehicle Systems",
            "Software Engineering",
            "Configuration Management",
            "Systems Engineering",
            "Software Development",
            "Capability Maturity Model Integration",
            "Avionics"
        ],
        "Soft Skills": [
            "Communications",
            "Planning",
            "Calculators",
            "Professionalism",
            "Report Writing",
            "Management"
        ]
    },
    "https://www.glassdoor.com/job-listing/entry-level-software-engineer-4m-research-inc-JV_KO0,29_KE30,45.htm?jl=1008895295926": {
        "Location": "Alabama",
        "Data": [
            "Are you looking for a career with a company known for it's culture and investment in its people? Are you looking for an amazing retirement program, best in class health insurance and a robust benefits package? Are you looking to work in an environment where you feel appreciated and part of a work family? If so, 4M Research is the employer for you! 4M Research, Inc. (4M) is a Woman owned small business established in 2007 and headquartered in Huntsville, AL. 4M specializes in Systems and Software Engineering and Analysis, Information Technology, Planning and Analysis, and Field Support Services to a variety of customers including MDA, NASA, and AMCOM. Our continuous and rapid growth is attributable to the caliber of employees 4M strives to hire and retain. We are currently seeking an Entry Level Software Engineer for our team in Huntsville, AL. Required Qualifications: ABET accredited BS in STEM or related technical field Background/ Education in software development Ability to obtain and maintain a Secret Security Clearance (Active Secret Clearance Preferred) Desired Qualifications: Strong Background in C/C++ Background in MATLAB Experience developing and maintaining System/Software Engineering artifacts Analysis of software source code and binary executable files Experience in software analysis tools such as Understand, CodeSonar, CodeDx, and CodePeer Please Note: US Citizenship is required Qualified candidates should apply online at www.4mresearch.com. For assistance call 256-319-4646. 4M Research, Inc. is an Affirmative Action/ Equal Opportunity Employer and an active participant in the Employment Eligibility Verification Program (E-Verify).Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "System Software",
            "Secret Clearance",
            "Software Analysis",
            "Information Technology Planning",
            "Software Engineering",
            "MATLAB",
            "Software Development"
        ],
        "Soft Skills": [
            "Research"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-systems-engineer-mid-career-dynetics-JV_KO0,36_KE37,45.htm?jl=1008924656483": {
        "Location": "Alabama",
        "Data": [
            "Dynetics, a wholly owned subsidiary of Leidos, is seeking a talented Software Systems Engineer to join a multi-discipline engineering team developing software for aviation systems. With offices across the United States engaging in the defense, space, cyber and commercial fields, Dynetics provides responsive, cost-effective engineering, scientific and IT solutions. Dynetics is well known for our people-oriented culture, positive work environment, technical excellence, and resilient business ethics. The candidate will be responsible for tracking upcoming system features, creating, and tracking schedules, managing Agile software teams, and maintaining priorities on the product backlog. The candidate can expect to work in a fast-paced working environment developing offensive and defensive weapon system. The team follows Agile software practices, shares a passion for solving complex problems, delivering exceptional software, improving software development processes, and exceeding customer expectations. Basic Qualifications Candidate must possess the following: Bachelor’s degree in Systems Engineering, Software Engineering, Computer Science, Computer Engineering, or an equivalent degree with 4 years of professional software systems engineering experience or 2 years of experience with a Master's degree Experience with requirements traceability, functional allocation and decomposition, schedule tracking, and team coordination Ability parse ambiguous requirements and translate them into team direction and guidance Must currently reside in or be willing to relocate to the greater Huntsville, AL area  Other Qualifications The preferred candidate should possess the following: Experience in Agile/Scrum software or DevSecOps methodologies C++ development experience Demonstrated capability to work effectively within a cross functional IPT Demonstrated strong verbal and written communication skills Security Requirements Candidate must be a US Citizen and possess (and be able to maintain) a Final Secret Clearance or meet the eligibility to obtain (and maintain) a Secret Clearance.Show more Report"
        ],
        "Hard Skills": [
            "Software Systems",
            "C++ (Programming Language)",
            "DevSecOps",
            "Requirements Traceability",
            "Parsing",
            "Secret Clearance",
            "Scrum (Software Development)",
            "Internet Protocol Telephony",
            "Security Requirements Analysis",
            "Software Engineering",
            "Computer Engineering",
            "Agile Software Development",
            "Systems Engineering",
            "Computer Science",
            "Software Development",
            "Agile Methodology"
        ],
        "Soft Skills": [
            "Business Ethics",
            "Resilience",
            "Writing"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-leonardo-drs-JV_KO0,17_KE18,30.htm?jl=1008905043696": {
        "Location": "Alabama",
        "Data": [
            "Job ID: 108159  The Leonardo DRS Land Electronics business provides C4I Network computing and integrated situational awareness, as well as state-of-the-art embedded diagnostics, vehicle power management and combat vehicle integration products and services.  Job Summary Job Responsibilities Involved with the design, development, analysis, testing and debugging of computer software applications and/or systems. May include Image and Signal Processing, Real-time, Firmware, Nuclear/Hi-Rel, FAA Certified, Database Design, Operating Systems, Operator/Machine Interface, or others. Develop software tools including operating systems, compilers, routers, networks, utilities, databases, and Internet-related tools. Determine hardware compatibility. Complete documentation and procedures for installation and maintenance. Interact with users to define system requirements and/or necessary modifications. Support and participate in technical activity Design, develop, analyze, document and support testing of products, systems or subsystems May use computer-aided engineering or other design/analysis software in the performance of assignments Ability to work independently under supervision of others Provide regular reporting of progress and status Responsible for completion of assigned task on time and meeting technical requirements Review customer specifications and requirements, and under direction, develop designs to best support them, including cost as a key design variable Specify and evaluate supplier components, subsystems and services Support the program design to cost and design for manufacture requirements Develop prototypes to retire key development risks as directed Communicate clearly (written and oral) with other company personnel and the customer as required May participate in preparation of less complex proposals Support, communicate, reinforce and defend the mission, values and culture of the organization Attend appropriate engineering, customer or business meetings Job Responsibilities Part II Qualifications Novice technical expertise and application domain knowledge Bachelor’s degree in engineering or Related technical field  Only candidates that meet the qualifications set forth above are eligible to be contacted for further information. We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas.  Taking care of our people is a top priority at Leonardo DRS. We are proud to offer competitive salaries and comprehensive benefits, including medical, dental, and vision coverage, a company contribution to a health savings account, telemedicine, life and disability insurance, legal insurance, and a 401(k) savings plan. We champion wellness programs that focus on physical, emotional, and financial well-being. We develop our talent by offering programs and activities to support career-growth, professional development, and skill enhancement. And we understand there is more to life than work, and the importance of offering flexible work schedules with our 9/80 program, competitive vacation, health/emergency leave, paid parental leave, and community service hours. Some employees are eligible for limited benefits only  Leonardo DRS, Inc. and its subsidiaries and affiliates are equal opportunity employers and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law. #LELShow more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Computer Aided Engineering (CAE)",
            "Hardware Compatibility (Software Requirements)",
            "Compilers",
            "Power Management",
            "Computer Networks",
            "Database Design",
            "Operating Systems",
            "Nuclear Power"
        ],
        "Soft Skills": [
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/principal-software-development-analyst-c2bmc-23-692-northrop-grumman-JV_KO0,51_KE52,68.htm?jl=1008931823041": {
        "Location": "Alabama",
        "Data": [
            "Requisition ID: R10131911 Category: Information Technology Location: Huntsville, Alabama, United States of America Citizenship required: United States Citizenship Clearance Type: Secret Telecommute: No- Teleworking not available for this position Shift: Days (United States of America) Travel Required: Yes, 10% of the Time Relocation Assistance: Relocation assistance may be available Positions Available: 3 At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history. Northrop Grumman Space Systems has an exciting career opportunity for a C2BMC Principal Software Development Analyst to join our team of qualified, diverse individuals. This position will be located in Huntsville, AL. Position Overview: The selected candidate will be a team member of the Performance Assessment Scrum Team on the C2BMC National Team. Will work with a multi-contractor team in the development and execution of a comprehensive performance assessment of system algorithms and capabilities. The candidate will participate in the planning and execution of assessments of the C2BMC tactical code. Develop metrics and execute tests against performance requirements allocated to the multiple subsystems that comprise the C2BMC system. Essential Functions: Develop metrics in Java to diagnose specific system algorithm behaviors and data flow to ensure the C2BMC system is meeting requirements. Implement and maintain tooling to support the automated pipeline. Work to develop, maintain, and measure Technical Performance Measures (TPM)/Special Items of Interest (SII) and associated documentation for performance reviews. Interface with development teams to track and resolve bugs and performance issues found in the tactical software. Interface with the development teams, customers, and independent assessors of the C2BMC program to ensure all observations are tracked and communicated across the program. Prepare and deliver presentations to leadership and external stakeholders with measured performance results. The selected candidate should thrive in a fast-paced work environment with high expectations, significantly diverse assignments, and collaborative/team settings across all levels. Limited travel may be required. Basic Qualifications: Please note your updated security clearance and IAT/relevant certifications on your resume, if applicable. Bachelor’s Degree in a STEM (Science, Technology, Engineering or Mathematics) discipline preferred from an accredited university and 5 years of related experience, or a Master's Degree in a STEM discipline and 3 years of related experience, or a PhD and 0 years of related experience, or 9 years related experience in lieu of a degree. Must understand DoD and missile defense command and control, battle management, architectures and communications system concepts, mission, and common system test and data analysis techniques. Must have experience with software development or tooling automation. This position requires exposure to various MDA personnel and associated sub-elements. Must have experience in relevant DoD interface, assessment, test methodologies, terminologies, and Missile Defense Agency (MDA) elements or components. Must have experience writing programs in one or more programming languages, specifically Java and Python. Must have experience with automated metric pipelines and database management. A candidate must have experience developing visualization tools for communication with stakeholders. Must be able to quickly develop new metrics or plug-ins to identify or diagnose issues found in data. Must work effectively and cooperatively with people within and outside the program. Experience developing software with Eclipse and Git Understanding of standard system engineering design artifacts such as system requirements, Use Cases and SysML diagrams. Ability and willingness to travel 10% to support business needs. Applicants must have a current active in-scope U.S. Government DoD issued Secret security clearance which is required to start. Preferred Qualifications: Experience with verifying requirements, System Engineering, and iterative product development using Agile practices is a plus. Experience developing capability assessments, assessment objectives, and related assessment plans and procedures. Experience in scripting and automated test development is a plus. Some Travel is required to program sites (COS-83 and Schriever Space Force Base, Colorado Springs, CO) and possibly other locations. Salary Range: $95,100 - $142,700 Employees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business. The health and safety of our employees and their families is a top priority. The company encourages employees to remain up-to-date on their COVID-19 vaccinations. U.S. Northrop Grumman employees may be required, in the future, to be vaccinated or have an approved disability/medical or religious accommodation, pursuant to future court decisions and/or government action on the currently stayed federal contractor vaccine mandate under Executive Order 14042 https://www.saferfederalworkforce.gov/contractors/. Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit http://www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions.Show more Report"
        ],
        "Hard Skills": [
            "Algorithms",
            "System Testing",
            "Security Clearance",
            "Secret Clearance",
            "Systems Engineering",
            "Technical Performance Measure",
            "Git (Version Control System)",
            "Scrum (Software Development)",
            "Python (Programming Language)",
            "Performance Review",
            "Battle Management Technology",
            "Eclipse (Software)",
            "Communications Systems",
            "Java (Programming Language)",
            "Scripting",
            "Test Automation",
            "Database Management",
            "Agile Methodology",
            "Automation",
            "Dataflow",
            "Data Analysis",
            "Software Development",
            "Systems Modeling Language"
        ],
        "Soft Skills": [
            "Presentations",
            "Planning",
            "Courage",
            "Intellectual Curiosity",
            "Communications",
            "Mathematics",
            "Information Technology",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/entry-level-software-developer-systemedx-inc-JV_KO0,30_KE31,44.htm?jl=1008917765097": {
        "Location": "Alabama",
        "Data": [
            "Our company is in search for a .Net Developer for our growing team. We are looking for an entry level developer with little to no professional experience required. This is a full-time position, Monday thru Friday 8 – 5 at our office location.SKILLS & RESPONSIBILITIES:We are looking for someone who has some experience with Microsoft Visual Studio and VB.NET. Candidate will design, build, test, and debug functional applications to meet business needs. Some required and beneficial skills are listed below.Required proficiency in Microsoft Visual Studio, specifically VB.NET and/or C#, and the Visual Studio debugger.Required proficiency in SQL queries, with experience in Microsoft SQL Server.Experience with ASP.NET, HTML5, CSS3, JavaScript, and JQuery is beneficial but not required.Experience with RESTful APIs is beneficial but not required.Required understanding of project management principles.Required ability to communicate with supervisors and peers.Winning candidates will demonstrate the ability to navigate code in Visual Studio, the ability to write SQL queries and find data using SQL Server Management Studio.QUALIFICATIONS:Associate’s Degree in Computer Science or related field or 2 years of experience in programmingExperience does not have to be professional experienceBENEFITS:Quarterly Bonus StructureDental InsuranceHealth InsurancePaid Vacation / Sick TimeINTERVIEW PROCESS:The interview process will include demonstrating the ability to navigate code.*Applicants must be currently authorized to work in the United States on a full-time basis.Job Type: Full-timePay: $15.00 per hourBenefits:Dental insuranceHealth insurancePaid time offSchedule:8 hour shiftMonday to FridaySupplemental pay types:Bonus opportunitiesEducation:High school or equivalent (Preferred)Experience:.NET: 1 year (Preferred)SQL: 1 year (Preferred)Work Location: In personShow more Report"
        ],
        "Hard Skills": [
            "Application Programming Interface (API)",
            "Visual Basic .NET (Programming Language)",
            "Microsoft Visual Studio",
            ".NET Framework",
            "Debugging",
            "Cascading Style Sheets (CSS)",
            "ASP.NET",
            "RESTful API",
            "Project Management",
            "SQL (Programming Language)",
            "Microsoft SQL Servers",
            "C# (Programming Language)",
            "HTML5",
            "SQL Server Management Studio",
            "JQuery",
            "JavaScript (Programming Language)",
            "Computer Science"
        ],
        "Soft Skills": [
            "Communications"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-rocketvox-JV_KO0,17_KE18,27.htm?jl=1008829032777": {
        "Location": "Alabama",
        "Data": [
            "Engineering — Birmingham, Alabama ABOUT THE JOB  We're looking for mad skills! Are you a high-energy geek? We need more Agile software developers that understand less is more, duties include:  Maintaining our platform source code Documenting that source code Implementing new features Simplifying existing features Testing, testing, testing Did we mention testing? ABOUT YOU Knowlegable C and PHP programmer Understanding of JSON and web-based APIs We love Git, you should too Proficient with Linux based development tools A deep understanding of Linux Experience with n-tier environments Independent worker, team thinker ABOUT US We enable small businesses and entreprenuers with a powerful cloud-based virtual phone system and every day we work hard to make the experience better. Flexible hours Work from home opportunities Profit sharing and bonus programs Full and part-time contract work available Work hard, play hard Interested? jobs@rocketvox.comShow more Report"
        ],
        "Hard Skills": [
            "Application Programming Interface (API)",
            "Git (Version Control System)",
            "Linux",
            "Multitier Architecture",
            "PHP (Scripting Language)",
            "JSON",
            "Agile Software Development",
            "Programming Tools"
        ],
        "Soft Skills": [
            "Energetic"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-react-native-mobile-kraken-JV_KO0,44_KE45,51.htm?jl=1008790460952": {
        "Location": "Alabama",
        "Data": [
            "Building the Future of Crypto Our Krakenites are a world-class team with crypto conviction, united by our desire to discover and unlock the potential of crypto and blockchain technology. What makes us different? Kraken is a mission-focused company rooted in crypto values. As a Krakenite, you’ll join us on our mission to accelerate the global adoption of crypto, so that everyone can achieve financial freedom and inclusion. For over a decade, Kraken’s focus on our mission and crypto ethos has attracted many of the most talented crypto experts in the world. Before you apply, please read the Kraken Culture page to learn more about our internal culture, values, and mission. As a fully remote company, we have Krakenites in 60+ countries who speak over 50 languages. Krakenites are industry pioneers who develop premium crypto products for experienced traders, institutions, and newcomers to the space. Kraken is committed to industry-leading security, crypto education, and world-class client support through our products like Kraken Pro, Kraken NFT, and Kraken Futures. Become a Krakenite and build the future of crypto! Proof of work The team We are currently seeking an experienced Senior Software Engineer to join our growing Engineering team. In this role, you will be responsible for developing and maintaining both our Web and Mobile user interfaces using React and React Native, respectively. Your expertise in building scalable and high-performance applications will directly contribute to the success of our platform. The opportunity Design, develop, and maintain high-quality web and mobile applications using React and React Native Collaborate with cross-functional teams, including Product, Design, and Backend Engineering, to ensure seamless integration of new features and improvements Contribute to the architecture and design of our web and mobile applications Identify, analyze, and resolve performance bottlenecks and inefficiencies in the codebase Write and maintain comprehensive unit tests and documentation Stay up-to-date with the latest industry trends and technologies to ensure our applications remain current and competitive Mentor junior developers and participate in code reviews to maintain a high standard of code quality Skills you should HODL Bachelor's degree in Computer Science or a related field, or equivalent experience 5+ years of experience in software development, with a focus on web and mobile applications Deep understanding of JavaScript/TypeScript and proficiency with React and React Native frameworks Experience with Next.js, RESTful APIs and WebSockets Experience with frontend testing frameworks Familiarity with modern front-end build pipelines and tooling Strong understanding of UI/UX best practices and principles Excellent problem-solving skills, attention to detail, and ability to work independently and as part of a team Strong written and verbal communication skills in English Nice to Haves Knowledge of the cryptocurrency industry and blockchain technology Familiarity with native mobile app development (iOS/Android) $135,000 - $203,000 a year This is the target annual salary range for this role. This range is not inclusive of other additional compensation elements, such as our Bonus program, Equity program, Wellness allowance, and other benefits [US Only] (including medical, dental, vision and 401(k)). The compensation range provided is influenced by various factors and represents the initial target range. Our salary offerings are dynamic and we strive to ensure that our base salary and total compensation package aligns and recognizes the top talent we aim to attract and retain. The compensation package of the successful candidate is based on various factors such as their skillset, experience, and job scope. Location Tagging: #US #EU #LI-LM1 #LI-Remote #Canada Kraken is powered by people from around the world and we celebrate all Krakenites for their diverse talents, backgrounds, contributions and unique perspectives. We hire strictly based on merit, meaning we seek out the candidates with the right abilities, knowledge, and skills considered the most suitable for the job. We encourage you to apply for roles where you don't fully meet the listed requirements, especially if you're passionate or knowledgable about crypto! As an equal opportunity employer, we don’t tolerate discrimination or harassment of any kind. Whether that’s based on race, ethnicity, age, gender identity, citizenship, religion, sexual orientation, disability, pregnancy, veteran status or any other protected characteristic as outlined by federal, state or local laws. Stay in the know Follow us on Twitter Learn on the Kraken Blog Connect on LinkedInShow more Report"
        ],
        "Hard Skills": [
            "Code Review",
            "TypeScript",
            "Blockchain",
            "Application Programming Interface (API)",
            "React Native",
            "Product Design",
            "Android (Operating System)",
            "Mobile Application Development",
            "Unit Testing",
            "Next.js (Javascript Library)",
            "React.js (Javascript Library)",
            "Codebase",
            "WebSocket",
            "Cryptocurrency",
            "Software Quality (SQA/SQC)",
            "RESTful API",
            "Mobile UI Design",
            "Scalability",
            "Front End Design",
            "User Experience (UX)",
            "JavaScript (Programming Language)",
            "Computer Science",
            "Non-Fungible Tokens (NFT)",
            "Equities",
            "Software Development",
            "Apple IOS",
            "Front End (Software Engineering)"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Verbal Communication Skills",
            "English Language",
            "Problem Solving"
        ]
    },
    "https://www.glassdoor.com/job-listing/junior-aviation-systems-embedded-software-engineer-dynetics-JV_KO0,50_KE51,59.htm?jl=1008891408262": {
        "Location": "Alabama",
        "Data": [
            "Are you a Software/Computer Engineer with an interest in aviation systems software development, do you possess varied technical interests and able to demonstrate your engineering skills? Perhaps you’re a self-starter who’s ready to experience working on inter-disciplinary teams to solve challenging technical problems, as well as looking for an opportunity to be in a fast-paced small team environment through all phases of the product life cycle from conceptual development to post-delivery support? If so, the Aviation Software team is interested in YOU! Leidos, Dynetics Group is seeking a talented Junior Aviation Systems Embedded Software Engineer to join a multi-discipline engineering team developing software for aviation systems. We have offices across the United States engaging in the defense, space, cyber, and commercial fields, we provide responsive, cost-effective engineering, scientific, and IT solutions. Dynetics is well known for our people-oriented culture, positive work environment, technical excellence, and resilient business ethics. As a member of the team, you will work closely with electronics integrated into a diverse range of aerospace and military systems including manned/unmanned ground/air vehicles, missiles, defensive radars, and space systems. You’ll be responsible for developing robust software solutions. Your primary job function will include implementing and testing embedded software solutions targeting microprocessors, SoCs, and FPGAs. You’ll support resolution of technical issues discovered during the development, integration, and test of deliverable products. You’ll have the opportunity to join forces and partner with other engineers and developers, project managers, technicians, and the customer to develop solutions adhering to a diverse set of requirements. You'll be mentored by Senior Software Engineers on your team. Become a part of a team where you'll know that the systems we develop, and support are keeping deployed warfighters safe on the battlefield as well as aiding in the defense of our nation from foreign adversaries. Basic Qualifications Must possess or be pursuing a bachelor’s or master’s degree in Software Engineering, Computer Science, Computer Engineering, Electrical Engineering, Aerospace Engineering, or Mathematics from an ABET Accredited University. Demonstrate competency in software development in the C and C++ programming languages. Hands-on lab experience with instrumentation, test equipment, and debug/test methods for software and hardware. Capable of performing in a collaborative engineering environment working closely with multi-disciplinary teams. Have a passion for good object-oriented software design techniques. Willingness to participate in and contribute to software design and code reviews. Candidate must be a resident of or be willing to relocate to the Huntsville, AL area. Candidate must be a U.S. Citizen.  Other Qualifications Working knowledge and/or experience in the following: The Linux operating system. Microprocessor architectures such as ARM Cortex, PowerPC, and x86. Embedded operating systems such as VxWorks, Integrity, and FreeRTOS. Python programming. Software versioning and release cycles. Agile processes such as SCRUM. Communication protocols such as UART, Ethernet, SPI, I2C, and CAN. Security Requirements Candidate must be a US Citizen and possess (and be able to maintain) a Final Secret Clearance or meet the eligibility to obtain (and maintain) a Secret ClearanceShow more Report"
        ],
        "Hard Skills": [
            "Software Versioning",
            "Software Design",
            "Embedded Operating Systems",
            "Object-Oriented Programming (OOP)",
            "Code Review",
            "C++ (Programming Language)",
            "Powerpc",
            "Electrical Engineering",
            "Aerospace Engineering",
            "Debugging",
            "Computer Engineering",
            "Embedded Software",
            "Software Engineering",
            "Project Management",
            "X86 Architecture",
            "Secret Clearance",
            "Scrum (Software Development)",
            "Laboratory Experience",
            "FreeRTOS",
            "Communications Protocols",
            "Security Requirements Analysis",
            "Product Lifecycle Management",
            "Agile Methodology",
            "Test Equipment",
            "Serial Peripheral Interface",
            "VxWorks",
            "Linux",
            "Python (Programming Language)",
            "Computer Science",
            "Universal Asynchronous Receiver/Transmitter",
            "ARM Architecture",
            "Software Development",
            "C (Programming Language)",
            "Field-Programmable Gate Array (FPGA)",
            "Electronics",
            "Microprocessor"
        ],
        "Soft Skills": [
            "Business Ethics",
            "Self-Motivation",
            "Mathematics",
            "Resilience"
        ]
    },
    "https://www.glassdoor.com/job-listing/application-engineer-ii-automation-schweitzer-engineering-laboratories-JV_KO0,34_KE35,70.htm?jl=1008841682059": {
        "Location": "Alabama",
        "Data": [
            "As a SEL Application Engineer - Automation a typical day might include the following: Developing expertise in power systems automation, communications, and control. Developing expertise in related SEL products and solutions. Helping customers either in-person or virtually apply SEL products and solutions through visits/meetings, demonstrations, training, and/or troubleshooting. Providing solutions to a wide variety of increasingly difficult problems. Solutions are increasingly imaginative, thorough, and practical. Participating and presenting at SEL marketing and sales activities, industry technical meetings, and conferences. Publishing application guides, notes, template guides, software tools, and/or technical conference papers. Contributing to product specifications, application and testing software, and literature. This job might be for you if you enjoy: Continuous learning Teaching Troubleshooting Creating innovative solutions Hybrid/Remote work model A strong focus on customer service Traveling 25%-33% (Typically local, onsite troubleshooting, conferences, customer meetings, etc.) Required Qualifications: Bachelor’s degree in Electrical Engineering (or equivalent engineering degree) and/or Computer Science from ABET accredited institution. This position is posted for multiple SEL field office locations with the ability for remote work (which will be based on experience level) from a mutually acceptable location within one of the following states: Alabama, Arkansas, Florida, Georgia, Louisiana, Mississippi, South Carolina, North Carolina, or Virginia. If you live close enough to an existing SEL Field Office, hybrid work is also allowed up to 40% work from home and office. Normal working hours for this position are Monday through Friday 8 a.m. to 5 p.m. Southeast Region SEL Field Offices: Dothan, AL Prattville, AL Lutz, FL Columbus, GA Alpharetta, GA Jackson, MS Tupelo, MS Charlotte, NC Chattanooga, TN Desired Qualifications: Relevant work experience and knowledge of utility and/or industrial power systems with an emphasis on automation, communications, and control. Applicable knowledge areas but not limited to: SCADA (Supervisory Control and Data Acquisition) fundamentals. SCADA protocols: DNP3 Modbus RTU and Modbus TCP/IP SEL Protocol Suite IEC 61850 Protocol Suite Ethernet/IP (Industrial Protocol) OPC UA RTUs (Remote Terminal Units) RTAC (Real-Time Automation Controller) IEDs (Intelligent Electronic Devices) SEL Relays (3XX, 4XX, 5XX, 6XX, 7XX, 8XX) PLCs (Programmable Logic Controllers) HMI (Human Machine Interface) Serial Communications EIA-232 EIA-485 Ethernet Communications TCP/IP and UDP Firewalls, Security Gateways SEL-362X Terminal Servers SEL-3610 Cellular Routers SEL-3061 or equivalent third-party Managed Network Switches SDN (Software Defined Networking) IEC 61131-3 Programming Languages ST – Structured Text CFC – Continuous Function Chart LD – Ladder Diagram Communication Troubleshooting particularly using Wireshark. Benefits: People are at the core of our company, and we hire employee-owners. We welcome you to learn more about how we support employees. From medical, prescription, dental, vision, and life insurance to paid time off, parental leave and our tuition reimbursement. Competitive pay. Superior benefits. Inspiring work. People are at the core of our company and we hire employee-owners. We welcome you to learn more about how we support employees. We’re 100% employee owned. Retirement benefits include an employer funded stock ownership plan (ESOP) and personal 401K options. We offer top tier medical, prescription, dental, vision, life, and disability insurance. We recognize the importance of a healthy life balance and offer: 10 paid holidays, annual vacation accrual starting at 12 days, 9 paid sick days, and paid family and medical leave that covers 90% of your pay. We foster growth and development of our employees through avenues such as STEM courses, apprenticeships, tuition assistance, and engineering development programs. Ask our team about other benefits including wellness, fertility, adoption, and flexible spending benefits. Pay Range Data We anticipate filling this position as an Application Engineer - Automation with a pay range of $80,000 - $142,000 based on location and experience. We are open to reviewing additional candidates with more or less experience and the salary range may differ if filled at a different level. Our salary ranges are determined by job, responsibility, and location. We base our starting pay offer and title on location and job-related factors such as candidate experience, training, knowledge, and skills. Communication with Applicants We communicate with all applicants. If you do not receive a response about your application, please check your SPAM filter or reach out to us at careers@selinc.com. SEL is an Equal Opportunity Employer: Vets/Disabled.Show more Report"
        ],
        "Hard Skills": [
            "Programmable Logic Controllers",
            "Electric Power Systems",
            "Human Machine Interfaces",
            "Structured Text",
            "Software Defined Networking (SDN)",
            "IEC 61131 Standard",
            "Remote Terminal Unit",
            "Protocol Stack",
            "SEL Relays",
            "Marketing",
            "Supervisory Control And Data Acquisition (SCADA)",
            "Distributed Network Protocol (DNP3)",
            "Ladder Diagram",
            "IEC 61850",
            "Firewall",
            "Wireshark",
            "Computer Science",
            "TCP/IP",
            "Modbus",
            "Electrical Engineering",
            "Automation",
            "Demonstration Skills"
        ],
        "Soft Skills": [
            "Communications",
            "Sales",
            "Customer Service",
            "Innovation",
            "Imagination",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-xanté-corporation-JV_KO0,17_KE18,35.htm?jl=1007717994721": {
        "Location": "Alabama",
        "Data": [
            "Xanté is dedicated to continuing the tradition of providing customers with leading-edge technology for the graphic publishing market with exceptional products backed by service and support that is unmatched in this industry. That’s why we have and need great employees!   We are also accepting applications for work-from-home, remote sales reps. Please contact us if you have any questions. SOFTWARE ENGINEER Qualified candidates will be proficient C or C++ programmers with knowledge of UNIX and Windows. Individuals will be responsible for the design, development, testing and deployment of software solutions for a variety of printing devices. Other tasks include developing test cases, test procedures, and automated test scripts in conjunction with designing and developing software for embedded systems. A working knowledge of Java, HTML, UNIX, TCP/IP, Windows, and Mac OS is very helpful. Multiple positions available. Minimum requirement of two years actual work experienceShow more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "Unix",
            "Development Testing",
            "Mac OS",
            "Java (Programming Language)",
            "HyperText Markup Language (HTML)",
            "Embedded Systems",
            "Test Automation",
            "Software Engineering",
            "TCP/IP",
            "C (Programming Language)"
        ],
        "Soft Skills": [
            "Sales"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-developers-junior-positions-gps-it-solutions-JV_KO0,36_KE37,53.htm?jl=1005685503346": {
        "Location": "Alabama",
        "Data": [
            "GPS IT Solutions currently has the following openings to work at various customer sites throughout the USA. Applicants must be willing to travel and/or relocate.  Qualified and interested professionals are requested to Respond with resume and contact details to hr@gpsitsolutions.com . GPS IT Solutions. is seeking Software Developers in Tuscaloosa, AL to analyze user requirements, design, develop, test, and deploy various software applications under supervision of Sr. Software Developers. Requirements: BS or foreign equivalent in Comp. Sc./IT/Engg. /Math or related plus 2 years of relevant IT using Java, Microsoft SQL Server, .NET and Salesforce. Positions required travel to various unanticipated locations in the United States.  Please submit resume to: hr@gpsitsolutions.comShow more Report"
        ],
        "Hard Skills": [
            ".NET Framework",
            "User Requirements Documents",
            "Microsoft SQL Servers",
            "Java (Programming Language)",
            "Software Development"
        ],
        "Soft Skills": [
            "Mathematics"
        ]
    },
    "https://www.glassdoor.com/job-listing/retrofit-solutions-engineer-sr-engineer-airbus-JV_KO0,39_KE40,46.htm?jl=1008929022616": {
        "Location": "Alabama",
        "Data": [
            "Job Description: Airbus Commercial Aircraft is looking for a Retrofit Solutions Engineer - Sr. Engineer to join our Engineering Team located in Mobile, Alabama. Meet the team: Our Engineers have the privilege of working on complex, highly engineered machines and are involved at all stages of the aircraft life cycle, from product development to manufacturing and direct support to our airline customers. If you’re interested in designing, creating, and testing the present and future of Airbus products across the globe, join our mission to connect the world. Your working environment: The Engineering Center in Mobile, Alabama houses hundreds of Airbus engineers who assist in the design and development of Airbus commercial aircraft cabins, including aftermarket upgrades, reconfigurations and services of all product types across the globe. How we care for you: Financial Rewards: Competitive base salary, incentive compensation which may include profit sharing schemes, retirement savings plan and the ability to participate in an Employee Stock Ownership Plan (“ESOP”) Work/Life Balance: Paid time off including personal time, holidays and a generous paid parental leave program. Health & Welfare: Comprehensive insurance coverage including medical (traditional and high-deductible health plans), prescription, dental, vision, life, disability, Employee Assistance Plan (“EAP”) and other supplemental benefit coverages. Individual Development: Upskilling and development opportunities through our global Leadership University, including unlimited access to 10,000+ e-learning courses focusing on ways to develop your employability, certifications, career path as well as the opportunity to participate in accelerated development programmes and both national and international mobility. At Airbus, we support you to work, connect and collaborate more easily and accessibly. Wherever possible, we foster flexible working arrangements to stimulate innovative thinking. Your challenges: Responsible for developing aircraft modifications per project plan. Develop and manage program enablers and ensure their timely and high quality delivery. Responsible to manage all stakeholders to ensure timely delivery of engineering projects. Responsible to manage subcontractors and associated cost and delivery. Provide strong liaison with other departments both internally and internationally. Your boarding pass: Minimum BS degree in engineering or related field: BS degree 9 years / MS 7 years Minimum of 5 years in aviation or 3 years in aircraft modification experience, specifically narrow body aircraft cabin. Must have strong project or program engineering experience. Must have experience with Google Suite Products. Ability to write reports, technical memorandums, interface agreements, work statements and requirements documents using good technical English. Ability to effectively present information to customers, both internal & external. Experience with Python or other programming language Take your career to a new level and apply online now! A full job description will be provided to candidates whom progress to interview stage or any candidate upon request. This job requires an awareness of any potential compliance risks and a commitment to act with integrity, as the foundation for the Company’s success, reputation and sustainable growth. Company: Airbus Americas, Inc. Employment Type: US - Direct Hire Experience Level: Professional Remote Type: On-site Job Family: Customer Eng.&Technical Support&Services <JF-CS-PS> - Airbus provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, genetics, pregnancy, marital status, veteran status or other legally protected status. In addition to federal law requirements, Airbus complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, demotion, termination, layoff, recall, transfer, leaves of absence, compensation, benefits and training. Airbus expressly prohibits any form of workplace harassment based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, genetics, pregnancy, marital status, veteran status or other legally protected status. As a matter of policy, Airbus does not sponsor visas for US positions unless specified. Only applicants with current work authorization will be considered. Airbus does not offer tenured or guaranteed employment. Employment with Airbus is at will, meaning either the company or the employee can terminate the employment relationship at any time, with or without cause, with or without notice. Airbus reserves the right to revise or change job duties and responsibilities as the need arises. This position description does not constitute a written or implied contract of employment. By submitting your CV or application you are consenting to Airbus using and storing information about you for monitoring purposes relating to your application or future employment. This information will only be used by Airbus.  Airbus is committed to achieving workforce diversity and creating an inclusive working environment. We welcome all applications irrespective of social and cultural background, age, gender, disability, sexual orientation or religious belief. Airbus is, and always has been, committed to equal opportunities for all. As such, we will never ask for any type of monetary exchange in the frame of a recruitment process. Any impersonation of Airbus to do so should be reported to emsom@airbus.com .Show more Report"
        ],
        "Hard Skills": [
            "Compliance Risk",
            "Project Planning",
            "Global Leadership",
            "Python (Programming Language)",
            "Google Workspace",
            "Upskilling",
            "Employee Assistance Programs",
            "Aviation",
            "Subcontracting"
        ],
        "Soft Skills": [
            "Training And Development",
            "Report Writing",
            "English Language",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/web-applications-programmer-2051-advanced-systems-design-JV_KO0,32_KE33,56.htm?jl=1008933014122": {
        "Location": "Alabama",
        "Data": [
            "Advanced Systems Design is seeking a Web Applications Programmer for our client located in Montgomery, AL. This position is onsite in Montgomery, AL and requires in-person availability starting day 1. Job Overview: Perform complex analysis, design, development, and maintenance of enterprise-level WEB-based systems. Develop system and program documentation. Perform testing of modifications and enhancements to ensure system integrity. Debug and resolve production problems using system development processes and standards as defined. Transfer of knowledge and skills to other programmers needed. Possesses a strong understanding of systems programming, graphical user interfaces, and control languages. Modifies, installs, and prepares technical documentation for system software applications. Diagnoses, isolates, and debugs software problems and performs problem resolution. Works on multiple products, activities, and projects as a project team member. Works on moderately complex tasks, projects, activities, or support issues that require increased skill in multiple technical environments and develops expertise to support multiple systems. May coach other technical staff. Required Qualifications: 3+ years of experience in verifiable systems administration and computer programming for a Web-based Environment. Experience in ASP.NET and MVC. Software languages: ASP.Net, C#.Net, VB.Net, T-SQL, JAVA Script, TypeScript, HTML, CSS, jQuery, JSON This individual must be able to learn current software systems and tools. The successful candidate must have the ability to understand business requirements and assist with documentation using the MS Office Suite. The ability to troubleshoot and resolve problems is also a skill that is mandatory. Preferred Qualifications: Experience in Bootstrap 4.0 Regular Expressions Core TFS and/or GIT Develop new or enhance programs based on technical specifications presented Collaborate with Business Analysts concerning testing and training Analyze and resolve technical problems and software bugs Maintain and enhance existing +applications Work independently as well as with other team members Multi-task and work on multiple projects concurrently in a fast-paced environment Perform all or part of the full life cycle development process with an emphasis on developing business applications Support existing applications, modifying/enhancing them and current needs, and implementing the changes necessary as the needs of the business unit change Develop and document workarounds for functional issues Troubleshoot real-time production issues Be responsible for supporting the testing of enhancements and fixes Be capable of recommending solutions and identifying required program corrections Contribute towards enterprise-wide metrics collection and participate in action plans Conduct in-depth analysis of Service Requests raised by clients Document new/changed operational procedures Ensure static data/configuration/setups are accurate Participate in peer review processes Respond in a flexible manner and re-prioritize work as situations change Education: Bachelor's Degree in Computer Science, Information Systems, or another related field. Or equivalent work experience. Advanced Systems Design, Inc. is: A leading Information Technology provider for Federal, State & Local government agencies. A certified minority-owned small business government contractor with capabilities related to Public Health IT, Criminal Justice, Transportation, and Defense. A certified service-disabled veteran-owned company with a proud 42-year track record of providing successful innovative solutions for our government customers. A drug-free workplace in accordance with the Drug-Free Workplace Act of 1988. Applicants who have a signed offer of employment or contractor agreement are subject to: the pre-employment testing protocol: background investigation drug screening Our Employees: Are actively working on next-generation technology projects with the U.S. Department of Veterans Affairs, CDC, and a wide array of Federal, State, and Local agencies throughout the United States Are eligible for wide-ranging benefits and perks, including but not limited to: Comprehensive Health Insurance with PPO and HDHP/HSA options Dental Insurance Vision Insurance Short/Long-Term Disability Group Life Insurance - Company Paid Voluntary Life Insurance 401(k) Plan with Employer Match Paid Time Off (Vacation/Sick) Holiday Pay - Company Paid Federal Holidays Tuition Assistance Professional Certification Incentive Plan Employee Referral Plan Technology Exposure For additional information regarding Advanced Systems Design, please check out our WEBSITE or click HERE for all current job openings. Advanced Systems Design is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. 2S3a5HwE1TShow more Report"
        ],
        "Hard Skills": [
            "TypeScript",
            "Software Systems",
            "C# (Programming Language)",
            "Bootstrap (Front-End Framework)",
            "System Software",
            "System Integrity",
            "Peer Review",
            "Visual Basic .NET (Programming Language)",
            "Systems Design",
            "Transact-SQL",
            "Debugging",
            "Git (Version Control System)",
            "JavaScript (Programming Language)",
            "Regular Expressions",
            "System Administration",
            "Model View Controller",
            "ASP.NET",
            "Business Requirements",
            "Technical Documentation",
            "Team Foundation Server",
            "HyperText Markup Language (HTML)",
            "Graphical User Interface",
            "Computer Programming",
            "Cascading Style Sheets (CSS)",
            "JQuery",
            "System Programming",
            "JSON",
            "Computer Science",
            "Information Systems"
        ],
        "Soft Skills": [
            "Multitasking",
            "Knowledge Transfer",
            "Information Technology",
            "Troubleshooting (Problem Solving)",
            "Problem Solving",
            "Collections",
            "Microsoft Office",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-safety-engineer-analyst-peopletec-inc-JV_KO0,32_KE33,46.htm?jl=1008923458119": {
        "Location": "Alabama",
        "Data": [
            "Responsibilities:  PeopleTec is currently seeking a Software Safety Engineer/Analyst to support our Huntsville, AL location. Candidate will participate in Software Safety efforts for the Strategic Operational Rockets and Munitions (STORM) Project Office. Candidate will work with a team alongside other contractors performing software safety activities to include safety analysis of requirements, design, code, and testing STORM Software. Duties Include: Participate in daily/weekly technical interchange meetings Manage and perform software safety oversight Conduct, evaluate, and approve safety analyses and documents to include: Program Plans, Hazard Analysis, Software Safety Analysis Reports, Information Reports and traceability of safety requirements Participate in IPTs, software design reviews, code reviews, test plan reviews, test report reviews, and problem report reviews Provide support of software verification activities to ensure safety traceability and testing to approved Levels of Rigor (LOR) Support test events Conduct Systems and Software Safety Working Groups Provide weekly and periodic status reports and technical reports as requested Estimated time to fill Dec 2023  Qualifications: Required Skills/Experience: 4+ years of experience in systems/software/safety/quality V&V analysis experience with a safety critical system Thorough understanding of the Software Development Life Cycle Understanding of Agile SW Development Ability to express engineering findings orally and in written technical reports Software development/lifecycle IEEE 12207, MIL-STD-498, etc. Familiarity with software languages; C, C++, C#, Ada Familiarity with civil and military airworthiness qualifications Familiarity with software safety requirements such as: MIL-STD-882, DO-178B, DO-278, and DO-254 Ability to work as part of a diverse contractor team (multiple companies) Motivated and customer focused with a drive for quality technical results Travel: 10% Must be a U.S. Citizen An active DoD Secret clearance is required to perform this work. Candidates are required to have an active Secret clearance upon hire, and the ability to maintain this level of clearance during their employment. Education Requirements: A Bachelor's Degree in Computer/Software Engineering, Computer Science, Software Development, Systems Engineering, or other scientific field with 4+ years of relevant work experience related to the safe design and operation of software intensive systems is required. Desired Skills: Experience with Multiple Launch Rocket System (MLRS) Embedded software development to industry best practices Software development processes for Flight-Critical and Safety-Critical Software; DOORS, HELIX, etc. Software development and evaluation tools expertise Development of systems engineering development processes System Safety and Software Safety requirements IAW MIL-STD-882, JSSSEH, AMCOM REG 385-17  Overview:  People First. Technology Always. PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce. Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields. Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people. Come Experience It. #cjpost #dpost EEO Statement PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, applicationhelp@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Code Review",
            "C++ (Programming Language)",
            "Verification And Validation",
            "Project Management Office (PMO)",
            "Secret Clearance",
            "Multiple Launch Rocket System",
            "DO-254 Standard",
            "Software Development Life Cycle",
            "DO-178B/C (Software Considerations in Airborne Systems and Equipment Certification)",
            "Customer Support",
            "System Safety",
            "Military Standards And Specifications",
            "Embedded Software",
            "C# (Programming Language)",
            "C-Based Programming Languages",
            "Hazard Analysis",
            "Airworthiness",
            "Systems Engineering",
            "Computer Science",
            "Software Development",
            "Test Planning",
            "Traceability",
            "Agile Methodology"
        ],
        "Soft Skills": [
            "Customer Service",
            "Problem Reporting"
        ]
    },
    "https://www.glassdoor.com/job-listing/server-engineer-i-franklin-primary-health-center-inc-JV_KO0,17_KE18,52.htm?jl=1008929039916": {
        "Location": "Alabama",
        "Data": [
            "JOB SUMMARY: Under the supervision of the Chief Technology Officer performs activities involved in the maintenance and configuring of Franklin Primary Health Center (FPHC) server and storage infrastructure; assists the installation and testing of new hardware and software; research for further developing the computing infrastructure.RESPONSIBILITES: This position requires proficiency with server and storage hardware, virtualization, operating systems, in a converged and/or hyper-converged infrastructure.1. Employs technical knowledge to configure servers, storage area networks, storage network protocols, and virtualization to deliver a robust computing infrastructure.2. Configures and administers Microsoft Server and Linux-type operating systems, VMware and Microsoft Hyper-V virtualization software, Microsoft SQL or third party vendor database software.3. Manages Active Directory, DNS, DHCP, Group policy, certificate services, and other underlying systems.4. Establishes patching cycle for routine patches and escalations to address exploits, threats, and vulnerabilities.5. Administers backup jobs, policies, and reports on restoration testing efforts on an annual basis.6. Participates in the development of server and storage cyber-security best practices.7. Configures Solarwinds Network Performance Monitor to monitor and report on server infrastructure.8. Researchs, analyzes, proposes and implements innovative solutions to technical and business challenges9. Schedules server upgrades and optimization efforts for the off hours and with change control practices in mind.10. Resolves tickets assigned in Helpdesk software.11. Develops quality documentation of configuration, technical processes and procedures, and documents all ticket and project work.12. Assists in enforcement of FPHC’s policies to maintain security of the computing infrastructure and calls attention to actions that may violate these policies.13. Research technical concepts, educate, and mentor other team members as needed.14. Performs other duties as assigned.QUALIFICATIONS: Minimum two years supporting server and storage infrastructure with basic network troubleshooting skills. Beginner knowledge of storage network protocols, Microsoft Server and Exchange Online, and telecommunication systems. Intermediate knowledge of Active Directory, DNS, DHCP, and GPOs.EDUCATION AND EXPERIENCE: Associate degree; preference will be given to a candidate with an undergraduate degree. Years of experience in a computer related field may be accepted in lieu of education.Job Type: Full-timePay: $70,000.00 - $80,000.00 per yearBenefits:Dental insuranceEmployee assistance programHealth insuranceLife insurancePaid time offRetirement planCompensation package:Yearly payExperience level:2 yearsSchedule:8 hour shiftDay shiftMonday to FridayAbility to commute/relocate:Mobile, AL 36603: Reliably commute or planning to relocate before starting work (Required)Experience:basic network troubleshooting skills: 2 years (Preferred)Active Directory, DNS, DHCP, and GPOs: 1 year (Preferred)Microsoft Server and Exchange Online: 1 year (Preferred)Work Location: In personShow more Report"
        ],
        "Hard Skills": [
            "Hardware Virtualization",
            "Change Control",
            "SolarWinds",
            "Cyber Security",
            "Linux",
            "Virtualization",
            "Microsoft Servers",
            "Active Directory",
            "Office 365 Exchange Online",
            "Network Troubleshooting",
            "Telecommunications Systems Management",
            "Network Performance Management",
            "Microsoft SQL Servers",
            "Dynamic Host Configuration Protocol (DHCP)",
            "Group Policy",
            "Hyper-V",
            "Operating Systems",
            "Storage Area Network (SAN)"
        ],
        "Soft Skills": [
            "Planning",
            "Research",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-ai-signal-research-inc-asri-JV_KO0,17_KE18,45.htm?jl=1008907790399": {
        "Location": "Alabama",
        "Data": [
            "Thank you for your interest in AI Signal Research, Inc. (ASRI). ASRI accepts applications for employment for current career opportunities only.  Education:: ABET accredited BS in an Engineering discipline, or BS in Computer Science or related technical field.  Months/Years of Experience: :Minimum two (2) years of related experience.   Required Qualifications: :U.S. Citizen. Ability to obtain and maintain a security clearance. Knowledge of the complete Software/Systems Development process and lifecycle. Knowledge of requirements management tools (e.g. DOORS). Familiarity with aviation systems. Some travel.  Skills Needed:: Strong background in C/C++, background in Java.  Duties::  Desired Qualifications: :Aviation, IV&V and modeling & Simulation experience is a plus.  Comments: :Compliance with health mandates as dictated by the contract may be required as condition of employment. ASRI offers the following Benefits package: 401K Plan Medical and Dental Insurance Life Insurance Disability Income Educational Assistance Direct Deposit Cafeteria Plan Vision   Drug Free Workplace.: Adherence to ASRI policy on drugs and alcohol is a condition of employment for all employees.  AI Signal Research, Inc. (ASRI) wants all interested and qualified candidates to apply for employment opportunities. If you are an applicant with a disability who is unable to use our online tools to search and apply for jobs, please contact us by calling (in the U.S.) 1-256-551-0008 x29. Please indicate the specifics of the assistance needed. This option is reserved only for individuals with disabilities who are unable to use our online tools and is not intended for any other purpose:.  ASRI is an equal opportunity and affirmative action employer-Veterans/Disabled and other protected categories.Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Systems",
            "Disability Income",
            "Security Clearance",
            "Requirements Management",
            "Java (Programming Language)",
            "Computer Science"
        ],
        "Soft Skills": [
            "Research"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-integration-engineer-modern-technology-solutions-inc-JV_KO0,29_KE30,61.htm?jl=1008896843813": {
        "Location": "Alabama",
        "Data": [
            "Own Your Future. Modern Technology Solutions, Inc. (MTSI), is seeking a Software Integration Engineer in Huntsville, AL. Why is MTSI known as a Great Place to Work? Interesting Work: Our co-workers support some of the most important and critical programs to our national defense and security. Values: Our first core value is that employees come first. We challenge our co-workers to provide the highest level of support and service, and reward them with some of the best benefits in the industry. 100% Employee Ownership: we have a stake in each other's success, and the success of our customers. It's also nice to know what's going on across the company; we have company wide town-hall meetings three times a year. Great Benefits - Most Full-Time Staff Are Eligible for: Starting PTO accrual of 20 days PTO/year + 10 holidays/year Flexible schedules 6% 401k match with immediate vesting Semi-annual bonus eligibility (July and December) Company funded Employee Stock Ownership Plan (ESOP) - a separate qualified retirement account Up to $10,000 in annual tuition reimbursement Other company funded benefits, like life and disability insurance Optional zero deductible Blue Cross/Blue Shield health insurance plan Track Record of Success: We have grown every year since our founding in 1993 Modern Technology Solutions, Inc. (MTSI) is a 100% employee-owned engineering services and solutions company that provides high-demand technical expertise in Digital Transformation, Modeling and Simulation, Rapid Capability Development, Test and Evaluation, Artificial Intelligence, Autonomy, Cybersecurity and Mission Assurance. MTSI delivers capabilities to solve problems of global importance. Founded in 1993, MTSI today has employees at over 20 offices and field sites worldwide. For more information about MTSI, please visit www.mtsi-va.com. Responsibilities: Position Overview: This individual will be part of a team that works directly with Army Aviation and Missile Center (AvMC) and Missile Defense Agency (MDA) Government customers on the C2BMC Distributed Training System (DTS Sim/Stim) conducting development, integration, fielding, and sustainment. The DTS Sim/Stim is a system of systems consisting of distributed training and exercise frameworks as well as weapons systems and sensor modeling applications. The DTS Sim/Stim is the primary driver that provides the stimulus needed to enable Warfighters to train on their operational Missile Defense systems at their warfighting location. Primary responsibility is the integration & interoperability of the Distributed Missile Defense System (MDS) framework, weapons and sensor models, and Hardware in the Loop (HWIL) provided by the various element program offices into the DTS Sim/Stim product. The Systems Integrator is responsible for coordinating the development and interoperability of the C2BMC Distributed Training System. Responsible for maintaining, installing and planning the current and future iterations of the DTS Sim/Stim equipment. Responsibilities require involvement in the planning and coordination of software updates among Missile Defense Agency (MDA) and other organizations to facilitate seamless integration of evolving components within the product suite. Tasks include loading, configuration, maintenance, and troubleshooting the various Modeling & Simulation components within the DTS Sim/Stim environment. Integration efforts will include the analysis and troubleshooting of various tactical messaging protocols such as TADIL-J/Link16, VMF, B-Series, BXS/XML, and ADIP formats. Knowledge of networks, protocols, and RHEL commands will be required in the troubleshooting of various interfaces within and external to the DTS Sim/Stim Product Suite. Qualifications: Required Qualifications: Bachelor’s degree plus six years of experience. Experience may be used in lieu of a degree Active DoD Secret Security Clearance Proficient in operating on Linux based systems Security+ certification or the ability to obtain Security+ certification with 60 days of hire Linux+ certification or have the ability to obtain Linux+ or comparable Operating System certificate within 60 days of hire Aptitude for rapidly learning new concepts and the ability to adapt to a fast-paced environment Must be able to support 10% annual travel worldwide in support of DTS planning, fielding, and system support Knowledge of network protocols and network connectivity troubleshooting Excellent communication, presentation, and written skills Desired Qualifications Knowledge and experience working with the Missile Defense System Experience with MDS truth frameworks and or model simulations such as SSF, OSF, OSM, EADSIM, JSAF, MDST, FOXSIM, BOA, C2BMX, and GFC Experience tactical message protocols (TADIL-J/Link16, VMF, B-Series, BXS/XML, etc.) Experience in providing briefings and/or demonstrations on system capabilities and architectures. Familiarity with DIS, TCP, UDP, and Multicast Please Note: U.S. Citizenship is required for most MTSI positions. #LI-KC1Show more Report"
        ],
        "Hard Skills": [
            "Network Troubleshooting",
            "Operating Systems",
            "Gel Filtration Chromatography",
            "Digital Transformation",
            "System Support",
            "Multicasting",
            "CompTIA Security+",
            "Extensible Markup Language (XML)",
            "Secret Clearance",
            "Network Protocols",
            "Linux",
            "CompTIA Linux+",
            "Red Hat Enterprise Linux",
            "Capability Development",
            "Interoperability",
            "Link 16",
            "Distributed Temperature Sensing (DTS)",
            "Cyber Security",
            "Technology Solutions",
            "Artificial Intelligence",
            "Transmission Control Protocol (TCP)",
            "Systems Integration",
            "Simulations",
            "Demonstration Skills"
        ],
        "Soft Skills": [
            "Planning",
            "Communications",
            "Presentations",
            "Coordinating",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-airworthiness-engineer-brockwell-technologies-JV_KO0,31_KE32,54.htm?jl=1008911160640": {
        "Location": "Alabama",
        "Data": [
            "About Us Brockwell Technologies, Inc. (BTI) was founded in 1998 as a Woman Owned Small Business headquartered in Huntsville, AL. We provide top tier technical and engineering support services to some of the industry’s largest company and government organizations. We believe creating a great employment experience starts with investing in our people, because they are our greatest asset. BTI is a six-time winner of the Huntsville/Madison County Best Places to Work award and certified as a \"Great Place to Work\". To learn more about our company, please click here to view our company website. What We Can Offer You   Great Company Culture - We've been recognized by multiple organizations like Best Places to Work, Great Place to Work, Glassdoor for our workplace culture Employer Paid Benefits - Basic Life and AD&D (Employee Only), Short Term Disability, Long Term Disability, Telemedicine, and Employee Assistance Program for employees and their families Paid Time Off - We provide a generous PTO plan that graduates quickly with the years of service, company paid holidays, and we offer employees a PTO payout Health Benefits - Blue Cross Blue Shield medical with FSA option Dental Benefits - Employer paid dental (base plan) with the option to add a dental buy up plan through our group plan Vision - Low-cost vision insurance  Retirement - 401(K) Plan offered to all part-time and full-time employees aged 21 or older, we offer employees an employer contribution match, you are immediately vested, and at no cost to you access to a personal financial planner Education - We provide both tuition reimbursement and continuing education/training reimbursement Flexible Work Models - In office, work-from-home, or hybrid schedules (determined by our customer) Other Benefits - Dependent Care Flexible Spending Account, Voluntary Term Life Insurance and AD&D, Voluntary Spouse Life and AD&D, Voluntary Dependent Child Life and AD&D, Voluntary Accident, Referral Bonus Program, and so much more! JOB DESCRIPTION Brockwell Technologies, Inc. (BTI) is seeking a Software Airworthiness Engineer to support our customer in Huntsville, AL. Responsibilities The candidate will be responsible for the following duties and tasks:   Conducts software system safety evaluations for DoD systems Supports software system requirements identification and development process by evaluating and assessing planning, design, development, production and operations for DoD software systems architectures. Prepares and writes formal Systems Safety Hazard Analysis Reports to categorize and summarize all potential software-hardware interaction hazards. Performs software safety-critical and mission-critical systems analysis throughout the life cycle from initial requirements through design, implementation, testing, delivery, and support. Utilizes excellent written and oral communication skills to maintain successful daily interaction with customer and teammates. Operates proactively with ability to handle significant responsibility, and attention to detail.   Minimum Qualifications   ABET accredited BS in Computer Engineering Experience developing embedded mission critical software in C, C++, or ADA Familiarity with software development/lifecycle IEEE 12207, MIL-STD-498 Experience with Functional Hazard Analysis (FHA), Fault Tree Analysis (FTA), and/or Failure Mode, Effects & Critically Analysis (FMECA) Working knowledge of MIL-HDBK-516, DO-178, MIL-STD-882, JSSSEH, AMCOM Regulation 385-17, SAE ARP 4761, or similar software safety standards Knowledge of the integration and verification of large systems Experience with Army Aviation SW Systems Experience with the Systems Readiness Directorate (SRD) Knowledge of the Airworthiness Release (AWR) process Knowledge of Army Military Airworthiness Certification Criteria (AMACC) or MIL-HDBK-516C Airworthiness Certification Criteria   Desired Qualifications   Knowledge of static and dynamic code analysis Experience with Model Based Software Development Familiarity with MATLAB and Simulink, Rhapsody, DOORS, SCADE, etc.   Education/ Certifications   Bachelor's Degree in Computer Science, Computer Engineering, Electrical Engineering or relevant technical field   Security Clearance   This position requires an active DoD Secret Security Clearance government security clearance as a condition for placement and continued employment. Applicants must be a U.S. citizen for consideration.  Candidates selected for this position will be subject to a background investigation and must meet eligibility requirements for access to classified information.   U.S. Citizenship is required. BTI is an EEO/M/F/Veteran/Disabled Employer:  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.   To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The qualifications listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Show more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Software Systems",
            "Safety Standards",
            "Security Clearance",
            "Secret Clearance",
            "DO-178B/C (Software Considerations in Airborne Systems and Equipment Certification)",
            "Address Resolution Protocols",
            "Airworthiness Engineering",
            "System Safety",
            "Military Standards And Specifications",
            "Systems Analysis",
            "Failure Mode Effects And Criticality Analysis (FMECA)",
            "MATLAB",
            "Hazard Analysis",
            "Static Program Analysis",
            "Dynamic Program Analysis",
            "Engineering Support",
            "Airworthiness",
            "Computer Engineering",
            "Computer Science",
            "Software Development Life Cycle",
            "Software Development",
            "Electrical Engineering",
            "Employee Assistance Programs",
            "Fault Tree Analysis",
            "Simulink",
            "Classified Information",
            "Aviation"
        ],
        "Soft Skills": [
            "Planning",
            "Verbal Communication Skills",
            "Detail Oriented",
            "Operations"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-safety-quality-engineer-oasys-inc-JV_KO0,32_KE33,42.htm?jl=1008925639141": {
        "Location": "Alabama",
        "Data": [
            "OASYS, INC., a Leading-Edge Government contractor in Huntsville Alabama, is seeking applicants for several Software Quality Assurance Engineer positions we have open. Job Responsibilities include: The Software Quality Assurance Engineer will develop Software Quality Assurance Surveillance Plans and document quality activities in compliance with Army processes and procedures. The successful candidate will implement a system and software quality program per the Army Quality Standard Operating Procedures and other quality processes and procedures while using ISO 9000-3 as a reference. Will support the Army Materiel Release Process and support software materiel release determinations. Will prepare change requests for the quality processes and implement the changes once approved by the Process Configuration Control Board (PCCB) or the Quality Assurance Division Chief, as appropriate. Will measure and analyze the effectiveness of the process. Minimum Requirements: Minimum of 3 years relevant work software development or software quality assurance experience. Must be able to obtain and maintain a DoD Secret security clearance. Demonstrated knowledge of software development life-cycle. Preferred Skills: Active DoD Secret Clearance. ISO 9001-2008 quality management system certifications. Required Education: A Bachelor's degree in a technical discipline (computer science, electrical engineering, computer engineering, etc.) is desired but NOT required. Years of experience may be substituted for education. Eligibility: Only US citizens are eligible for this position. Candidates must have the ability to obtain and maintain a DoD Secret Clearance and an Active Security Clearance is highly desired. The successful candidate will be subject to a government security investigation. About OASYS, INC.: Located in Huntsville, Alabama, OASYS, INC. is a technology services and products company dedicated to delivering the right solutions to our government and commercial clients. Our innovative solutions combined with today's technology and our subject matter expertise help to provide full lifecycle support for our client's needs. OASYS, INC. offers a robust benefit plan to include BC/BS of Alabama Heath & Dental, VSP Vision, Employee Stock Ownership Plan (ESOP), 401-K with Matching, Flexible Spending Account, Tuition Reimbursement, Holidays, Vacation, Short-term/Long-term Disability. www.oasys-incorporated.com EOE AA M/F/Vet/Disability Equal Employment Opportunity is the Law: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf Resumes may also be mailed to 650 Pratt Avenue NW, Suite C, Huntsville, AL 35801.Show more Report"
        ],
        "Hard Skills": [
            "Configuration Management",
            "Software Quality (SQA/SQC)",
            "Quality Management Systems",
            "ISO 9000 Series",
            "Security Clearance",
            "Secret Clearance",
            "Software Development Life Cycle",
            "Change Requests",
            "Computer Engineering",
            "Computer Science",
            "Electrical Engineering",
            "Software Development",
            "Quality Management"
        ],
        "Soft Skills": [
            "Quality Assurance",
            "Innovation"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-developer-hx5-llc-JV_KO0,18_KE19,26.htm?jl=1008864358489": {
        "Location": "Alabama",
        "Data": [
            "Software Developer Software Developer, III Marshall Space Flight Center (MSFC) Huntsville, AL  HX5 is an award-winning provider of engineering, research and development, and technical services to clients such as NASA and the Department of Defense. Founded in 2004, HX5 is a fast-growing veteran- and woman-owned company with locations nationwide.  HX5 is currently seeking a Software Developer to work with our database and commanding development team at Marshall Space Flight Center in Huntsville, Alabama. Essential Duties and Responsibilities:  Experience in programming languages like Angular, C#, C/C++, and JavaScript. Experience with NER Core Experience with Git (lab) Familiarity with Windows, Linux and web-based development environments Understanding of relational databases like Oracle and Microsoft SQL server Experience with large distributed systems Network programming Experience with unit testing Ability to capture/present technical information. Automated testing is a plus.  Education and Experience: Must have one of the following combinations of education and experience: Bachelor’s Degree in related field, or equivalent experience. Minimum of (eight) 8 years of work-related experience.  Position Type/Expected Hours of Work: This is a full-time position requiring 40 hours per week and offers a flexible work schedule Monday through Friday during core business hours. Other Position Requirements: Proof of U.S. Citizenship or US Permanent Residency is a requirement for this position. Must be able to complete a U.S. government background investigation. Must be able to travel, including air travel. HX5 offers a competitive salary and benefits package to include: Medical/Dental/Vision Insurance 401(k) plan with Company Match Paid Holidays Accrued Paid Time Off Parental Leave Life Insurance Tuition Reimbursement Identity Protection Medical and Dependent Care Flexible Spending Accounts Commuter/Transit Spending Accounts Group Legal Coverage Options Pet Insurance  HX5, LLC is an Equal Opportunity Employer that recruits and hires qualified candidates without regard to race, religion, sex, sexual orientation, gender identity, age, national origin, ancestry, citizenship, disability, or veteran status.  HX5, LLC is a Drug Free Workplace Employer.  ACCESSIBILITY NOTICE:  If you need a reasonable accommodation for any part of the employment process due to a physical or mental disability, please call (850) 362-6551.  CJShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Relational Databases",
            "Network Programming",
            "Git (Version Control System)",
            "Linux",
            "Technical Services",
            "Test Automation",
            "Microsoft SQL Servers",
            "Angular (Web Framework)",
            "Space Flight",
            "C# (Programming Language)",
            "Unit Testing",
            "JavaScript (Programming Language)",
            "Pet Insurance Claims",
            "Engineering Research",
            "Web Applications"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/full-stack-developer-interclypse-inc-JV_KO0,20_KE21,36.htm?jl=1008931710804": {
        "Location": "Alabama",
        "Data": [
            "Description:  Interclypse is seeking Full Stack Developers. The Interclypse difference is our emphasis on employee growth and development through continuous learning, mentorship, and empowerment. Interclypse employees grow in a positive cultivating work environment with endless career opportunities. Let Interclypse empower you by putting you in the driver's seat of your career. Currently, Interclypse is seeking motivated, career, and customer-oriented Full Stack Developers to join our team to provide exemplary support to our customers and to begin an exciting and rewarding career within Interclypse. The ideal candidate has demonstratable analytical, conceptual, and problem-solving abilities, and experience in building Web applications and Rest APIs for 3 years Requirements: Experience in building Web applications and Rest APIs for 3 years Experience in developing in Java/J2EE, Spring boot Experience in building web front-end applications using principals based on Mode-View-Controller (MVC), Block Element Modifier (BEM), Event Delegation, Publish/Subscribe, Server-side vs. client-side Experience with JavaScript frameworks and libraries (e.g., Vue, React, Polymer, Angular, Handlebars, and JQuery) Exposure in AWS - EC2, S3, Lambda, RDS, DynamoDB Knowledge of building Rest API operations (e.g., GET, PUT, POST, DELETE) and interaction from front-end to back-end APIs Experience in building capabilities to perform data transformation in web-based applications Familiarity with Node, NVM, and Tinker Pop Experience in creating custom interactive data visualizations through modifying and extending any D3-like or D3-based libraries (e.g., OpenGL) Desired Skills/Experience General understanding of Database Interactions with NoSQL DBs, JDBC connectors in cloud environments (e.g., AWS, Azure) Experience with Agile methodology and incremental product delivery process Strong written and verbal communication skills and experience in delivering presentations to stakeholders Education BS Computer Science, Computer Engineering, Computer Information Systems, OR Computer Systems Engineering Why You Might Like This Job: You’re tired of working for a massive organization. You want to work for an established company that values your stable career. You want to work with a team who loves their job and making cool stuff. You want to be part of a team focused on making a positive impact. You want to grow your skills in management or work toward becoming an expert. You want to have the option for career mentorship, both in technology and in business. You value a company with a strong culture of growth and support. Benefits: 248 hours / 31 days of Paid Personal Time Off (PTO) for vacation, holidays, and illnesses. Unlimited 401K match up to 8% of your salary up to the federal maximum Medical/Dental/Vision Insurance: Premium is 100% company paid (contact us for specific plan details) Health Savings Account (HSA): Interclypse contributes $1,500 for individuals and $3,000 for families Vision Insurance Dental Insurance with orthodontics coverage Life Insurance Accidental Death Insurance Disability: Short-term and long-term disability coverage Educational support: reimbursement up to the federal max of $5,250 Maternity/Paternity Leave: 40 hours Bereavement Leave: 24 hours Military Reserve Leave Jury Duty Leave Company apparel: $200 for company apparel each year Social events: Holiday Party, Spring Picnic, Fall Picnic, happy hours, and more Interclypse isn’t your typical company. We strive to have a positive & transformational impact on our community, our industry, and individuals. We keep this focus through our motto: \"Doing What is Right\". Apply today to see how you can join our winning team and start down the career path that’s right for you! EOE AA M/F/Vet/Disability: Interclypse is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status.Show more Report"
        ],
        "Hard Skills": [
            "Java Platform Enterprise Edition (J2EE)",
            "NoSQL",
            "Amazon Elastic Compute Cloud",
            "Server-Side",
            "Application Programming Interface (API)",
            "Spring Boot",
            "JavaScript Frameworks",
            "Microsoft Azure",
            "Amazon DynamoDB",
            "React.js (Javascript Library)",
            "RESTful API",
            "Orthodontics",
            "Computer Engineering",
            "Full Stack Development",
            "Model View Controller",
            "Agile Methodology",
            "Angular (Web Framework)",
            "Block Element Modifier",
            "Vue.js (Javascript Library)",
            "Node.js (Javascript Library)",
            "Java Database Connectivity",
            "Data Transformation",
            "Handlebars.js (Javascript Library)",
            "Amazon Web Services",
            "OpenGL",
            "JQuery",
            "Publish Subscribe",
            "Data Visualization",
            "Amazon S3",
            "Computer Science",
            "Front End (Software Engineering)",
            "Management Information Systems",
            "Spring Framework"
        ],
        "Soft Skills": [
            "Presentations",
            "Verbal Communication Skills",
            "Management",
            "Mentorship",
            "Problem Solving",
            "Operations"
        ]
    },
    "https://www.glassdoor.com/job-listing/frontend-software-engineer-saic-JV_KO0,26_KE27,31.htm?jl=1008908531358": {
        "Location": "Alabama",
        "Data": [
            "Job ID: 2313717 Location: HUNTSVILLE, AL, US Date Posted: 2023-10-03 Category: Software Subcategory: SW Engineer Schedule: Full-time Shift: Day Job Travel: Yes, 10 % of the Time Minimum Clearance Required: Interim Secret Clearance Level Must Be Able to Obtain: Secret Potential for Remote Work: No Description SAIC is seeking a Frontend Software Engineer to join our team in Huntsville, AL at Redstone Arsenal.  Program Overview  The Network, System Integration and Test Environment (NSITE) is a Government owned, managed, and developed software suite. NSITE is used by the Missile Defense Agency (MDA), Joint Services, and numerous labs in support of continued testing of systems employed for defense of the United States and our Allies. The NSITE software provides data collection, situational awareness, and analysis capabilities to a wide range of users who benefit from NSITE’s ability to act as an independent third-party truth teller. The NSITE team has in-depth experience in Tactical Data Links (TDL), Ballistic Missile Defense System (BMDS) Test, Enterprise Information Technology, Software and Systems Engineering and Information Assurance. Duties and Responsibilities  Responsible for designing, developing, deploying, and maintaining the NSITE software application. Work on a small agile development team where success is defined by the ability to understand your path forward, effectively communicate that path, and complete the task inherent to that path in a timely matter. Research advancements in computer science and related fields to help steer the product toward long term success. Communicate with leadership and the customer to ensure a common understanding of requirements. Document your work for the benefit of your teammates, the user, leadership, and posterity. Identify and solve challenging problems by writing performant, clean, and practical code.  Qualifications Education Requirements:  Bachelor’s degree in Software Engineering, Computer Science, Computer Engineering, or equivalent 5 years experience working with Software Design and Development. Six (6) years' experience may be accepted in lieu of degree (per contract vehicle).  Clearance Requirements:  Must possess an active Secret security clearance or have the ability to obtain one; US Citizenship required.  Required Qualifications:  Proficient in C#, and in Microsoft .NET Proficient in WPF with MVVM patterns Ability to build an intuitive User Interface (UI) Knowledge of modern software engineering practices, including Agile methodologies Ability to analyze a requirement, generate a design, and produce efficient, robust, and testable software Ability to understand, and evaluate C# code and develop corresponding unit test(s) Mastery of computer science fundamentals, independent of a specific language  Preferred Qualifications:  Familiarity with WPF based control sets such as DevExpress, Telerik, or Infragistics Past experience of building applications with .NET using ASP.NET or Windows Forms. Familiarity with Extensible Application Markup Language (XAML). Understanding of and experience with secure programming techniques. Knowledge of tactical and simulation data links (specifically Link 16, JREAP, DIS, VMF, CMF and XML). Experience working with Microsoft Visual Studio Experience with using Git version control, JIRA, and Gitlab as software management tools. Experience with InstallAware.  Currently have an Information Assurance Technical certification (CompTia A+, Net+, or Sec+) or the ability to obtain one Covid Policy: SAIC does not require COVID-19 vaccinations or boosters. Customer site vaccination requirements must be followed when work is performed at a customer site.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Extensible Application Markup Language",
            "Information Assurance",
            "Software Suite",
            ".NET Framework",
            "Extensible Markup Language (XML)",
            "Agile Methodology",
            "Secret Clearance",
            "Link 16",
            "Git (Version Control System)",
            "Secure Programming",
            "CompTIA A+",
            "Microsoft Visual Studio",
            "ASP.NET",
            "Unit Testing",
            "JIRA",
            "Infragistics",
            "Software Engineering",
            "DevExpress",
            "Tactical Data Link",
            "Telerik",
            "Front End Design",
            "C# (Programming Language)",
            "Model View ViewModel",
            "Testability",
            "CompTIA Security+",
            "CompTIA Network+",
            "Software Project Management",
            "Windows Forms",
            "Computer Engineering",
            "Windows Presentation Foundation",
            "Systems Engineering",
            "Computer Science",
            "Gitlab",
            "Version Control",
            "User Interface (UI)",
            "Systems Integration",
            "Data Collection"
        ],
        "Soft Skills": [
            "Information Technology",
            "Research",
            "Writing",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/sr-software-engineer-jacobs-JV_KO0,20_KE21,27.htm?jl=1008896683760": {
        "Location": "Alabama",
        "Data": [
            "Challenging Today. Reinventing Tomorrow.  We're invested in you and your success. Everything we do is more than just a project. It's our challenge as human beings, too. That's why we bring a thoughtful and collaborative approach to every one of our partnerships.  At Jacobs, we challenge the status quo and redefine how to solve the world's greatest challenges, transforming big ideas into intelligent solutions for a more connected, sustainable world.  Design your career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow   Your Impact: The Jacobs Space Exploration Group (JSEG) a primary contractor for NASA since 1989 is comprised of 10 companies and is located at Marshall Space Flight Center in Huntsville, AL (ranked #1 in Best Places to Live by U.S. News). Create Your Career: Grow With Us Your growth matters to us—that’s why we offer a variety of ways for you to develop your career. With professional and leadership development opportunities like Team Lead Academy, education reimbursement, mentoring, and company sponsored networking events, you can take control of your own career path on your own terms with a company that believes in you. A Place Where You Belong At Jacobs Space Exploration Group, people are at the heart of our business. We reflect a diversity of cultures, backgrounds, and experiences. We expect our people, clients, and partners to treat one another with dignity and respect. This means promoting inclusion, celebrating diversity, and appreciating the differences we all bring to our workplace. Support Your Well-Being Our comprehensive benefits package includes wellness programs, 11 paid holidays, parental leave, paid time off, employee perks and much more. With these benefits, plus the option for flexible schedules and possible remote a few days a week (depending on customer requirements) we’ll support you as you pursue a balanced, fulfilling life—at work and at home. Responsibilities: The Jacobs Space Exploration Group (JSEG) is seeking an energetic individual to support the software design of the Space Launch System Core Stage Flight Control Computers at Marshall Space Flight Center. The ideal candidate will be a part of the Science and Technology team working with C/C++ programming language on the SLS Project supporting the Artemis launch vehicle. The candidate should have excellent verbal and written communication skills, as they will be responsible for collaborating with cross-functional teams and documenting software requirements and design. If you have a passion for space, NASA, and cutting-edge technology, come join our team! Here’s What You’ll Need: Qualifications: A bachelor’s degree or higher in computer science, software engineering, electrical engineering or related field is required. Degree from an ABET-accredited university is preferred. BS degree with over 20 years of experience working in software development environments is highly desired. Typically, educational requirements are the equivalent of a Ph.D., with a minimum 14 years of experience, Masters with at least 18 years of experience, or BS with at least 20 years of experience. Candidate must possess and maintain a valid driver's license, automobile liability insurance and successfully complete a company defensive driving training class. The candidate should be proactive, detail-oriented, and able to work independently and as part of a team in a fast-paced, dynamic environment. Technical experience with and proficient in: Designing, developing, and testing real-time embedded spaceflight software and testing software in compliance of organizational/project coding standards Strong software development skills in various languages (including C++, C, python). Object Oriented Design and Implementation VxWorks and other real-time operating systems Atlassian tools suite (i.e. Jira, etc.). Configuration Management Tools (i.e. GitHub). Continuous Integration Practices. Agile methodologies and processes. Software/Hardware integration, debugging and troubleshooting. MIL-STD 1553 communication protocol interface as well as other various communication protocol interfaces such as ethernet, RS422, etc. UML Modeling. Working with a software development team in an Agile Development Environment. Ability to work proactively, independently, and within a diverse team. Ability to communicate professionally with customers, stakeholders, and cross-organizational team members; possess good communication skills. Desirable experience would include: Executing the ARTEMIS/MAESTRO simulation environment Development of fault scripts Integrating new ARTEMIS/MAESTRO versions with FSW including debugging/troubleshooting The Jacobs Space Exploration Group (JSEG) offers a partnership in which you can grow personally and professionally within a framework of strong leadership, competitive compensation, and rewarding career paths. Come join our team on the Engineering Services and Science Capability Augmentation (ESSCA) contract whose work is destined to have a long-range effect on future generations! For more information on why Huntsville is known as “one of the smartest cities in the nation”, check out these websites: https://hsvchamber.org/ www.Huntsville.org/ https://www.movoto.com/guide/huntsville-al/moving-to-huntsville/ https://realestate.usnews.com/places/alabama/huntsville https://iveyhsv.com/real-estate-blog/13-reasons-why-you-should-move-to-huntsville/ Essential Functions Work Environment: Office environment. Requires ability to provide clear, concise, accurate and timely communication, both verbally and in writing (100%). Requires ability to interact professionally with co-workers, management, and client (100%). Requires travel in the domestic USA (<10%). Physical Requirements: Requires sitting for extended periods of time in meetings with peers, management, and with our client at NASA facilities to discuss technical issues (10%). Also, requires sitting for extended periods of time at a desk to write reports and perform engineering tasks (80%). Requires ability to use stairs or elevators for access between floors and multiple buildings at NASA and Jacobs facilities (10%). Equipment and Machines: Requires ability to operate a personal computer, a telephone, fax machine, copier, calculator, and other general office equipment (100%). Attendance: Normal workday 7:30 – 4:30, Monday thru Friday. Minimal overtime may be required (10%) to meet schedule milestones and to support technical demands of the job. Regular attendance is a necessity, and adequate arrangements for delegating duties during absences are required. Other Essential Functions: The ability to work independently with minimal supervision, and to make rational decisions, and to exercise good judgment is essential (100%). Grooming and dress must be appropriate for the position and must not impose a safety risk/hazard to the employee or others. Proof of U.S. Citizenship is required. #ESSCAShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Debugging",
            "Software Design",
            "Office Equipment",
            "Github",
            "Agile Methodology",
            "Space Flight",
            "RS-422",
            "Python (Programming Language)",
            "Valid Driver's License",
            "Continuous Integration",
            "Object-Oriented Design",
            "Communications Protocols",
            "JIRA",
            "Real-Time Operating Systems",
            "Launch Vehicle Systems",
            "Software Engineering",
            "Military Standards And Specifications",
            "Unified Modeling Language",
            "Space Exploration",
            "Configuration Management",
            "VxWorks",
            "Computer Science",
            "Software Development",
            "Electrical Engineering",
            "Milestones (Project Management)"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Leadership Development",
            "Communications",
            "Calculators",
            "Professionalism",
            "Teamwork",
            "Energetic",
            "Writing",
            "Report Writing",
            "Mentorship",
            "Management",
            "Leadership",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineering-co-op-spring-summer-2024-on-site-collins-aerospace-JV_KO0,53_KE54,71.htm?jl=1008854293583": {
        "Location": "Alabama",
        "Data": [
            "Date Posted: 2023-07-17 Country: United States of America Location: HAL31: Huntsville, AL 420 Jan Davis Drive , Huntsville, AL, 35806-4545 USA Position Role Type: Onsite Looking for an exciting opportunity to learn more about the Aerospace industry while finishing your degree? Consider joining us here at Collins Aerospace, where we’re working side-by-side with customers to unleash the exciting possibilities we see before us. With a comprehensive portfolio, extensive capabilities and broad expertise, we’re crafting intelligent solutions to meet the demands of a rapidly evolving global market – all representing the best in innovation and technology for the industries we serve across commercial, business, space, and military & defense aviation. Partner with our dedicated people leaders to experience meaningful work aligned with your university curriculum, powerful exposure to leadership at all levels, tailored career growth, and more! At Collins, we’re redefining aerospace and we’re just getting started. Come soar with us. Business Overview: Collins Aerospace, a Raytheon Technologies company, is a leader in technologically advanced and intelligent solutions for the global aerospace and defense industry. Collins Aerospace has the capabilities, comprehensive portfolio and expertise to solve customers’ toughest challenges and to meet the demands of a rapidly evolving global market. Our Avionics team advances flight deck solutions, airborne communications, vision systems, sensors and fire protection for commercial and military customers around the world. That means we’re helping people reach their destination safely and keeping pilots, passengers, flight crews, airlines, airports and military personnel connected and informed. And we’re providing industry-leading fire protection and safety systems that our customers can count on when it matters most. Are you ready to learn from the most knowledgeable experts in the industry, develop the technologies of tomorrow and reach new heights in your career? Join our Avionics team today. Position Overview: The Tactical, Communications, and Maintenance Applications (TCMA) team based in Huntsville, Alabama has new opportunities for individuals who want to grow their technical expertise on complex programs and be a part of an innovative and fast-paced avionics business area. Teams are composed of cross-functional engineers working in an AGILE environment (approximately 6-10 people) focused on the design and development of software-only products. Our team focuses on creating avionics solutions for both fixed-wing and rotary-wing aircraft, including the integration of various radios and surveillance equipment for domestic and international military customers. We are looking for a Co-op, disciplined in Software Engineering to join our TCMA team in Huntsville, Alabama. The successful candidate will be responsible for designing and implementing Agile software engineering processes and activities. Primary Responsibilities: Design, implement, and evaluate software in Ada, Python within the Agile framework Conduct multidisciplinary research and collaborate with other engineers in the planning, design, development of military technology Work closely with cross-functional research teams to evaluate the effectiveness of early software prototypes Independently perform multiple tasks given support from a mentor Implement requirements, detailed design, implementing software, integration, and verification in accordance with software development processes. Accomplish tasks based on program schedule, collaborate with teammates in order to make the best decisions Enjoy learning new technologies, be self-motivated and contribute to a positive work environment. Basic Qualifications: Requires a High School Diploma or equivalent and student must be pursuing a Bachelor's or advanced degree in an applicable discipline. US Citizenship is required. Preferred Qualifications Familiarity with Agile software development cycle Familiarity with design and development using languages such as C, C++, Java, Ada and Python. Ability to successfully contribute in collaborative, cross-domain development environments Problem-solving and decision-making skills Self-motivated, enthusiastic, works well with othersPlease consider the following role type definitions as you apply for this role. Onsite: Employees who are working in Onsite roles will work primarily onsite. This includes all production and maintenance employees, as they are essential to the development of our products. Hybrid: Employees who are working in Hybrid roles will work regularly both onsite and offsite. Ratio of time working onsite will be determined in partnership with your leader. Remote: Employees who are working in Remote roles will work primarily offsite (from home). An employee may be expected to travel to the site location as needed. Regardless of your role type, collaboration and innovation are critical to our business and all employees will have access to digital tools so they can work with colleagues around the world – and access to Collins sites when their work requires in-person meetings. Must be a commutable distance to Huntsville, AL to work an onsite schedule. Diversity drives innovation; inclusion drives success. We believe a multitude of approaches and ideas enable us to deliver the best results for our workforce, workplace, and customers. We are committed to fostering a culture where all employees can share their passions and ideas so we can tackle the toughest challenges in our industry and pave new paths to limitless possibility. Nothing matters more to Collins Aerospace than our strong ethical and safety commitments. As such, all U.S. positions require a background check, which may include a drug screen.  Background check and drug screen required (every external new hire in the U.S.)  Drug Screen only performed on re-hires who have been gone for more than 1 year At Collins, the paths we pave together lead to limitless possibility. And the bonds we form – with our customers and with each other - propel us all higher, again and again. Apply now and be part of the team that’s redefining aerospace, every day. RTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class. Privacy Policy and Terms: Click on this link to read the Policy and TermsShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Multidisciplinary Research",
            "Agile Methodology",
            "Agile Software Development",
            "Aerospace Industry",
            "Engineering Design Process",
            "Python (Programming Language)",
            "Java (Programming Language)",
            "Sensors",
            "Software Engineering",
            "International Finance",
            "Fire Protection",
            "Tactical Communications",
            "Software Development",
            "Prototyping",
            "Systems Integration"
        ],
        "Soft Skills": [
            "Enthusiasm",
            "Planning",
            "Ethical Standards And Conduct",
            "Self-Motivation",
            "Innovation",
            "Leadership",
            "Decision Making",
            "Communications",
            "Problem Solving",
            "Research"
        ]
    },
    "https://www.glassdoor.com/job-listing/undergraduate-student-assistant-computer-science-and-software-engineering-auburn-university-JV_KO0,73_KE74,91.htm?jl=1008597582268": {
        "Location": "Alabama",
        "Data": [
            "Position Details Position Information Requisition Number Stu02347P  Home Org Name Computer Science & Software Engr  Division Name Samuel Ginn Col of Engineering  Position Title Undergraduate Student Assistant - Computer Science & Software Engineering  Working Title (if different from Position Title)  Job Summary We are looking for an undergraduate student assistant who will assist faculty and staff under the office supervisor’s and department chair’s direction.  Essential Functions Manage phone calls and walk-ins Greet, assist, and direct visitors and guests to the correct locations Deliver mail or run errands around campus Other duties as assigned   Minimum Qualifications Currently enrolled as an Auburn University undergraduate student  Expectations: Excellent phone etiquette Friendly and approachable Great customer service skills   Preferred Qualifications Someone working towards a bachelor in Computer Science & Software engineering or other related curricula.  Pay Rate $10.00/hour  Work Hours 20  City position is located in: Auburn  State position is located: Alabama  Posting Detail Information Posting Date 04/19/2023  Closing Date  EEO Statement Auburn University is committed to an inclusive and diverse campus environment. Women, underrepresented groups, individuals with disabilities and veterans are encouraged to apply.  AUBURN UNIVERSITY IS AN AFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER. It is our policy to provide equal employment opportunities for all individuals without regard to race, sex, religion, color, national origin, age, disability, protected veteran status, genetic information, sexual orientation, gender identity, or any other classification protected by applicable law.Show more Report"
        ],
        "Hard Skills": [
            "Software Engineering",
            "Computer Science",
            "Curriculum Development"
        ],
        "Soft Skills": [
            "Telephone Skills",
            "Customer Service"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-iii-children-s-of-alabama-JV_KO0,21_KE22,43.htm?jl=1007315089844": {
        "Location": "Alabama",
        "Data": [
            "Job Summary The Software Engineer III must have knowledge in all stages of software development. This individual will be part of the development team and create and maintain new software programs. This role will work closely with both technical and non-technical staff in defining business and technical requirements to develop new functions or redesign/consolidate existing processes. The job entails communicating effectively with project managers and other developers about requirements and proposed alterations to design. They will be responsible for front end, back end development and unit testing using a variety of languages, tools, and database technologies. They are flexible and willing to accept a change in priorities as necessary. As a level II this individual will be an expert in their craft, being responsible for high level design and analysis. Mentoring less experienced team members and ensuring best practices are part of their job duties. Experience, combined with excellent problem solving and troubleshooting skills, enables them to solve difficult issues. This individual has proven abilities to take initiative and be innovative. Being a highly effective communicator and collaborator is paramount to this role. The individual will work with many different people of varying technical backgrounds. This person is a leader on the team, can communicate effectively, stay on task, be a positive influence, and lead a project work. Education High school diploma or equivalent required. Bachelor’s degree in Information Technology or related field preferred. Experience Bachelor’s degree in Information Technology or related field - OR - 7+ years of equivalent technical experience required Licensures, Certifications, and/or Registries  Location: Children's of Alabama · Information Technology Schedule: Full-time, Day shift, 40Show more Report"
        ],
        "Hard Skills": [
            "Project Management",
            "Unit Testing",
            "Software Engineering",
            "Back End (Software Engineering)",
            "Software Development",
            "Front End (Software Engineering)"
        ],
        "Soft Skills": [
            "Proactivity",
            "Influencing Skills",
            "Communications",
            "Mentorship",
            "Information Technology",
            "Innovation",
            "Problem Solving",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/bm-software-engineer-ierus-technologies-inc-JV_KO0,20_KE21,43.htm?jl=1008898147754": {
        "Location": "Alabama",
        "Data": [
            "IERUS specializes in electromagnetic spectrum technologies and design for RF, IR, and optical applications. IERUS also supports customers with a diverse set of competencies including software development, air and missile defense, and systems engineering. IERUS develops value for our defense and commercial customers through accelerations of the technology life cycle: identifying, creating, transitioning, and producing technologies with integrity of purpose and product. IERUS is looking for bright, talented, motivated, and dedicated employees in the engineering field, and offers competitive compensation and benefits package. To learn more, please visit www.ierustech.com Description: This is an opportunity to join the IERUS team as a Software Engineer supporting a large Missile Defense Agency program. The ideal candidate will have a minimum of 3-5 years’ experience. The candidate will be key contributor to the design and development of Java-based applications. Candidate will help generate software design artifacts, implement software changes, support design and code reviews, support software testing and resolution of issues arising from software testing. Candidate may also be involved in the design and development of MATLAB based algorithms within Track Services. Required Qualifications:  B.S., M.S., or Ph.D. in an engineering discipline; Computer Science, Mathematics, Physics, or Engineering and 3+ years experience with advanced degree or 5+ years experience with bachelors or equivalent. Experience in full life cycle software development of Java-based applications and systems. Hands-on development experience for Java-based applications in a UNIX/Linux platform environment. Experience developing software in a structured, process-based integrated team environment. Proficient in mathematical algorithm development or translating mathematical algorithm design into software. Comfortable with mathematical algorithm development or translating mathematical algorithm design into software. Use of common software development and management tools such as Git and Eclipse Understanding of standard system engineering design artifacts such as System requirements, use cases and SysML diagrams  Desired Qualifications:  Command and control system application development Experience with Software Integration testing Strong problem-solving skills, including the ability to review performance, identify root cause and recommend a solution.  Location: Huntsville, AL IERUS Technologies is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age, or any other federally protected class. IERUS Technologies participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Code Review",
            "Application Development",
            "Systems Engineering",
            "Software Testing",
            "Unix",
            "Algorithm Design",
            "Git (Version Control System)",
            "Linux",
            "Algorithms",
            "Eclipse (Software)",
            "Technology Life Cycle",
            "Control Systems",
            "Java (Programming Language)",
            "MATLAB",
            "Software Development",
            "Software Engineering",
            "Computer Science",
            "Systems Integration",
            "Physics",
            "System Requirements",
            "Systems Modeling Language"
        ],
        "Soft Skills": [
            "Mathematics",
            "Problem Solving",
            "Management"
        ]
    },
    "https://www.glassdoor.com/job-listing/user-interface-software-engineer-polaris-sensor-technologies-JV_KO0,32_KE33,60.htm?jl=1008093227906": {
        "Location": "Alabama",
        "Data": [
            "User Interface Software Engineer Polaris Sensor Technologies is seeking a Software Engineer to play an integral role in the evolution of our software products through development of modern user interfaces. The new UI framework is intended to support a variety of optical sensors that stream video and produce numerical data used in analytical testing scenarios. The engineer will work to implement new user interface frameworks using MVVM methodology to display streaming video from optical sensors, provide sensor configuration interface components, and create innovative data visualization controls for processed numerical data.  This position is full-time (40 hours per week) in Huntsville, Alabama. Salary is commensurate with applicant’s qualifications and experience. Polaris offers a competitive benefits package including health insurance and 401k. Candidates must be U.S. citizens and must be able to obtain a security clearance upon demonstrated need. Responsibilities Collaborate with software engineering counterparts Develop UI framework and interface guidelines for sensor software developers Develop UI components to provide intuitive representation of numerical data for analysis Maintain and enhance the UI framework and components to support future projects Troubleshoot and resolve sensor software/user interface integration issues Qualifications Required Strong communication skills, both oral and written Experience developing Windows applications using WPF Experience developing using MVVM UI frameworks such as Avalonia Windows and Linux programming in C++ or C# Preferred Video display Cross-platform developmentShow more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "Analytical Testing",
            "Security Clearance",
            "Linux",
            "Display Devices",
            "Sensors",
            "Software Engineering",
            "C# (Programming Language)",
            "Model View ViewModel",
            "UI Components",
            "Windows Presentation Foundation",
            "Data Visualization",
            "User Interface (UI)",
            "Software Development"
        ],
        "Soft Skills": [
            "Innovation",
            "Microsoft Windows",
            "Communications",
            "Troubleshooting (Problem Solving)"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineers-sahbi-systems-JV_KO0,18_KE19,32.htm?jl=1008810053011": {
        "Location": "Alabama",
        "Data": [
            "SAHBI Systems Inc. has positions available for Software Engineers in Alabama, Georgia and other parts of the Nation.  Duties: Design, develop, create, modify, customize, test, and validate software applications using C#, ASP.NET, VB.NET, ADO.NET, XML / XSL, JavaScript, Visual Basic, VB Script, Oracle, and SQL Server.   Requisite Qualifications: Master’s degree or equivalent in Computer Science or Computer Applications, with at least two (2) years of experience in the field. Relocation may be required.   Mail Resume to : careers@sahbisystems.comShow more Report"
        ],
        "Hard Skills": [
            "VBScript (Visual Basic Scripting Edition)",
            "Visual Basic .NET (Programming Language)",
            "Extensible Markup Language (XML)",
            "Software Engineering",
            "Extensible Stylesheet Language (XSL)",
            "ASP.NET",
            "ADO.NET (Programming Language)",
            "C# (Programming Language)",
            "SQL (Programming Language)",
            "JavaScript (Programming Language)",
            "Computer Science",
            "Visual Basic (Programming Language)"
        ],
        "Soft Skills": []
    },
    "https://www.glassdoor.com/job-listing/software-engineer-cimarron-software-JV_KO0,17_KE18,35.htm?jl=1008909532058": {
        "Location": "Alabama",
        "Data": [
            "Job Description:Cimarron is seeking a Software Engineer (Modeling & Simulation) to support the Missile Defense Agency's Ground-based Midcourse Defense (GMD) System Integration, Test and Readiness (SITR) contract in Huntsville, AL. SITR is responsible for the overall GMD Element engineering and integration, including physical and logical integration of the GMD Element and Components with the Missile Defense System. Cimarron's team members will be instrumental in ensuring the GMD Element of the Missile Defense System continues to provide safe, reliable, and responsive capability to defend the U.S. homeland.In this role, you serve as a Software Engineer using Agile software development methods to assist in planning and executing GMD Element Modeling and Simulation development and integration for the upgrades to the GMD Element. We welcome you to be a part of this challenging and important program!This is an onsite position.Key Duties:Lead the development and integration of the GMD Weapon Systems M&S products.Lead activities to develop and integrate M&S products based on flow diagrams, Software Design documents, Interface Control documents, and dynamic M&S outputs.Lead activities to review system designs through Model Based Systems Engineering tools, such as Cameo.Work effectively in a rapid-paced team environment.Required Skills, Experience, and Education:Due to facility security requirements, only U.S. citizens are eligible for consideration at this time.Active or Interim Secret clearance.5 or more years of experience.Experience with or knowledge of one or more of the following: C, C++, Java, Python.Ability to understand complex system designs and algorithms.Ability to derive a system design/functionality based on high-level requirements.Design flow diagram of system functionality.Experience working on an Agile-based development team.Bachelor's degree in Engineering, Computer Science, Mathematics, Physics, or Chemistry and typically 5 or more years of related work experience, or an equivalent combination of technical education and experience.Degree obtained from an accredited course of study.Business Profile:Cimarron is a global solutions company with a strategic partnering approach to satisfying customer-driven requirements. We ensure customer success with a modern approach and experienced leadership. Driven by an entrepreneurial spirit, Cimarron is fueled by highly skilled employees, developing new innovative technologies, and delivering superior products and services. We believe in recognizing employees' worth by offering competitive salaries and benefits, including health, dental, and vision insurance, 401(k) contributions, educational reimbursement, and much more. From company communication through Company-wide information meetings led by our President and CEO, to an Awards program designed to recognize our amazing employees and their accomplishments, you will not only feel like you are a part of a team, you will be a valued member of the Cimarron family. Cimarron is an Equal Opportunity/Affirmative Action Employer, M/F/Disability/Veteran.Job Type: Full-timePay: $105,000.00 - $165,000.00 per yearBenefits:401(k)401(k) matchingHealth insuranceHealth savings accountPaid time offVision insuranceSchedule:8 hour shiftWork Location: In personShow more Report"
        ],
        "Hard Skills": [
            "C (Programming Language)",
            "C++ (Programming Language)",
            "Model Based Systems Engineering",
            "Software Design Documents",
            "Agile Software Development",
            "Security Requirements Analysis",
            "Java (Programming Language)",
            "System Integration Testing",
            "Customer Success Management",
            "Systems Design",
            "Software Engineering",
            "Computer Science",
            "Agile Methodology",
            "Chemistry",
            "Physics"
        ],
        "Soft Skills": [
            "Planning",
            "Communications",
            "Mathematics",
            "Innovation",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-test-and-quality-assurance-qa-engineer-nou-systems-inc-JV_KO0,47_KE48,63.htm?jl=1008908360429": {
        "Location": "Alabama",
        "Data": [
            "nou Systems, Inc. (nSI) is here to solve diverse and challenging technical problems in an enjoyable, stimulating environment, while providing unsurpassed value to our customers. We are pleased to announce an opening for a Software Test Engineer who will join our JSTC2 Software Program in Huntsville, AL (Redstone Arsenal) and become part of our rapidly growing technology company operating in missile defense, cybersecurity, test range modernization, biotechnology, and space control marketspaces. Here’s what you’ll be doing: You’ll be working with the Integration & Test, Development and Cybersecurity Teams for a Government Off the Shelf (GOTS) Software Product that is currently in development. Duties in this position will include working side by side with a highly qualified Development staff, working with the Government customer on their Integration support, and assisting the Cybersecurity Team in finding and documenting vulnerabilities found in testing, and developing automated tests to provide continual support to product development. Here’s what you’ll need: You must have a Bachelor’s degree at minimum, in a relevant field such as Software Development, System Engineering, or similar. Also, we’re looking for someone with 5+ years full-time professional experience in areas such as Software Testing, Software Development, Software Engineering, or similar. Finally, you must possess or have the ability to obtain an active Secret Clearance. You also must have:The ability to document test results for product acceptance and requirement traceabilityFamiliarity with executing software tests within a development environmentExperience with automated test frameworks, and designing automated tests and requirementsExposure to multiple types of testing (Integration, Compatibility, Stress, Regression, etc)Proficiency with using source control tools (Git, TFS, etc)Issue tracking application experience (Gitlab, Jira, etc)Ability to communicate findings clearly to both the development team and customer baseA drive to learn and grow on a great team in an amazing company Lacking any one of these disqualifies you from this job. Other qualifications we hope you bring to the table:Software Development ExpertiseModeling and Simulation QA/testingExperience in software QA/testing for a DoD programExperience with Fortify scanningExperience with GitLab Ultimate scanning/security toolsUnit Testing experienceFamiliarity with integrating with CI/CD pipelinesThe ability to share knowledge via mentorship and teachingTechnical Writing Experience (SOPs, RMF Documentation, Architectural Diagrams, etc.)Current Secret or higher clearance Remote work option? This position may include a hybrid aspect to work location. Most work will be done at Government site, but occasional remote work may be approved. Who is nou (pronounced ‘new’) Systems? nou Systems, Inc. (or nSI for short) is a rapidly growing technology company that cares about its people located all over the globe. Our people are passionate about missile defense, cybersecurity, test range modernization, and all-things space and space-market related. We offer significant advancement and personal career development opportunities within our dynamic high-tech company.  Although we are a rapidly growing company, winning the Inc. 5000 List as one of America’s fastest-growing private companies from 2017–2021, our culture is firmly established in treating our employees like family. See some words our employees use to describe our culture with the attached Culture Cloud. Benefits of working at nSI nou Systems, Inc. offers a comprehensive, total rewards package that includes competitive compensation and diverse benefits that reflect our company culture of service, excellence, and a supportive work environment. Other specific benefits include: Competitive Wages* Medical, Rx, Dental & Vision Insurance Medical plan with Health Savings Account eligibility Generous company-funded Basic Life Insurance Company-funded Short-Term & Long-Term Disability Optional Accident and Critical Illness Insurance Personal Time Off, Annual Leave, and Paid Federal Holidays 401(k) Retirement Plan Employee Stock Ownership Plan (ESOP) Tuition Reimbursement for ongoing training, continuing education, or advanced degree programs Personal Development, Learning Opportunities, & Lunch-n-Learns Opportunities for Advancement Skills Development & Certifications Employee Referral Bonus Program Corporate Sponsored Events & Community Outreach Remote-work friendly If you work from the corporate office – Fully stocked breakrooms!!!Final compensation for this position is determined by a variety of factors, such as a candidate’s relevant work experience, skills, certifications, and geographic location. nSI is an Equal Opportunity Employer Employment opportunities at nSI are based upon a candidate’s qualifications and capabilities to perform the essential functions of a particular job and are free from discrimination based on race, color, religion, national origin, sex, sexual orientation, gender identity, age, disability, protected veteran status, genetic information, or any other characteristic protected by law. For our complete EEO/AA and Pay Transparency statement, please visit www.nou-systems.com/workingatnou. U.S. citizenship is required for most positions.Show more Report"
        ],
        "Hard Skills": [
            "Software Quality (SQA/SQC)",
            "Systems Engineering",
            "Software Testing",
            "Git (Version Control System)",
            "Secret Clearance",
            "Government Off-The-Shelf",
            "JIRA",
            "Community Outreach",
            "Software Engineering",
            "Cyber Security",
            "Team Foundation Server",
            "Version Control",
            "Test Automation",
            "CI/CD",
            "Gitlab",
            "Software Development",
            "Biotechnology",
            "Vulnerability"
        ],
        "Soft Skills": [
            "Communications",
            "Mentorship"
        ]
    },
    "https://www.glassdoor.com/job-listing/junior-software-test-engineer-penta-research-JV_KO0,29_KE30,44.htm?jl=1008890082529": {
        "Location": "Alabama",
        "Data": [
            "Junior Software Test Engineer Security Clearance Secret clearance required Work Environment Hybrid – Huntsville, AL Job description Seeking a junior-level software test engineer to join a team of software, test, and systems engineers who develop, test, and maintain the Joint Network Design Aid (JNDA) software. JNDA is a Windows-based desktop application used to design Link-16 networks and generate output files. Candidate would work on an Agile Scrum team in a largely self-directed but collaborative environment. Responsibilities Write automated test scripts in SmartBear TestComplete Develop test criteria and test steps to ensure software is functioning properly Coordinate with developers to report bugs and provide feedback Execute regression tests regularly and report issues promptly Investigate test failures and document clear steps to reproduce them Participate in Scrum events: sprint planning, sprint review/demonstration, daily tag ups Required qualifications Programming experience with language(s) such as Python, Java, C++ Ability to think critically and logically Excellent oral and written communication skills Detail-oriented and organized Comfortable with a fast-paced, collaborative work environment Desired qualifications Bachelor’s degree in computer science, software engineering, computer engineering, or similar Software testing experience Experience with automated testing and/or continuous integration Experience with Agile Scrum and/or DevSecOps Experience with Subversion and/or Git Link-16 knowledge Travel requirement Position location: Huntsville, AL. Occasional travel may be required for this position. Keyword Search Software Test Engineer, Agile, Windows, Software Development, Python, Automated TestingShow more Report"
        ],
        "Hard Skills": [
            "C++ (Programming Language)",
            "DevSecOps",
            "Systems Engineering",
            "Security Clearance",
            "Network Planning And Design",
            "Software Testing",
            "Link 16",
            "Git (Version Control System)",
            "Secret Clearance",
            "Scrum (Software Development)",
            "Test Automation",
            "Python (Programming Language)",
            "Continuous Integration",
            "Apache Subversion",
            "Testcomplete",
            "Regression Testing",
            "Java (Programming Language)",
            "Software Engineering",
            "Sprint Planning",
            "Computer Engineering",
            "Windows Software Development",
            "Computer Science",
            "Agile Methodology",
            "Automation"
        ],
        "Soft Skills": [
            "Detail Oriented",
            "Critical Thinking",
            "Writing",
            "Self-Discipline"
        ]
    },
    "https://www.glassdoor.com/job-listing/senior-software-engineer-pradco-outdoor-brands-JV_KO0,24_KE25,46.htm?jl=1008931536857": {
        "Location": "Alabama",
        "Data": [
            "Headquartered in Birmingham, Alabama, Moultrie Mobile (www.moultriemobile.com) is a rapidly scaling software and cellular camera platform used by hunters, property owners, jobsite managers, and others for real-time remote monitoring. We take pride in developing deep user understanding, obsess about the details, and go the extra mile to show our users we love them. Moultrie is first and foremost customer driven – hardware, software, marketing, and customer success teams collaborate to deliver a quality user experience. Moultrie Mobile is a division of PRADCO Outdoor Brands, a leader in producing game calls, scents, attractants, game feeders, game cameras, tree stands and fishing lures. PRADCO has been in business since 1894, and we offer the stability and benefits of a firmly established corporation while operating as a growth-focused team with the entrepreneurial spirit of a startup. We are guided by the following principles: We put the customer first.; We are curious and seek to learn.; We take ownership.; We are grounded.; We win as a team.; We are builders working with relentless energy, urgency, passion, and drive.; We innovate, experiment, and take risks. Moultrie Mobile is looking to add a Senior Software Engineer to the team. This position will be focused on implementing new features and creating solutions for the Moultrie Mobile platform, as well as other hunting division software projects. As a team member, you will be accountable for implementing improvements based on best practices in a manner that is maintainable, scalable, testable, and works within the continuous delivery pipeline. You will also be working cross-functionally with Product, Customer Service, Marketing, and other engineering departments to ensure the completion of visions and timelines set by the business. He or she will grow the business by thoroughly understanding the marketplace and competition, and by developing products that address consumer needs and staying abreast of the latest software trends. Responsibilities: Working in a cross-functional team developing mobile and back-end features Deliver high quality multi-platform projects using Microsoft development technologies Demonstrate highly effective approaches to object-oriented software development based on industry best practices. Design, build, test and maintain scalable, secure, and testable code Mentor new and junior team members Monitor crash reports, identify solutions and implement fixes Provide estimates and participate in agile development Writing and maintaining unit tests Work with the dev team, product owners, and stakeholders to get clarification on business requirements and then implement solutions including code development and database design Required Skills: Bachelor’s degree in computer science, software engineering or related field (or equivalent years’ work experience) Demonstrated willingness and ability to adapt and learn new technologies and processes 5+ years of professional development experience Minimum of 5 years related experience in following: .NET framework and/or .NET core SQL Server Entity Framework Knowledge of common design patterns (Inversion of Control, Dependency Injection, etc.) Cloud experience 3+ years in some of the following: Source Control Azure DevOps Unit Testing Mobile Development Preferred Skills: Azure Xamarin Forms or MAUI Event/Message based architecture We are an equal opportunity employer and comply with all applicable federal, state, and local fair employment practices laws. We strictly prohibit and do not tolerate discrimination against employees, applicants, or any other covered persons because of race, color, sex, pregnancy status, age, national origin or ancestry, ethnicity, religion, creed, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, training, promotion, discipline, compensation, benefits, and termination of employment. We comply with the Americans with Disabilities Act (ADA), as amended by the ADA Amendments Act, and all applicable state or local law.Show more Report"
        ],
        "Hard Skills": [
            "Azure DevOps",
            "Entity Framework",
            "Microsoft Azure",
            ".NET Framework",
            "Software Design Patterns",
            "Unit Testing",
            "Agile Methodology",
            "Dependency Injection",
            "Continuous Delivery",
            "Business Requirements",
            "Marketing",
            "Software Engineering",
            "Mobile Application Development",
            "Scalability",
            "Customer Success Management",
            "Crash Reports",
            "Inversion Of Control",
            "SQL (Programming Language)",
            "Testability",
            "Xamarin",
            "Version Control",
            "Remote Monitoring",
            "Database Design",
            "Computer Science",
            "Software Development",
            "Back End (Software Engineering)"
        ],
        "Soft Skills": [
            "Curiosity",
            "Customer Service"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-3-boecore-JV_KO0,19_KE20,27.htm?jl=1008794154544": {
        "Location": "Alabama",
        "Data": [
            "Boecore, LLC. is seeking a Software Engineer in Huntsville, AL to support activities associated with missile defense, including the Command, Control, Battle Management and Communications (C2BMC) program on the Battle Management team.  Responsibilities: Applicant will be key contributor to the design and develop Java-based C2BMC applications. Candidate will help generate software design artifacts, implement software changes, support design and code reviews, support software testing and resolution of issues arising from software testing. Candidate may also be involved in the design and development of MATLAB based algorithms.  Minimum Requirements: Bachelor’s degree in computer science, mathematics, physics, software engineering or related engineering field from an accredited college and 5+ years of related experience. Experience in full life cycle software development of Java-based applications and systems. Hands-on development experience for Java-based applications in a UNIX/Linux platform environment. Experience developing software in a structured, process-based integrated team environment. Candidate should be comfortable with mathematical algorithm development or translating mathematical algorithm design into software. Use of common software development and management tools such as Git and Eclipse. Understanding of standard system engineering design artifacts such as System requirements, Use Cases and SysML diagrams. The successful candidate will have good verbal and written communication skills, have the ability to work independently, and will possess the poise and flexibility required to work in a highly dynamic environment. Applicant should have good working knowledge of MS Office products. Active DoD Secret clearance. Desired Requirements: Working knowledge of Ballistic Missile Defense concepts, Battle Management and Command and Control (BM/C2) systems, defense communications systems, and the BMDS in general is especially beneficial. Command and control system application development. Experience with Software Integration testing. Strong problem-solving skills, including the ability to review performance, identify root cause and recommend a solution. Salary Range: $84.5K - $115K  About Boecore Boecore is an aerospace and defense engineering company that specializes in software solutions, systems engineering, cybersecurity, enterprise networks, and mission operations. Our work couldn’t be more exciting, more challenging, or more vital to our customers and our nation’s defense. Since the company’s inception in 2000, Boecore’s employee-centric approach, rich work culture, and drive to go above and beyond expectations have earned the company a reputation as a trusted partner for the various government customers we work alongside.  Boecore employees are self-motivated individuals who are recognized and rewarded for their efforts. We offer competitive salaries, comprehensive health insurance coverage, life, and disability insurance, savings plans, company paid holidays and paid time off (PTO), AFLAC, tuition, and training reimbursement, matching 401(k) program, discretionary incentive bonuses in addition to base pay and a rewarding work environment with a proven record of success for 20 years.  Boecore is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, marital status, national origin, age, veteran status, disability, or any other protected class.Show more Report"
        ],
        "Hard Skills": [
            "Software Design",
            "Code Review",
            "Application Development",
            "Systems Engineering",
            "Software Testing",
            "Unix",
            "Algorithm Design",
            "Git (Version Control System)",
            "Secret Clearance",
            "Linux",
            "Algorithms",
            "Command Controls",
            "Battle Management Technology",
            "Eclipse (Software)",
            "Control Systems",
            "Communications Systems",
            "Java (Programming Language)",
            "Software Engineering",
            "Cyber Security",
            "MATLAB",
            "Software Development",
            "Computer Science",
            "Systems Integration",
            "Physics",
            "System Requirements",
            "Systems Modeling Language"
        ],
        "Soft Skills": [
            "Mathematics",
            "Writing",
            "Self-Motivation",
            "Operations",
            "Communications",
            "Management",
            "Problem Solving"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-level-i-uda-technologies-JV_KO0,25_KE26,42.htm?jl=1005564523734": {
        "Location": "Alabama",
        "Data": [
            "UDA Technologies is seeking individuals for Software Engineering and Technology positions in the Auburn office. Selected individuals will work as a team with software development, presales engineering, and marketing staff to develop and advance a suite of integrated project management software applications. Ideal candidates will have a software engineering, computer science, or related degree, have a mature and outgoing personality, excellent verbal and written communication skills, plus working knowledge in database development, Visual Studio.NET, VBA, T-SQL or Microsoft SQL Server 2000, GUI development, configuration management, network protocols, and XML (preferred but not required). These are full-time, long-term positions. Positions are highly competitive and candidates are encouraged to apply as soon as possible. Applications for full-time positions are accepted as early as one year before graduation. Benefits include excellent salary, 401K, profit-sharing, BlueCross BlueShield health and dental coverage, vacation, holidays and sick leave, discounted health club membership, opportunities for career advancement, and friendly office environment. Responsibilities:  Develop, document, and maintain product application source code Review and debug product application source code to maintain quality control standards Develop new components for growing software suite Provide advanced application support Evaluate customer needs and provide feedback for new product features Analyze and improve software development plan and procedures Participate in analyzing and planning new opportunities and markets for software Requirements:  B.S. in software engineering, computer science, or related degree Working knowledge of Visual Studio.NET, VBA, T-SQL or Microsoft SQL Server 2000, GUI development, configuration management, network protocols, and XML (preferred but not required) MCAD/MCP or MCSD preferred but not required Excellent verbal and written communication skills Understanding of software development cycles Ability to plan for and meet development deadlines Must be self-motivated, willing to learn and adapt to new situations, and focused on customer needs  Submit cover letter and resume to careers@uda1.comShow more Report"
        ],
        "Hard Skills": [
            "Software Suite",
            "Transact-SQL",
            "Microsoft Certified Professional",
            "Pre-Sales Engineering",
            "Graphical User Interface",
            "Debugging",
            "Extensible Markup Language (XML)",
            "Network Protocols",
            "Database Development",
            "Visual Basic For Applications",
            "Marketing",
            "Software Engineering",
            "Microsoft SQL Servers",
            "Microsoft Visual Studio",
            "Project Management Software",
            "Configuration Management",
            "Code Review",
            "Computer Science",
            "Software Development",
            "Technical Support",
            "Microsoft Certified Solution Developer (MCSD)",
            "New Product Development"
        ],
        "Soft Skills": [
            "Teamwork",
            "Quality Control",
            "Planning",
            "Willingness To Learn",
            "Writing",
            "Self-Motivation"
        ]
    },
    "https://www.glassdoor.com/job-listing/mid-level-software-engineer-e4-technology-JV_KO0,27_KE28,41.htm?jl=1006860143449": {
        "Location": "Alabama",
        "Data": [
            "Categories Software Enginer  Salary TBD  Location Huntsville, AL  Job Information Job Description  Mid-level Software Engineer supporting current Army Programs  If you are a Software Engineer with experience, please read on! E4 Technology, Inc. is a Professional, Engineering, and Information Technology (IT) Services Company focused on delivering tailored solutions to our customers. We provide a range of services to include the following:  Program Management Software Development Interoperability and Integration Testing Configuration Management Security Consulting Hardware Sales Integrated IT Solutions and Support  We are currently seeking qualified individuals with a minimum of 6 years Software Development experience to work directly onsite at one of our Army Government Customer installations. In addition the minimum experience and skillset identified below, a current DoD Secret Security Clearance is a plus, however, new security clearances can be issued by the customer on a case-by-case basis.  Top Reasons to Work with Us  E4 Technology, Inc. is a great small company that is growing and has the most competitive benefits and compensation package across industry.  What You Will Be Doing  In this role you will be responsible for deriving requirements, documenting the design and data structures, and developing software in Java and C++. The ideal candidate must be familiar with the software development life-cycle and familiarity with Agile principles. Additionally, understanding and how to follow CMMI practices is a plus.  What You Need for this Position  Minimum Education and/or Experience required:  Bachelor’s of Science Degree in Computer Science, Computer Engineering, or similar technical degree is required with a minimum of 6 years’ experience or a Master’s Degree and 4 years of experience, or at least 10 years of software development experience may be substituted in lieu of bachelor’s degree on a case-by-case basis. Experience developing software with Java and C++ in object oriented Working experience with Microsoft and LINUX operating environments  Preferred, but not required:  Current DoD Secret Security Clearance Experience developing HTML5 Web Applications Experience developing software under Agile principles Experience with User Interfaces (UI) and Human/Machine Interface (HMI) concepts Experience with Eclipse and Visual Studio is desired Other preferred Experience with the following tools and application concepts is a plus: Maven, Junit, Easy Mock, JIRA, GET, Fisheye, Bitbucket, World Wind, SIMDIS, ESRI, GJIS, BOSS, NSITE, Wireshark, LUA, Bash, Perl, and VMWare. What’s In It for You?  Competitive Salary, Strong Compensation and Benefits package! If you are a Software Engineer that meets the minimum aforementioned requirements, please apply today!  Our Privacy and Company Policies E4 Technology, Inc. is proud to be an Equal Opportunity Employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.  Applicant’s resume and any other personal information will be kept completely confidential and will not be retransmitted, forwarded, etc. without prior consent from the applicant. In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  Thank you for considering E4 Technology, Inc.! We look forward to receiving your resume and going over the position with you in more detail!Show more Report"
        ],
        "Hard Skills": [
            "Object-Oriented Programming (OOP)",
            "Perl (Programming Language)",
            "C++ (Programming Language)",
            "Junit",
            "Linux",
            "Human Machine Interfaces",
            "Microsoft Visual Studio",
            "Secret Clearance",
            "FishEye (Software)",
            "Software Development Life Cycle",
            "IT Service Management",
            "Apache Maven",
            "Eclipse (Software)",
            "Bitbucket",
            "JIRA",
            "Interoperability",
            "Integration Testing",
            "Java (Programming Language)",
            "Lua (Scripting Language)",
            "Data Structures",
            "HTML5",
            "Configuration Management",
            "ArcGIS (GIS Software)",
            "Computer Engineering",
            "Software Engineering",
            "Wireshark",
            "Bash (Scripting Language)",
            "Computer Science",
            "Software Development",
            "Agile Methodology",
            "Capability Maturity Model Integration",
            "User Interface (UI)"
        ],
        "Soft Skills": [
            "Consulting",
            "Program Management",
            "Information Technology",
            "Sales"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-developer-tyler-technologies-JV_KO0,18_KE19,37.htm?jl=1008847584928": {
        "Location": "Alabama",
        "Data": [
            "Tyler Technologies is a leader in digital government solutions and payments, partnering with government to deliver user-friendly digital services that make it easier and more efficient to interact with government. Our mission is to empower public sector entities to operate more efficiently and connect more transparently with their constituents and with each other.  Tyler Alabama is the State of Alabama’s premier provider of official eGovernment services, including websites, online services and secure payment processing solutions. Some examples of the services we've built in Alabama include online renewals for Driver Licenses, Online Voter Registration, Hunting & Fishing license purchases and the Outdoor Alabama mobile application.  Role Description As a Software Developer, you will have an opportunity to meaningfully improve the experience of millions of Alabama citizens, as we continue to make government interactions more accessible and convenient. This role is an entry- to mid-level software engineering position and reports to the Director of Development.  The services in our care currently include a wide array of: Java web applications ReactJS front ends NodeJS back-ends (using Serverless Framework) Mobile application built with React Native Creating and consuming REST, GraphQL and SOAP web services Batch processing, file exchanges or document generation Payment processing These applications are deployed on-premises to Java Application servers backed by Oracle databases, or in AWS leveraging several services such as API Gateway, Lambda, Step Functions, DynamoDB, Cognito, CloudFront or S3.  As a Software Developer, you will be tasked with designing, developing, and maintaining performant and secure web applications and APIs. You will also be expected to dedicate some of your time to collaborating with and learning from more experienced software engineers, as well as other, non-technical team members. You will have opportunities to focus on learning and expanding your skill set, and to apply what you've learned immediately on real projects. After a period of onboarding, where you will likely be paired with a more experienced engineer, and where you will familiarize yourself with our projects, methods and best practices, you will be tasked with completing increasingly complex development tasks, up to and including being the main developer on a full-stack project, once you've reached a sufficient level of proficiency. We understand that this journey takes different shapes for different individuals, and we will support you in any way we can.  Qualifications We are looking for engineers with an interest in developing and supporting web applications and APIs, preferably with Java MVC frameworks or with JavaScript front ends and back-ends, but we welcome applicants who have similar interest or experience in other technology stacks. You must be capable of communicating your ideas and solutions effectively to both technical and non-technical audiences.  A good understanding of the following is desirable: HTML/CSS and basic JavaScript API design principles and strategies Database modelling with either relational or non-relational databases (database structure, writing and debugging queries) Experience with any of the following would be great additions: Security as it applies to web applications Building and deploying applications in AWS ReactJS Serverless Framework Experience using and implementing APM and other Telemetry Experience assembling or using a sensible CI/CD pipeline PCI or HIPAA compliance requirements A specific degree is not required, we will gladly consider qualified applicants with alternative paths.Show more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "Relational Databases",
            "Application Programming Interface (API)",
            "API Gateway",
            "Batch Processing",
            "React Native",
            "Amazon DynamoDB",
            "Software Engineering",
            "Serverless Computing",
            "API Design",
            "Full Stack Development",
            "Model View Controller",
            "Java (Programming Language)",
            "React.js (Javascript Library)",
            "Web Services",
            "Online Service Provider",
            "Mobile Application Development",
            "Oracle Databases",
            "Node.js (Javascript Library)",
            "Amazon Web Services",
            "Payment Processing",
            "Web Application Security",
            "Amazon Cloudfront",
            "HyperText Markup Language (HTML)",
            "Cascading Style Sheets (CSS)",
            "Application Deployment",
            "CI/CD",
            "GraphQL",
            "Amazon Cognito",
            "JavaScript (Programming Language)",
            "Amazon S3",
            "Java Web Start",
            "Simple Object Access Protocol (SOAP)",
            "Health Insurance Portability And Accountability Act (HIPAA) Compliance"
        ],
        "Soft Skills": [
            "Communications",
            "Writing"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-gan-JV_KO0,17_KE18,21.htm?jl=1008725545645": {
        "Location": "Alabama",
        "Data": [
            "Overview:  Wanted - Big Brains & Huge Hearts: We are looking for creative and passionate geeks, nerds, thinkers, tinkerers, and builders. Geeks and Nerds is a company that encourages ingenuity, defies the norm, fosters teamwork, and defines the future for the community where we live. Our dedicated employees are also the owners of Geeks and Nerds. When you join GaN you are not just an employee, you are the future owner of Geeks and Nerds. Come join the company and develop innovative solutions to make a positive difference for our community. Come join the exceptionally talented and dedicated co-owners. Come join a company of significance! Do you enjoy developing solutions to support Open Architecture Software? We are looking for exceptional candidates for a Software Engineering role. Apply today and become an owner where big hearts and big brains meet. Job Overview: GaN is seeking an experienced Software Engineer to join our team in Huntsville, Alabama. Responsibilities:  Clearance: SECRET IS REQUIRED Required: SECRET security clearance. S. in a technical field such as Computer Engineering, Electrical Engineering, Computer Science. Minimum 5+ years relevant experience. Experience supporting a Government Project or Product Office in an acquisition organization such as PEO AVN or PEO M&S. Accomplished self-starter with the ability to work in a small team with minimal supervision. Experience collaborating with project or product office personnel. Experience with open standards such as FACE Technical Standard, HOST Standard, SOSA Technical Standard, VICTORY, OMS, etc. Provide key software technical expertise for documentation review, analysis of Program or Contractor metrics, schedule, and cost estimates. Identify and track software risk areas for the program and implement risk mitigation plans. Assist PMs, or other customers, to generate metrics and measurement techniques to provide program office leadership with timely and accurate information on the state of ongoing and planned efforts. Assist PMs in development of cybersecurity documentation and coordination of cybersecurity test events. Develop/Review system/subsystem specifications, system architectures, program briefings, white papers, and other products. Experience developing contract language and requirements, reviewing, and evaluating contractor deliverables. Desired Program Management or Project Management experience. Prefer Experience with Army Aviation platforms such as Apache, Blackhawk, Chinook, UAS, FLRAA or FARA. Knowledge of at least one Object-Oriented Programming (OOP) language. Prefer Experience using common Model-Based Systems Engineering tools (e.g., Cameo, Rhapsody, etc.). Experience using issue-tracking software such as Jira or Git Experience. Qualifications:  Geeks and Nerds is an innovative technology company that encourages ingenuity, defies the norm, fosters teamwork, and defines the future for our community and nation. We are an Employee-Owned company which means our dedicated team members are also the owners of Geeks and Nerds. When you join GaN, you are not an employee; you are the future owner of Geeks and Nerds. Come join the company that develops innovative solutions that makes a positive difference in our community and nation. Come join the exceptionally talented and dedicated co-owners. Join a company of significance!  GaN Corporation is an Equal Opportunity Employer. We are pleased to consider all qualified applicants for employment without regard to race, color, gender, sexual orientation, gender identity, religion, national origin, age, marital status, veteran status, disability, genetic information or any other legally protected classifications. GaN Corporation participates in E-Verify.Show more Report"
        ],
        "Hard Skills": [
            "Object-Oriented Programming (OOP)",
            "Model Based Systems Engineering",
            "Open Standards",
            "Secret Clearance",
            "Git (Version Control System)",
            "JIRA",
            "Risk Mitigation",
            "Project Management",
            "Technical Standard",
            "Software Engineering",
            "Cyber Security",
            "Computer Engineering",
            "Computer Science",
            "Electrical Engineering"
        ],
        "Soft Skills": [
            "Ingenuity",
            "Self-Motivation",
            "Program Management",
            "Teamwork",
            "Supervision",
            "Coordinating",
            "Innovation",
            "Leadership"
        ]
    },
    "https://www.glassdoor.com/job-listing/software-engineer-passionhr-inc-JV_KO0,17_KE18,31.htm?jl=1008925836173": {
        "Location": "Alabama",
        "Data": [
            "SOFTWARE ENGINEER Huntsville, AL Basic Qualifications: Bachelor of Computer Science, Bachelor of Engineering or related technical field Ability to understand and interpret requirements and test guidance to complete configuration item and product-level integration testing Demonstrated proficiency in analytical thinking and problem solving skills and Systems Thinking mindset Experience writing code and compiling software programs Familiar with debugging and troubleshooting software programs Excellent decision making and communication (written and verbal) skills Experience with Agile Scrum Test Lifecycle Ability to work in a collaborative, Agile IPT environment Ability and willingness to travel 10% to support business needs Preferred Qualifications: Security+ certification GMD/MDA Experience Missile Defense Experience Experience with UNIX, Linux and Windows operating systems Experience in IBM Rational eDOORS system software Experience in Atlassian Jira software Experience in Integrated Digital Engineering Environments Experience in Continuous Integration/ Continuous Delivery Software Development Experience with continuous integration and delivery in accordance with DevSecOps processes and best practices Containerization and Software Implemented Servers Experience Experience writing automated tests Candidate must be a U.S. Citizen. Candidate must be able to obtain a Secret Clearance. This is a full-time position located in Huntsville, AL. EOEShow more Report"
        ],
        "Hard Skills": [
            "Debugging",
            "System Software",
            "DevSecOps",
            "CompTIA Security+",
            "Unix",
            "Secret Clearance",
            "Linux",
            "Scrum (Software Development)",
            "Continuous Integration",
            "Continuous Delivery",
            "Internet Protocol Telephony",
            "Integration Testing",
            "IBM Rational Software",
            "Containerization",
            "JIRA",
            "Configuration Item",
            "Computer Science",
            "Agile Methodology",
            "Software Development"
        ],
        "Soft Skills": [
            "Analytical Thinking",
            "Systems Thinking",
            "Communications",
            "Decision Making",
            "Problem Solving"
        ]
    }
}